[{
        "level": 1,
        "subtopic": [{
                "id": 1,
                "content": [{
                        "id": 1,
                        "name": "The Pillars of Islam",
                        "content": "It is important to define the term ‘rukn’ at the outset. Linguistically speaking, rukn denotes the mainstay of something which provides it with strong support.This is why it is often referred to as ‘pillar’. In an Islamic context, rukn is a part of something that is essential for its completion. Thus both the rukn and the condition are essential for something to take place, but a condition is not part of that something, while a rukn is. 'Bowing', or ruku', is a rukn of prayer, because it is a part of it and its omission renders the prayer invalid, while ablution, or wudu’, is a condition, because it is essential for the validity of prayer but is not a part of it. To re-emphasize, both rukn and condition are essential for the validity of prayer, but they differ in the following ways: 1. Conditions take place before the prayer, while rukns are within it; 2. Conditions start before a prayer and continue until it has finished, while rukns are temporary, with one yielding to the next. Each of the following consecutive acts is a rukn of prayer: standing up, bowing, standing up again, prostration, rising, etc. 3. The combination of all rukns constitute the prayer, but this is not so with the conditions. To cover up certain parts of the worshipper’s body is a condition but it forms no part of the prayer."
                    },
                    {
                        "id": 2,
                        "name": "The first rukn: the declaration",
                        "content": "I bear witness that there is no deity worthy of being worshipped other than Allah, and I bear witness that Muhammad is Allah’s messenger.’ This declaration testifying to two important facts is the gateway to Islam. It is indeed the most essential aspect of Islam. No one is considered a Muslim unless he or she makes this declaration. Once it is said by a disbeliever, he becomes a Muslim. What the declaration means The first part, ‘There is no deity worthy of being worshiped other than Allah’, means that no one may be rightly worshipped except Allah, the Glorious, the Most High. This part includes two essential elements: a negation and a confirmation. It negates “worthiness of being worshipped” of anyone other than Allah, and it confirms that divinity belongs to Him alone, without partners."
                    }
                ]
            },
            {
                "id": 2,
                "content": [{
                    "id": 1,
                    "name": "The second rukn: prayer",
                    "content": "Prayer is the second most important act of worship. It makes one’s status as a Muslim clearly evident. Therefore, Islam attaches great value to it, highlighting its status as a bond between man and Allah and demonstrating man’s obedience of his Lord. Status of one who does not pray Whoever does not offer prayers, denying it as an obligation, is, in effect, a disbeliever and such deliberate negligence places the one who is guilty of it outside the Islamic faith. Such a person is an apostate, rejecting Islam altogether, because he or she disobeys Allah, neglecting what Allah has made obligatory. Such a person is instructed to repent and mend his ways. If he does not, he becomes an apostate. As such, his body is not washed when he dies, the funeral prayer for the deceased is not offered for him and he must not be buried in Muslims’ graveyards because he does not belong to them."
                }]
            },
            {
                "id": 3,
                "content": [{
                    "id": 1,
                    "name": "The third rukn: zakat",
                    "content": "Definition: Linguistically speaking, zakat means growth and increase. It also refers to praise, cleansing and good behaviour. Hence, the money paid out of one’s assets is called zakat because Allah blesses one’s property as a result, leading to its growth, and the person paying zakat is cleansed as Allah forgives him his sins. In an Islamic context, zakat means a duty paid out of certain types of property, by certain people, to one of the eight specified categories mentioned in 9:60 at a specific time. Importance: Zakat is one of the five pillars upon which the structure of Islam is built."
                }]
            },
            {
                "id": 4,
                "content": [{
                    "id": 1,
                    "name": "The fourth rukn: fasting in Ramadan",
                    "content": "Definition: Linguistically speaking, fasting means abstention. In an Islamic context it is to abstain from whatever breaks the fast from dawn until sunset with the intention of worshipping Allah. Status: Fasting the days of the month of Ramadan is one of the main pillars of Islam, as Allah says: ‘Believers, fasting is decreed for you as it was decreed for those before you, so that you may develop piety’"
                }]
            },
            {
                "id": 5,
                "content": [{
                    "id": 1,
                    "name": "The fifth rukn: the pilgrimage",
                    "content": "Definition: Linguistically speaking, hajj, or pilgrimage, means ‘setting off for a definite destination’. In an Islamic context, it means travelling to Makkah to perform this duty according to a particular manner, at a specific time and under specific conditions. Status: The Muslim community is unanimous that the pilgrimage is obligatory to every Muslim who can afford the journey once in a lifetime, and that it is one of the five pillars upon which the structure of Islam is built."
                }]
            }
        ]
    },

    {
        "level": 2,
        "subtopic": [{
                "id": 1,
                "content": [{
                    "id": 1,
                    "name": "Islamic Law (Fiqh)",
                    "content": "Definition of Fiqh: Linguistically speaking, the Arabic term 'Fiqh' has several meanings, including 'understanding' and 'profound and accurate understanding'. In an Islamic context, it means 'knowledge of Islamic rulings on practical matters based on detailed evidence.'[1] The subject matter of Fiqh is the description of different forms of worship and transactions and their Islamic rulings: obligation, prohibition, recommendation, reprehension and permissibly. These apply to all that a person does including prayer, fasting, zakat, commercial transactions such as selling, hiring, letting, gifting or mortgaging, killing, theft, jihad, etc. Compared with man-made codes of law, Islamic Fiqh has a number of special features and qualities that make it unique and superior to all codes. We can identify these qualities by looking at the sources of Islamic law."
                }]
            },
            {
                "id": 2,
                "content": [{
                    "id": 1,
                    "name": "Sources of Islamic legislation",
                    "content": "One: Textual sources 1-The Qur’an. It embodies the Islamic faith and the revelation that explains the faith Allah wants all people, in all ages, to adopt. It is indeed the first resort to which a scholar must refer when considering a ruling on any question. It is equally applicable to all people in all generations. Allah commands people to follow and implement His rulings of permission and prohibition outlined in the Qur’an.:He says‘Follow, , what has been revealed to you from your Lord, and do not follow other than Him any allies.’ (7:3) 2-The Sunnah. This is the second source of Islamic legislation, ranking next to the Qur’an. It is defined as ‘everything authentically reported to have been said, done or approved by the Prophet (peace be upon him)’. Scholars are unanimous that the Sunnah is binding and serves as a source of legislation. It is unanimously agreed that the Sunnah must be implemented provided that its authenticity is established and it is not exclusive to the Prophet (peace be upon him) himself. Its verdicts of permissibility and prohibition are equally valid as the Quran. Two: Sources requiring scholarly endeavour (i.e. ijtihad) 1-Unanimity (i.e. Ijma'): This means the consensus by all scholars who are qualified to exercise ijtihad, i.e. scholarly endeavour, in any particular period after the era of Prophethood, to arrive at a practical ruling. 2- Analogy (i.e. Qiyas): This means applying the ruling specified by a religious text on a certain matter to another matter for which no text refers, provided that the same reasoning applies to both of them. 3-Subtle analogy (i.e. Istihsan): Discarding the verdict of a clear analogy in preference of a subtle one, or discarding a universal verdict in preference of a peculiar one, provided that such a process is based on firm evidence. 4- Interests without rulings (i.e. Masalih Mursalah): This refers to matters that bring benefit to people but there is no religious evidence that approves or disapproves of them. Nor are there cases to which they may be compared in order to arrive at rulings concerning them through analogy. However, a ruling on such a matter is important because it brings some benefit or prevents some harm, which is the ultimate aim of Islamic law. 5- Customs of Muslims (i.e. al- 'Urf): This refers to what people traditionally do or say and is not contrary to any religious text. Tradition and habit, which means something repeatedly done, signify the same thing, and they apply to speech and deeds. 6- Statements by the Prophet’s (peace be upon him) Companions’: A statement by a Companion of the Prophet (peace be upon him) relating to something that cannot be determined by reasoning or research, such as essential religious matters and worship practices, is accepted as valid. It is considered to have been learnt directly from the Prophet (peace be upon him). Hence, scholars consider such a statement as a hadith with a chain of transmission going up to the Prophet’s (peace be upon him) Companion, without being expressly attributed to the Prophet(peace be upon him). As such, it is part of the Sunnah, although it appears to be a Companion’s view. 7- The laws of earlier divine religions: This refers to legislation given by Allah to past communities through their own Prophets (peace be upon them all). Muslim scholars have studied such laws and whether they apply to us or not. 8- Prevention of what leads to the prohibited (i.e. sadd al-dhara’i'): This aims to prohibit any means that leads to something forbidden that involves harm. According to scholars of Fiqh methodology dhara’i' means whatever is done in order to facilitate doing something forbidden that involves causing harm. What facilitates something forbidden is forbidden, just like what facilitates something obligatory is obligatory. 9- Al-Istishab: This means giving something its original ruling, as it was recognized, unless there is evidence confirming that this original ruling has been subject to change. Alternatively, it may be defined as considering the original ruling continuing for the present and the future until something appears to change it based on evidence. In essence, what was established in the past should normally remain valid for the future."
                }]
            },
            {
                "id": 3,
                "content": [{
                        "id": 1,
                        "name": "The Leading Fiqh Scholars (Founders of the four schools of Fiqh)",
                        "content": "1-Imam Abu Hanifah\nImam al-Nu'man ibn Thabit, more widely known by his nickname Abu Hanifah, was born in Kufah, Iraq, in 80 AH/700 CE. He was of Persian origin, but Arab by birth and upbringing, and belonged to a rich and very religious family.\nHe memorized the Qur’an at a young age, learning its recitation under 'Asim ibn Abi al-Nujud of Kufah, who was one of the best-known reciters of the Qur’an. He frequented the circles of a large number of Kufah scholars, from whom he learned about Fiqh and Hadith.\nIn the beginning, he was interested in scholastic theology, but he did not pursue that branch for long, turning his attention to Hadith and Fiqh. He learned the Hadith under 'Ata’ ibn Abi Rabah and Nafi', the disciple of 'Abdullah ibn 'Umar. His main teacher was Hammad ibn Abi Sulayman, and he continued to attend him until he passed away. Following the death of Hammad, after having spent 18 years with him, Abu Hanifah replaced his teacher. He was 40 at the time.\nAbu Hanifah then started to explain his methodology of arriving at rulings for different questions, and his approach to Fiqh. His views gained acceptance and he secured wide popularity.\nIt should be made clear that Abu Hanifah learned from a large number of leading scholars. He is best known as the leading scholar of the school that gives prominence to personal reasoning, and he was the main Fiqh scholar in Iraq. Imam al-Shafi'i said of him: ‘In Fiqh, all of us are indebted to Abu Hanifah.’ Abu Hanifah died in 150 AH (768 CE).\nMethodology of the Hanafi school\nExplaining his methodology of arriving at rulings, Abu Hanifah said: ‘I refer first of all to Allah’s book, the Qur’an. If I do not find in it what is applicable, I refer to the Prophet’s (peace be upon him) Sunnah and the authentic reports of his guidance that are well known. If I find nothing in either Allah’s book or the Prophet’s (peace be upon him) Sunnah, I refer to his companions, taking the view of whomever I prefer and leaving aside others, but I would never discard all their views in preference to anyone else’s view. If I find nothing and the matter is left to people like Ibrahim and al-Sha'bi, (naming a few others), I look into the question myself, just like they did.’"
                    },
                    {
                        "id": 2,
                        "name": "Imam Malik ibn Anas",
                        "content": "Malik ibn Anas ibn Malik (93–179 AH/712–794 CE) was born in Madinah in the same year the Prophet’s (peace be upon him) Companion Anas ibn Malik died. He spent all his life there, and was very devout, intelligent and courageous. He would not hesitate to express his views, fearing nothing, which led to him being severely punished and flogged in later life, due to his verdict that divorce under duress is invalid. The torture he was subjected to resulted in dislocation of his arm and caused him to suffer from incontinence until he died.\nMalik was brought up in Madinah, where the Sunnah flourished, as the city was the place where a large number of the children and grandchildren of the Prophet’s (peace be upon him) Companions still lived. Indeed, some of his 900 teachers were drawn from among them, but the main figures who influenced him greatly were 'Abdullah ibn Hurmuz, his first teacher from whom Malik learnt to say, ‘I don’t know’ whenever he was unclear about a question, Nafi', the disciple of 'Abdullah ibn 'Umar, Muhammad ibn Shihab al-Zuhri and Rabi'ah ibn 'Abd al-Rahman, known by his nickname Rabi'ah al-Ra’y."
                    },
                    {
                        "id": 3,
                        "name": "Imam Al-Shafi'i",
                        "content": "Abu 'Abdullah Muhammad ibn Idris al-Shafi'i (150–204 AH/768–820 CE) was born in Gaza and was only two years old when his mother took him to Makkah, where his father’s family came from. He was brought up by his mother, who was a very devout woman, and by the age of seven, al-Shafi'i had completed memorizing the Qur’an, and by 10 he had memorized Al-Muwatta’, the Hadith and Fiqh anthology of Imam Malik. At a young age he joined the desert tribe of Hudhayl, one of the most eloquent Arabian tribes, where he learnt much of their poetry and stayed with them for some years. When he returned to Makkah, he had attained a superior standard of eloquence and knowledge of Arabic."
                    },
                    {
                        "id": 4,
                        "name": "Imam Ahmad ibn Hanbal",
                        "content": "Ahmad ibn Hanbal (164–241 AH/782–856 CE) was born in Baghdad, which was at the time the capital of learning, with numerous scholars of Islamic studies and all other branches of study, and the capital of the Islamic state.\nHe was recognized as highly intelligent and very devout, and began his learning at a young age and memorized the Qur’an. He lost his father when he was young and thereafter relied on his own efforts. As he grew up he earned a reputation for hard work, perseverance and patience in adversity. Older scholars recognized that he had great potential."
                    },
                    {
                        "id": 5,
                        "name": "The main reference works of the four schools",
                        "content": "One: the Hanafi school\nAmong the best known works that explain the Hanafi school of Fiqh is Ibn 'Abidin’s Radd al-Muhtar 'ala al-Durr al-Mukhtar; Mas'ud al-Kasani’s Bada’i' al-Sana’i' fi Tartib al-Shara’i'; and Ibn al-Hammam’s Fath al-Qadir.\nTwo: the Maliki school\nOne of the most important reference works of the Maliki school is Sahnun’s Al-Mudawwanah, in which the author reports Imam Malik’s rulings and statements as transmitted by 'Abd al-Rahman ibn al-Qasim. The most important work that expresses the views of this school is Mukhtasar Khalil, which has been annotated and explained by various scholars. These include al-Dardir’s Al-Sharh al-Kabir, with further annotations by Ibn 'Abd al-Barr in his At-Tamhid, and Ibn Rushd’s Bidayat al-Mujtahid."
                    }
                ]
            }
        ]
    },

    {
        "level": 3,
        "subtopic": [{
                "id": 1,
                "content": [{
                        "id": 1,
                        "name": "Purification",
                        "content": "Linguistically speaking, purification means cleanliness and being free of dirt. Technically, purity is divided into two types; removing the filth and uplifting the ritual status of impurity. Filth or better known as Najasah in Arabic is physical substance that must be washed or removed from the body, clothes and the spot a worshipper is using for prayer. Urine, stool, menstrual blood, a dog’s saliva among other things are considered najis or impure. The second part of purity is uplifting both minor and major impurity. Minor impurity is caused by answering the call of nature, passing wind, sleeping or eating camel’s meat. Such minor ritual impurity is uplifted by performing ablution (wudhu). Major ritual impurity is caused by ejaculation, sexual intercourse or discharge of blood in menses or after giving birth. This major ritual impurity is uplifted by taking ritual bath or Ghusul."
                    },
                    {
                        "id": 2,
                        "name": "The water used for purification",
                        "content": "Any water could be used for purification if it retains its original state as it is created. This water is called “Tahur” and it could be taken from any source; whether it is rain, rivers or coming up from the earth. The water that ensures purification is called tahur, and it is defined as pure and purifying. It is every type of water that retains its original state as it is created, whether it falls from the sky, such as rain water, snow and hail, or comes up from the earth, such as the water of rivers, springs, wells and seas.\n\n\"Allah says: ‘He sent down water from the sky to purify you’ (8:11) and ‘We cause pure water to descend from the skies’  (25:48)\n\nThe Prophet (peace be upon him) prayed: ‘My Lord, wash off my sins with snow, water and hail’"
                    },
                    {
                        "id": 3,
                        "name": "Containers, plates and utensils",
                        "content": "It is permissible to all Muslims to use all types of utensils, containers and plate including those made from metal. Under this heading all types of utensils are included, including metal containers. To start with, these are permissible to use, as Allah says: ‘It is He who created for you all that is on earth.’"
                    },
                    {
                        "id": 4,
                        "name": "Use of gold and silver articles in purification",
                        "content": "Using any kind of utensils or articles including gold or silver for food is prohibited in Islam. Even if they are only plated with it or just contain a small part. All other precious materials are permissible. All plates, utensils and articles are permissible to use for food, drink and other purposes, provided that they are not impure, including precious ones. The only exception is the use of gold and silver articles for food and drink. This particular use is forbidden, as the Prophet (peace be upon him) said: ‘Do not drink from cups made of gold and silver, nor eat from plates made of them. They belong to unbelievers in this life and to us in the life to come.’ Related by al-Bukhari, hadith No. 5,426; Muslim, hadith No. 2,067: He also said: ‘A person who drinks from silver cups is like one putting the fire of hell in his stomach.’ Related by al-Bukhari, hadith No. 5,634; Muslim, hadith No. 2,065. These statements of prohibition specifically mention eating and drinking, but do not refer to other uses, which indicates that these utensils may be used for other purposes. The prohibition is general; therefore, it applies to utensils made of pure gold or silver, or plated with them, or those that contain some gold or silver."
                    },
                    {
                        "id": 5,
                        "name": "Utensils welded with gold or silver",
                        "content": "In Islam people cannot eat in gold utensil even if a small amount was used for welding. It becomes unlawful. On the other hand, God has made it permitted for Muslims to use utensils welded with a small amount of silver. If gold is used for welding a broken utensil, it becomes unlawful to use because the aforementioned hadith applies to it. If a small amount of silver is used for welding, it is permissible to use, [1] as clearly understood from the hadith reported by Anas ibn Malik:\n\n‘The Prophet’s (peace be upon him) mug was broken and he used a small chain of silver to mend the break’\n\nRelated by al-Bukhari, hadith No. 3,109"
                    },
                    {
                        "id": 6,
                        "name": "Unbelievers’ utensils",
                        "content": "The primary ruling is that these are permissible to use. However, if it is known that they are contaminated with impurity, then they may not be used until they have been washed. \n\n:Abu Tha'labah al-Khushni reported\n\n‘I said: “O Messenger of Allah, we live among people who belong to earlier religions: is it permissible for us to eat in their plates? ” He said:  “Do not eat in their plates. If you find nothing else, wash them and use them.”’\n\nRelated by al-Bukhari, hadith No. 5,478; Muslim, hadith No. 1,930\n\nIf such plates and utensils are not known to be contaminated with impurity, as in the case when their owners are known to handle no impurity, they are permissible to use.[1] \n\n‘It is confirmed that the Prophet (peace be upon him) and his Companions took water for their ablution from a large waterskin belonging to an idolater woman.’\n\nRelated by al-Bukhari, hadith No. 5,426; Muslim, hadith No. 682\n\nAllah has made it permissible for Muslims to eat the food of the people of earlier revelations, and they are likely to serve it in their own plates and utensils.:\n\nAnas reports\n‘A Jew invited the Prophet (peace be upon him) to a meal made of barley bread and fat that has changed color, and he accepted the invitation.’\n\nRelated by Ahmad, hadith No. 13,201"
                    },
                    {
                        "id": 7,
                        "name": "Utensils made of the hide of carrion",
                        "content": "One is permitted to use animals hide normally permissible to eat after being purified by tanning. As for animals that are not permissible to eat, they could not be used as their hide could not be purified by tanning.\n\nThe hide of dead animals (carrion) that are permissible to eat is purified by tanning, and they then become permissible to use.\n\n:The Prophet (peace be upon him) says\n\n‘Any hide becomes purified when tanned.’\n\nWhen the Prophet (peace be upon him) passed by a dead sheep, he said to his Companions\n\n‘Would you take its hide and use it? They said that it was carrion. He said: It is only forbidden to eat.’\n\nThis ruling applies to animals that are lawful to eat when slaughtered in the proper way.\n\nThe hide of dead animals that are permissible to eat is purified by tanning, and they then become permissible to use.\n\n:The Prophet (peace be upon him) says\n\n‘Any hide becomes purified when tanned.’\n\nRelated by Ahmad, hadith No. 1,895; al-Tirmidhi, hadith No. 1,728; al-Nassa’i hadith No. 4,241; Ibn Majah, hadith No. 3,609. Al-Tirmidhi graded it as ‘good and authentic\n\n:When the Prophet passed by a dead sheep, he said to his Companions\n\n‘Would you take its hide and use it? They said that it was carrion. He said: It is only forbidden to eat .’\n\nRelated by Muslim, hadith No. 363\n\nThis ruling applies to animals that are lawful to eat when slaughtered in the proper way.:\n\nAllah says in the Qur’an\n\n‘Say: In all that has been revealed to me, I do not find anything forbidden to eat if one wishes to eat thereof, unless it be carrion, or blood poured forth, or the flesh of swine – for all that is impure” (6:145)\n\nThe hide is considered to have been tanned when it is cleaned of all impurity and dirt using water mixed with salt or a tanning agent extracted from plants such as the Acacia nilotica.\n\nThe hide of dead animals that are not permissible to eat is not purified by tanning. Thus, the hide of a dead cat is not purified by tanning even though it is not impure when the cat is alive. This applies to the hide of all animals that are not permissible to eat.\n\nIn summary, animals that die naturally are impure, but their hide is purified when tanned if they are normally permissible to eat. The hide of animals that are forbidden to eat is not purified by tanning."
                    },
                    {
                        "id": 8,
                        "name": "Using the toilet and its manners",
                        "content": "There is etiquette that must be followed when using the toilet. Islam has described how one should take care of his personal hygiene. Other acts are prohibited like facing or turning one’s back to the qiblah.\n\nThe use of water or solids, and whether either is sufficient.\n\nIstinja’ is the Arabic word used for the removal of traces of what is discharged through the private parts, while istijmar signifies the use of a cleansing solid object, such as toilet paper or something similar. Either one is sufficient, as it is authentically reported.\n\n:Anas said\n\n‘The Prophet (peace be upon him) used to go to the toilet. I and another lad of about my age would carry for him a small waterskin and a staff. He would use water to cleanse himself.’\n\nRelated by al-Bukhari, hadith No. 152, Muslim, hadith No. 271\n\n:A’ishah quotes the Prophet (peace be upon him) as saying\n\n‘When any of you goes to the toilet, he should cleanse himself with three stones, as that is sufficient.’\n\nRelated by Ahmad, hadith No. 24,771; Abu Dawud, hadith No. 40; al-Nassa’i, hadith No. 44; al-Daraqutni, hadith No. 147\n\nHowever, to use both the solid and water is preferable.\n\nIstijmar involves wiping with a solid object that is pure and cleansing, such as toilet paper, stones, wood, etc. The Prophet (peace be upon him) used stones for the purpose, and whatever achieves the same results is also acceptable.[1]\n\nA minimum of three wipes is required, as clearly understood from the hadith reported by Salman:\n\n‘The Prophet (peace be upon him) prohibited that one should face or turn one’s back to the qiblah (i.e. the same direction faced in prayer) when one goes to the toilet for urination or defecation, or to use one’s right hand for cleansing oneself after that, or cleansing with less than three stones, or with animal bones or animal faeces.’\n\nRelated by Muslim, hadith No. 262"
                    },
                    {
                        "id": 9,
                        "name": "Facing the qiblah when relieving oneself",
                        "content": "Facing the qiblah or turning one’s back to it in an open area when relieving oneself is prohibited. However, if the toilet is in a building or there is a screen between the person using it and the qiblah, one may use it.\n\nIf a person is relieving oneself in an open area, as in the desert, one may not face the qiblah or turn one’s back to it. \n\n:Abu Ayyub al-Ansari quotes the Prophet (peace be upon him) as saying\n\n‘When you go to the toilet, do not face the qiblah and do not turn your back to it, but face the east or the west.’  \n\nAbu Ayyub adds:\n\n‘When we travelled to Syria, we found toilets that were built towards the direction of the Ka'bah. Therefore, we used them sideways and prayed for forgiveness.’\n\nIf the toilet is within a building, or when there is a screen between the person using it and the qiblah, one may use it.\n\n: 'Abdullah ibn 'Umar reports\n\n‘I went over Hafsah’s roof for something I needed. I went over Hafsah’s roof for something I needed.I overlooked the Prophet (peace be upon him) sitting for his toilet with his back towards the qiblah and facing Syria.’  \n\nRelated by al-Bukhari, hadith No. 148, Muslim, hadith  No. 266\n\n:Marwan reports\n\n‘I saw 'Abdullah ibn 'Umar when he sat his camel facing the qiblah, and then he sat to urinate. I said to him: “Abu 'Abd al-Rahman, is not this way prohibited?” He said: “Yes, when in an open area; but when there is something to screen you from the qiblah, then there is no harm.’ \n\nRelated by Abu Dawud, hadith No. 11; al-Daraqutni, hadith No. 161; al-Hakim, vol. 1, p. 256\n\nHowever, it is more preferable not to face the qiblah when in the toilet, even in buildings."
                    },
                    {
                        "id": 10,
                        "name": "When going to the toilet",
                        "content": "More than one hadith clarify what should be done when going to the toilet. Entering with the left foot and leaving with the right one is recommended, as well as saying some prayers and other points discussed below.\n\nWhen one goes to the toilet, one is recommended to say before entering: ‘In the name of ِAllah. My Lord, I seek shelter with You from all that is dirty and foul.’’ In other reports: In the name of Allah. My Lord, I seek shelter with You from male and females devils’. On finishing and leaving, one is recommended to say: ‘I seek Your forgiveness.’ It is recommended to put one’s left foot first on entering and one’s right foot first on leaving, and not to uncover one’s private parts until one is close to the lavatory. If one is doing it in an open area, one is recommended to go far and seek a position where one cannot be seen. Most of these points are mentioned in the following hadiths:\n\n:Jabir reports\n\n‘We were with Allah’s messenger on travel. When he needed to go to the toilet, he would go far away from us so as no one could see him.’ \n\nRelated by Abu Dawud, hadith No. 2; Ibn Majah, hadith No. 335. See: Sahih Ibn Majah, vol. 1, p. 60\n\n:Ali quoted the Prophet (peace be upon him) as saying\n\n‘To say, “in the name of Allah”, when one goes to the toilet is to ensure that the jinn cannot see the private parts of humans.’ \n\nRelated by al-Tirmidhi, hadith No. 606; Ibn Majah, hadith No. 297\n:Anas reports\n‘When the Prophet (peace be upon him) went to the toilet, he would say, “My Lord, I seek Your shelter from all that is dirty and foul.’ \n\nRelated by al-Bukhari, hadith No. 142; Muslim, hadith No. 375\n\n:A’ishah reports\n‘When the Prophet (peace be upon him) came out after being to the toilet, he would say, “I seek Your forgiveness.’ \n\nRelated by Abu Dawud, hadith No. 30; al-Tirmidhi, hadith No. 7\n\nAbdullah ibn 'Umar said\n‘When the Prophet (peace be upon him) went to the toilet, he would not lift his robes until he was close to the ground.’\n\nRelated by Abu Dawud, hadith No. 14; al-Tirmidhi, hadith No. 14"
                    },
                    {
                        "id": 11,
                        "name": "What is forbidden when relieving oneself",
                        "content": "What is forbidden when relieving oneself\n\nGod has forbidden some acts when one relieves himself like urinating or defecating in stagnant water, by roadsides or reading Quran in the toilet. This article clarifies all these acts and the reason behind each.\n\nIt is forbidden to urinate in stagnant water, as stated in the hadith reported by Jabir:\n\n‘Allah’s messenger prohibited urination in stagnant water.’ \n\nRelated by Muslim, hadith  No. 281\n\nIt is also forbidden to hold the Qur’an or to read it when one is in the toilet, as the Qur’an should always be treated with respect. One should not hold one’s penis with one’s right hand when urinating, and one should not use it to clean oneself after urination or defecation.\n\n:The Prophet (peace be upon him) said\n\n‘When any of you urinates, he should not hold his organ in his right hand, nor use his right hand to clean himself.’ \n\nRelated by al-Bukhari, hadith No. 154; Muslim, hadith No. 267\n\nIt is also forbidden to urinate or defecate by the roadside, or in the shade, or in parks, or under a fruit tree, or close to water sources.\n\n:Mu’adh quotes the Prophet (peace be upon him) as saying\n\n‘Guard against the three practices which invite people’s curses: answering the call of nature near water sources, by the roadside and in the shade.’ \n\nRelated by Abu Dawud, hadith No. 26; Ibn Majah, hadi No. 328; al-Hakim, vol. 1, p. 273\n\n:Abu Hurayrah quotes the Prophet (peace be upon him) as saying\n\n‘Guard against the two practices which invite people’s curses.” People asked what these practices were. He said: “Answering the call of nature  by the roadside and in the shade.’ \n\nRelated by Muslim, hadith No. 269 \n\nIn the shade’ refers to places where people normally take their rest. This may be under a tree or next to a wall.\n\nFurthermore, it is forbidden to wipe one’s private parts after defecation with animal droppings, bones or food.\n\n:Jabir reports\n\n‘Allah’s messenger prohibited that one should wipe oneself with a bone or animal droppings.’ \n\nRelated by Muslim, hadith No. 263\n\nMoreover, it is forbidden to answer to the call of nature in a graveyard. \n\n:The Prophet (peace be upon him) said\n\n‘It is the same whether to relieve oneself in between graves or in the middle of the marketplace‘\n\nRelated by Ibn Majah, hadith  No. 1,567"
                    },
                    {
                        "id": 12,
                        "name": "What is reprehensible when relieving oneself",
                        "content": "Some acts are reprehensible when someone is relieving himself such as talking to anyone or to urinate over a crevice in the ground. It is also reprehensible to urinate facing wind direction if it is in an open area.\n\nWhen relieving oneself in an open area and it is windy, it is reprehensible to do it facing the direction of the wind, so as to guard against the possibility of the urine being blown back at oneself. It is also reprehensible to converse with anyone.\n\n‘A man passed by the Prophet (peace be upon him) as he was urinating and offered a greeting, but the Prophet (peace be upon him) did not reply.’\n\nRelated by Muslim, hadith No. 370\n\nIt is also reprehensible to urinate over a crevice in the ground.\n\n:Qatadah reports\n\n‘Allah’s messenger reported that the Prophet (peace be upon him) made clear that no one should urinate over a crevice or a hole in the ground. People asked Qatadah what was wrong with urinating over a hole. He answered that holes were said to be the homes of the jinn.’\n\nRelated by Abu Dawud, hadith No. 29; al-Nassa’i, hadith No. 34. Ibn Hajar mentions in Al-Talkhis vol. 1, p. 106 that Ibn Khuzaymah and Ibn al-Sakan grade this hadith as authentic\n\nMoreover, it may be the home of an animal and it would be harmed by the urine. It is also reprehensible to take anything in which Allah’s name is written, except when necessary.\n\n‘When the Prophet (peace be upon him) went into the toilet, he would take off his ring.’\n\nRelated by Abu Dawud, hadith No. 19; al-Tirmidhi, hadith No. 1,746; al-Nassa’i, hadith No. 5,213; Ibn Majah, hadith No. 303\n\nHowever, this is overlooked when it is necessary to take it in, as in the case with banknotes bearing Allah’s name. If one should leave these outside, they may be stolen or he may forget to pick them up when leaving."
                    },
                    {
                        "id": 13,
                        "name": "Recommended practices of sound nature",
                        "content": "There are five practices also called ‘nature’s fine characteristics’ that each Muslim should perform to keep the best and most complete form. Practices and the reason behind them are explained in the article.\n\nThese practices are also called ‘nature’s fine characteristics’ because whoever does them maintains the natural course Allah wants for people so that they will be in the best and most complete form. \n\nAbu Hurayrah quotes the Prophet (peace be upon him) as saying\n\n‘Five practices are part of sound nature: circumcision, shaving pubic hair, plucking armpit hair, clipping nails and trimming the moustache.’\n\nRelated by al-Bukhari, hadith No. 5,889; Muslim, hadith No. 257\n\nShaving pubic hair: This is recommended for cleanliness. It may also be removed with hair removing products.\nCircumcision: This means the removal of the foreskin that covers the head of a boy’s penis. It is very useful as it keeps the penis uncontaminated by the impurity of urine. It is recommended to have it done on the seventh day after birth, because it is quicker to heal. Female circumcision is practised in some countries, but unknown in the majority of Muslim countries. No hadith of good or authentic grade recommends it.\nTrimming the moustache: The moustache should be heavily reduced, because this makes one better looking and cleaner. There are several hadiths urging the trimming of one’s moustache while growing one’s beard and taking care of it. A beard adds an element of dignity to man’s appearance and manliness. Many people today take the reverse attitude, growing their moustaches and shaving their beards. This is contrary to the Sunnah and to the clear recommendation to grow one’s beard.\nAbu Hurayrah quotes the Prophet (peace be upon him) as saying\n\n‘Cut your moustaches and grow your beards. Thus you contradict the Majians.’\n\nRelated by Muslim, hadith No. 260\n\nIbn 'Umar reports that the Prophet (peace be upon him) said\n\n‘Do the opposite of the idolaters: grow your beards and trim your moustaches.’\n\nRelated by al-Bukhari, hadith No. 5,892; Muslim, hadith  No. 259\n\nEvery Muslim should observe the Prophet’s (peace be upon him) guidance and choose a way that is contrary to the practices of the disbelievers. Moreover, Muslim men should make sure not to imitate women.\n\nNail clipping: Nails must not be left long. To clip them gives a better appearance and prevents the collection of any dirt that might accumulate under them. Some people, including Muslims, take no heed of this important Sunnah, letting their nails, or a particular nail grow long.\nPlucking armpit hair: The removal of armpit hair is recommended either by plucking or shaving. It is cleaner and reduces foul smell.\nIt is clear that Islam urges us to attend to these practices as they combine cleanliness with purification and good appearance. A Muslim who attends to them has the best appearance, and moves away from the practices of unbelievers and ignorant people. Furthermore, he earns reward as he implements the requirements of his faith and follows the Prophet’s (peace be upon him) guidance.\n\nAdded to these five practices are brushing one’s teeth, rinsing one’s nose and mouth, washing the back of finger joints and washing private parts. \n\nA’ishah states: ‘Allah’s messenger said\n\n‘Ten practices are part of sound human nature: trimming the moustache, growing one’s beard, brushing one’s teeth, rinsing one’s nose, clipping one’s nails, washing the back of finger joints, plucking armpit hair, shaving pubic hair and washing private parts.’\n\nRelated by Muslim, hadith No. 261\n\nBrushing one’s teeth: This is done by using a miswak, which is a tooth stick, or a toothbrush to clean one’s teeth and gums and remove any food trapped in between teeth. It also prevents bad mouth smell and is recommended at all times. The Prophet (peace be upon him) encouraged the brushing of teeth generally, without specifying a time for it.\n\nHe also said\n\n‘Had it not been for fear that I make things too hard for my community, I would have ordered them to brush their teeth before every prayer.’\n\nRelated by al-Bukhari, hadith No. 887; Muslim, hadith  No. 252\n\nBrushing one’s teeth is strongly recommended when one performs ablution, on waking up, when the smell of one’s mouth changes, before reciting the Qur’an or prayer and when entering the mosque or one’s home. 'A’ishah was asked what was the first thing the Prophet (peace be upon him) did when he came home. She answered: ‘He brushed his teeth.’ It is also strongly recommended if one has been silent for long, and when one’s teeth start to become yellowish.[1]\n\n‘When the Prophet (peace be upon him) woke up for night worship, he started with brushing his teeth.’\n\nRelated by al-Bukhari, hadith No. 245; Muslim, hadith No. 255\n\nEvery Muslim is urged to be in his best shape and cleanliness when about to engage in worship.\n\nBrushing one’s teeth ensures several benefits. Most importantly, it keeps the mouth clean in this life and it earns Allah’s pleasure in the life to come. \n\nThe Prophet (peace be upon him) said\n\n‘Brushing the teeth cleans the mouth and pleases the Lord.’\n\nRelated by Ahmad, hadith No. 24,203; al-Nassa’i, hadith No. 5\n\nTherefore, a Muslim should be keen to observe this practice and never to abandon it, as it is highly beneficial. Regrettably, some people may not brush their teeth for a month or two, either out of negligence, or because they are unaware of its benefits. Thus they miss out on Allah’s reward and the benefits it brings. They should remember that the Prophet (peace be upon him) always maintained this practice and ordered his community to follow his example. He would have made it obligatory, but he feared that some people might find it hard to maintain. Other benefits of teeth brushing have been mentioned, such as strengthening one’s teeth and preventing gum disease, as well as improving one’s voice and giving one a sense of refreshment."
                    }

                ]
            },

            {
                "id": 2,
                "content": [{
                        "id": 1,
                        "name": "Ablution, i.e. Wudu’",
                        "content": "Wudu means cleanliness and brightness. But in Islam it refers to washing the face, arms, head, and feet with clean water. In other words, it is called ablution. It is obligatory before prayer or similar worship acts.\n\nDefinition and status\n\nLinguistically speaking, wudu’ is derived from a root that connotes ‘good looking, cleanliness and brightness’, while in Islamic contexts it means ‘the use of water in respect of four organs, the face, arms, head and feet, in a particular way defined by Islam with the intention of worship.’[1] Performing ablution is obligatory when one wishes to pray or do a similar act of worship, such as tawaf around the Ka'bah."
                    },
                    {
                        "id": 2,
                        "name": "Basis of obligation",
                        "content": "Valid ablution is mandatory for any Muslim to pray and there is no other view on this subject. For ablution to be correct one must be sane, have the intention, follow the proper order, and wash the obligatory parts.\n\nThe basis of making the ablution obligatory when wanting to pray is the Quran,\n\n:as Allah says\n\n‘Believers, when you are about to pray, wash your faces, and your hands and arms up to the elbows, and pass your wet hands lightly over your heads, and wash your feet up to the ankles. If you are in a state of ceremonial impurity, purify yourselves. But if you are ill, or on a journey, or if one of you has come from the toilet, or if you have been in intimate contact with women and can find no water, then have recourse to pure dust, passing therewith lightly over your faces and your hands. Allah does not want to impose any hardship on you, but He wants to purify you, and to bestow on you the full measure of His blessings, so that you may be grateful.’ (5:6)\n\n:The Prophet (peace be upon him) said\n\n‘Allah does not accept a prayer without ablution or voluntary charity (i.e. sadaqah) from stolen booty.’\n\nRelated by Muslim, hadith No. 224\n\n:He also said\n\n‘Allah does not accept the prayer of one who had a discharge from the private parts until he has performed the ablution.’\n\nRelated by al-Bukhari, hadith No. 6,954; Muslim, hadith No. 223\n\nNo Muslim has ever expressed a contrary view. Thus, the ablution is required on the basis of the Qur’an, the Sunnah, and the unanimity of scholars.\n\nRequirements\nFor ablution to be valid, it must comply with the following requirements:\n\n1-Belief in Islam, sanity and sense of discrimination: It cannot be done by an unbeliever, a mad person or a child that does not discriminate between actions.\n\n2-Intention:\n\n:As the Prophet (peace be upon him) says\n\n‘Actions are but by intentions.’\n\nRelated by al-Bukhari, hadith No. 1; Muslim, hadith No. 1,907\n\nThere is no need for a verbal declaration of intention as this was not done by the Prophet (peace be upon him).\n\n3-Clean water: Ablution cannot be done using water that has been contaminated by impurity.\n\n4-Removal of anything that prevents skin contact with water, such as the presence of wax or dough on some spots, or nail varnish.\n\n5-Immediate progress from one action to the next.\n\n6-Following the proper order.\n\n7-Washing all the organs that are required to be washed.\n\nThe obligatory part\n1-Washing one’s whole face,\n\n:as Allah says\n\n‘Believers, when you are about to pray, wash your faces...’ (5:6)\n\n2-Washing one’s arms up to the elbows, as the relevant verse makes clear:\n\n‘...wash your faces and your forearms to the elbows...’ (5:6)\n\n3-Wiping one’s head with one’s wet hand. There are different views on this, though the one we uphold is to wipe one’s whole head. However, some scholars consider wiping a part of one’s head sufficient.\n\n:Allah says\n\n‘...and wipe over your heads...’ (5:6)\n\nTo wipe a part of one’s hair that is not close to one’s head is invalid.\n\n4-Washing one’s feet up to the ankles,\n\n:as Allah says\n\n‘...and wash your feet up to the ankles...’ (5:6)\n\n5-Following the proper order: This is required because Allah mentions it in order and the Prophet (peace be upon him) performed his ablutions in the same order mentioned by Allah: the face, then the arms, then the head then the feet. This is clearly indicated by the hadith reported by 'Abdullah ibn Zayd and in other hadith describing the Prophet’s (peace be upon him) ablution.\n\n6-Continuous progress: This means washing one organ immediately after the one before it, without delay. The Prophet (peace be upon him) used to perform his ablution without leaving gaps between washing the different parts. This is further confirmed by the hadith reported by Khalid ibn Ma'dan:\n\n‘The Prophet (peace be upon him) saw a man praying and noticed that there was on the top of his foot a spot the size of a coin which was dry, because water did not touch it when the man performed his ablution. The Prophet ordered him to repeat his ablution.’\n\nRelated by Ahmad, hadith No. 15,495; Abu Dawud, hadith No. 175; al-Bayhaqi in Al-Sunan al-Kubra, hadith No. 396\n\nHad it not been necessary for ablution to be consecutive without any gap, the Prophet (peace be upon him) would have told the man only to wash the unwashed part, not to repeat his ablution.\n\nThe recommended part\nCertain actions are recommended when performing the ablution. These are Sunnah, which means that a person who does them earns a reward, while the one who omits them misses out on a reward but his ablution is valid. These are:\n\n1-Saying, ‘In the name of Allah’ at the beginning,\n\n:as the Prophet (peace be upon him) said\n\n‘A person who does not say the name of Allah when doing the ablution does not have his ablution complete.’\n\nRelated by Ahmad, hadith No. 9,418; Abu Dawud, hadith No. 101; al-Hakim, vol. 1, p. 245; al-Bayhaqi in Al-Sunan al-Kubra, hadith No. 186\n\n2-Brushing one’s teeth.\n\n:The Prophet (peace be upon him) said\n\n‘Had it not been for fear that I make things too hard for my community, I would have ordered them to brush their teeth every time they performed the ablution.’\n\nRelated by Ahmad, hadith No. 9,928; al-Nassa’i in Al-Sunan al-Kubra, hadith No. 99; al-Bayhaqi in Al-Sunan al-Kubra, hadith No. 148\n\n3-Washing one’s hands three times at the start, because the Prophet (peace be upon him) did that as reported by his companions who explained how he performed his ablution.\n\n4-Rubbing one’s face to ensure that one’s wet fingers go through one’s thick beard.\n\n:The Prophet (peace be upon him) did that\n\n‘When the Prophet (peace be upon him) performed his ablution, he rubbed his arms.’\n\nRelated by Ahmad, hadith No. 16,441; Ibn Hibban, hadith No. 1,082; al-Bayhaqi in Al-Sunan al-Kubra, hadith No. 1/196; al-Hakim, vol. 1, p. 243\n\n‘The Prophet (peace be upon him) took water below his jaws to go through his beard.’\n\nRelated by Abu Dawud, hadith No. 145; al-Hakim, vol. 1, p. 250; al-Bayhaqi in Al-Sunan al-Kubra, hadith No. 1/90\n\n5-Starting with the right hand or foot, as the Prophet (peace be upon him) did that:\n\n‘The Prophet (peace be upon him) liked to start with the right when putting on his shoes, dismounting, performing ablution and all matters.’\n\nRelated by al-Bukhari, hadith No. 168; Muslim, hadith No. 268\n\n6. Washing one’s face, hands and feet three times. What is obligatory is once only, but it is recommended to do it three times, because the Prophet (peace be upon him) did that.\n\n:It is authentically reported that\n\n‘at different times he washed each part once, or twice or three times.’\n\nRelated by al-Bukhari, hadith Nos. 157, 158 and 159\n\n7-Rinsing one’s mouth.\n\n:The Prophet (peace be upon him) said\n\n‘When you perform the ablution, rinse your mouth.’\n\nRelated by Abu Dawud and al-Bayhaqi\n\n8-Cleaning one’s nose.\n\n:The Prophet (peace be upon him) said\n\n‘When you perform the ablution, take some water in your nose and blow your nose.’\n\nRelated by al-Bukhari, Muslim and Abu Dawud\n\n9-Wiping one’s ears using one’s forefinger to wipe the inside of one’s ears and one’s thumb to wipe the outside.\n\n10-Glorification after the ablution.\n\n:The Prophet (peace be upon him) said\n\n‘For any of you who performs the ablution and does it well, then says, “I bear witness that there is no deity other than Allah; He has no partners; and I bear witness that Muhammad is His servant and messenger,” will have all eight gates of heaven opened and he may enter through any one he wishes.’\n\nRelated by Muslim, hadith No. 234; al-Tirmidhi, hadith No. 55, though al-Tirmidhi adds the supplication, ‘My Lord, make me one of those who repent of their sins and one of those who always purify themselves\n\n11-Economy in using water.\n\n:Anas reports\n\n‘that the Prophet (peace be upon him) used to wash his body for purification, using the equivalent of two litres.’\n\nRelated by al-Bukhari and Muslim\n\nHe might use only one quarter of this amount for ablution."
                    }
                ]
            },
            {
                "id": 3,
                "content": [{
                        "id": 1,
                        "name": "What invalidates the ablution",
                        "content": "There are some things that make ablution invalid; such as any discharge from private parts and this applies to stool, urine, semen, blood and wind. Also, deep sleep and touching one’s private parts break ablution.\n\nAblution may be invalidated by any of five things, as follows:\n\n1-A discharge through one’s private parts. This applies for any discharge of urine, stools, semen, blood or wind, of any amount. In the Qur’anic verse that mentions the situations when ablution becomes required for prayer,\n\n:Allah says\n\n‘if one of you has come from the toilet.’\n\n(5:6)\n\nWith regard to a situation when one doubts if one has broken wind,\n\n:the Prophet (peace be upon him) says that ablution is not required\n\n‘unless one hears a sound or smells something.’\n\nRelated by al-Bukhari, hadith No. 137; Muslim, hadith No. 361\n\n2-A discharge of impurity from any part of the body. If the discharge is urine or stools, it certainly invalidates the ablution.\n\n3-Loss of the mental faculty, as in the case of sleep.\n\n:The Prophet (peace be upon him) said\n\n‘The eye is the string that ties the anal sphincter; when the eyes sleep, the string is loosened.’\n\nRelated by Ahmad, hadith No. 887; Abu Dawud, hadith No. 203; Ibn Majah, hadith No. 477\n\nOn the other hand, madness, drunkenness and loss of consciousness invalidate the ablution according to all scholars. Sleep that invalidates the ablution is deep sleep when the sleeper loses all awareness, no matter in what position one is asleep. Dosing off slightly does not invalidate the ablution.\n\nThe Prophet’s (peace be upon him) companions used to be very drowsy as they awaited\n\n‘Isha’ prayer, and then they would stand up and pray without performing a fresh ablution.’\n\nRelated by Muslim, hadith No. 376\n\nMany scholars consider that if one sleeps seated in a way that does not allow breaking wind, one’s ablution remains valid.\n\n4-Touching one’s private parts directly, without cover. :Busrah bint Safwan reported that the Prophet (peace be upon him) said\n\n‘Whoever touches his private part should not offer prayers until he has performed the ablution.’\n\nRelated by Ahmad, hadith No. 887; Abu Dawud, hadith No. 181; al-Tirmidhi, hadith No. 82; al-Nassa’i, hadith No. 82\n\n5. Eating camel’s meat.\n\n:Jabir ibn Abdullah said: the Prophet (peace be upon him) was asked\n\n“Should I do wudoo’ after eating camel meat?” He said, “Yes.” The person said: “Should I do wudoo’ after eating mutton?” He said, “If you wish.”\n\n(Narrated by Muslim, 360)"
                    },
                    {
                        "id": 2,
                        "name": "What does not invalidate ablution",
                        "content": "No prayer would be accepted if one’s ablution has been invalidated. But there are some cases and situations that are mistakenly thought to break the ablution like vomiting and other situations mentioned below.\n\nCertain situations are wrongly thought to invalidate the ablution. These are:\n\n1. Touching a person of the other sex skin to skin.\n\n2. Bleeding from any part of the body other than that which comes from the private parts, whether through injury, medical treatment or nasal bleeding, regardless of the amount.\n\n3. Vomit, regardless of its amount.\n\n4. Doubting whether one’s ablution has been invalidated. The invalidation must be ascertained.\n\n5. Loud laughter during the prayer. (this invalidates the prayer but not the wudhu).\n\n6. Washing a dead person to prepare him for burial."
                    },
                    {
                        "id": 3,
                        "name": "When ablution is required",
                        "content": "Wudu (ablution) is required in some situations; like prayer. As God would not accept a prayer without ablution. Other cases like tawaf (going around the Kabah) and holding Quran without cover also require wudu.\n\nPerforming the ablution is required for the following:\n\n1. Prayer.\n\n:Ibn 'Umar quotes the Prophet (peace be upon him) as saying\n\n‘Allah does not accept a prayer without ablution or voluntary charity (i.e. sadaqah) from stolen booty.’\n\n2. Performing the tawaf (i.e. going around the Ka'bah), whether it be an obligatory duty or a voluntary act of worship. The Prophet (peace be upon him) is authentically reported to have performed ablution before doing the tawaf.\n\n:He also said\n\n‘Tawaf around the Ka'bah is a [form of] prayer, but Allah has permitted speech during it.’ Moreover, he made clear that women may not perform the tawaf when they are in the period.’\n\n3. Holding the Qur’an without a cover.\n\n:Allah says about the Qur’an\n\n‘only the purified can touch it.’\n\n(56:79)\n\n:The Prophet (peace be upon him) said\n\n‘None other than a person who has performed purification can touch the Qur’an.’\n\nThis is the view of many scholars, but the Qur’anic verse is preceded by a verse that mentions that the Qur’an is ‘in a well-guarded record’ which can be touched only by the angels, who are described as ‘the purified’. A large number of early eminent scholars are of the view that the Qur’an is permissible to be held by a person who has not performed the ordinary ablution, i.e. wudu’, provided that he has not incurred the need for grand ablution, i.e. ghusl."
                    },
                    {
                        "id": 4,
                        "name": "When ablution is recommended",
                        "content": "In some cases ablution is not mandatory but it is recommended as the person is in his best state when he has performed the ablution. These situations include; reciting Quran, sleeping, or before each prayer.\n\n1-Before glorifying Allah or reciting the Qur’an, because a person is in his best situation when he has performed the ablution.\n\n2-Before every prayer. The Prophet (peace be upon him) always did that,\n\n:as reported by Anas\n\n‘The Prophet (peace be upon him) used to perform the ablution before every prayer.’\n\nRelated by al-Bukhari, hadith No. 214\n\nThis means that even when he had already performed an ablution that was still valid.\n\n3-A person who is in the state of ceremonial impurity (i.e. janabah) is recommended to perform the ablution if he wants to have a second intercourse, or sleep, or eat or drink.\n\n:Abu Sa'id al-Khudri reported that the Prophet (peace be upon him) said\n\n‘If any of you has had sexual intercourse with his wife and wants a second, he is recommended to perform the ablution first.’\n\nRelated by Muslim, hadith No. 308\n\n:A’ishah reported\n\n‘When Allah’s messenger wanted to go to sleep and he was in the state of ceremonial impurity, he would perform the ablution before he went to sleep just as he would do for prayer.’\n\nRelated by Muslim, hadith No. 305\n\n:In another version she said\n\n‘When Allah’s messenger wanted to eat or go to sleep.’\n\nRelated by Muslim, hadith No. 305\n\n4-Before taking a bath.\n\n:A’ishah reported\n\n‘When Allah’s messenger wanted to take a bath to remove the state of ceremonial impurity, he would start by washing his hands, and then he would pour water by his right hand over his left to wash his private part, then he would perform the ablution, as he would do for prayer.’\n\nRelated by Muslim, hadith No. 316\n\n5-Before going to bed.\n\n:Al-Bara’ ibn 'Azib reports that the Prophet (peace be upon him) said\n\n‘When you want to go to bed, perform the ablution as you would for prayer, then lie on your right side.’\n\nRelated by al-Bukhari, hadith No. 247; Muslim, hadith No. 2,710"
                    }
                ]
            },
            {
                "id": 5,
                "content": [{
                        "id": 1,
                        "name": "Ghusl, or taking a bath Recommended ghusl",
                        "content": "Ghusl in Islam is to pour pure water over one’s body in a special way with the intention of worshipping Allah. And it is obligatory in some cases like semen discharge, converting to Islam, after menstruation.\n\nDefinition:\n\nThe Arabic word ghusl means to take a bath to wash the whole of one’s body. In the Islamic context it means pouring pure water over the entire body in a particular way, with the intention of worshipping Allah by uplifting the state of major ritual impurity.[1]\n\nRuling:\n\nThe ghusl is obligatory when there is a cause requiring it.\n\n:Allah says\n\n‘If you are in a state of ceremonial impurity, purify yourselves.’\n\n(5:6)\n\nA number of hadith reported by the Prophet’s (peace be upon him) Companions explaining how the ghusl should be performed clearly indicate that it is obligatory.\n\nTaking a bath, i.e. performing the ghusl, is obligatory in the following cases:\n\n1-The ejaculation of semen as per the ayah mentioned above.\n\n:Ali said\n\n‘If you ejaculate, then perform the ghusl.’\n\nRelated by Ahmad, hadith No. 868; Abu Dawud, hadith No. 206; al-Nassa’i, hadith No. 193\n\nHowever, if the discharge is in a wet dream, it still requires a bath, even if the sleeper does not feel the orgasm. The Prophet (peace be upon him) was asked whether a woman must take a bath if she had a wet dream.\n\n:The Prophet (peace be upon him) said\n\n‘Yes, if she confirms a discharge.’\n\nRelated by Muslim, hadith No. 313\n\nThis is agreed by all scholars. It is important to note that the discharge of semen without an orgasm, as in the case of illness, does not require a ghusl, and the same is the case for one who sees a sexual dream but there is no trace of a discharge of semen. On the other hand, if on rising from sleep, one feels wetness but cannot remember a wet dream, one must perform the ghusl if one ascertains that the wetness is semen. Moreover, if one finds on one’s clothes traces of a discharge of semen but cannot ascertain its time, and he has already prayed once or more, he should perform the ghusl and repeat any prayer he offered since his last sleep.\n\n2-The insertion of the top of the penis into a woman’s vagina, even if no discharge takes place.\n\n:The Prophet (peace be upon him) said\n\n‘If a man lies between her four limbs and the two private parts are in touch, the ghusl becomes obligatory.’\n\nRelated by Muslim, hadith No. 349\n\nIn this case, taking a bath is obligatory for both man and woman.\n\n3-Embracing Islam by an unbeliever.\n\n:The Prophet (peace be upon him) ordered Qays ibn 'Asim\n\n‘to take a bath when he accepted Islam.’\n\nRelated by Abu Dawud, hadith No. 355; al-Tirmidhi, hadith No. 605; al-Nassa’i, hadith No. 188\n\nThis applies also to an apostate when he reverts to Islam.\n\n4-When a woman finishes her menstrual period or postnatal bleeding. A’ishah reports that the Prophet (peace be upon him) said to Fatimah bint Abi Hubaysh:\n\n‘When you start your period, do not pray, and when you finish it, perform the ghusl and pray.’\n\nRelated by al al-Bukhari, hadith No. 320; Muslim, hadith No. 333\n\nIt is universally agreed that postnatal bleeding is treated in the same way as menstruation.\n\n5-Death. When Zaynab, the Prophet’s (peace be upon him) eldest daughter, died,\n\n:the Prophet (peace be upon him) said to the women attending\n\n‘Wash her.’\n\nRelated by al al-Bukhari, hadith No. 1,253; Muslim, hadith No. 939\n\nHe also said in reference to a man who died when he was in the state of consecration, i.e. ihram\n\n‘Wash him with water and lotus leaves.’"
                    },
                    {
                        "id": 2,
                        "name": "Recommended ghusl",
                        "content": "Ghusl is recommended and a must in many cases as a refresher and a way to be purer. These cases include; before Friday prayer, Eid prayer, entering the state of consecration and after washing a deceased person.\n\nTaking a bath is recommended in the following situations:\n\n1-After every sexual intercourse. Abu Rafi' the Prophet’s (peace be upon him) servant, reported that one night the Prophet (peace be upon him) took a bath after being with one wife and another after being with another.\n\n:I said\n\n‘O Messenger of Allah, could you not have taken one bath? He said: This way is better, fresher and purer.’\n\nRelated by Ahmad, hadith No. 23,862; Abu Dawud, hadith No. 219; al-Nassa’i in Al-Sunan al-Kubra, hadith No. 8,986; Ibn Majah, hadith No. 590\n\n2-Before Friday prayer, which is the most important of recommended cases of ghusl.\n\n:The Prophet (peace be upon him) said\n\n‘When you go for Friday prayer, take a bath.’\n\nRelated by al-Bukhari, hadith No. 877\n\n3-On the two Eid days.\n\n4-Before entering into the state of consecration, i.e. ihram, for performing the pilgrimage or the umrah. It is confirmed that the Prophet (peace be upon him) took a bath when he was about to enter into consecration.\n\n5-After washing a deceased person.\n\n:The Prophet (peace be upon him) said\n\n‘Whoever washes a deceased person should take a bath.’"
                    },
                    {
                        "id": 3,
                        "name": "Performing ghusl – How it is done",
                        "content": "Women ghusl procedure starts by pouring water on her hair for three times making sure that the water reaches the skin of her head then she continues washing the rest of her body.\n\nThere are two forms of ghusl:\n\nA) Acceptable form: in the sense that if a person only does ghusl in this manner, his ghusl is valid and he becomes purified from major impurity. But if a person fails to perform this kind of ghusl properly, his ghusl is not need valid.\n\nB) Complete and preferred form: this is the type which it is recommended to do but is not obligatory.\n\nAs for the obligatory and acceptable form it is as follows:\n\n1. Form the intention to purify oneself from impurity: janaabah (impurity following ejaculation), menses or nifaas (postpartum bleeding).\n\n2. Wash the entire body with water once, making sure that the water reaches the roots of the hair and the places that it cannot reach easily, such as the armpits and backs of the knees, as well as rinsing the mouth and nose, according to the correct scholarly opinion.\n\nAs for the complete form, it is as follows:\n\n1. Form the intention in the heart to purify oneself from major impurity: janaabah (impurity following ejaculation), menses or nifaas (postpartum bleeding).\n\n2. Then say Bismillah and wash the hands three times, then wash any dirt from the private part.\n\n3. Then do a complete wudoo’ as for prayer.\n\n4. Then pour water over the head three times, and rub the hair so that the water reaches the roots of the hair.\n\n5. Then wash the body, making sure that the water reaches all parts, rubbing it with the hands so that the water reaches the entire body.\n\nThe evidence for this preferred form of ghusl is:\n\n:It was narrated that ‘Aa’ishah (may Allah be pleased with her) said\n\n‘When the Messenger of Allah (peace be upon him) did ghusl for janaabah, he would wash his hands and do wudoo’ as for prayer, then he would wash himself, then he would run his fingers through his hair, then when he thought that it [the water] had reached his skin, he would pour water over it [the head] three times, then he would wash the rest of his body.’"
                    }
                ]
            },
            {
                "id": 6,
                "content": [{
                        "id": 1,
                        "name": "Dry ablution",
                        "content": "Dry ablution “Tayamum” is performing ablution using dust when water is not available. In this case, pure dust is passed lightly over one’s face and hands. It is a legitimate concession granted for Muslims.\n\nThe Arabic word tayammum, which is translated as ‘dry ablution’, means wiping one’s face and arms with dust in a particular way as an act of worship when using water is not possible.\n\nRuling:\n\nDry ablution is a legitimate concession granted by Allah says in the Qur’an to His servants. It is one of the distinctive aspects of Islamic law and it is peculiar to the Muslim community.\n\n:Allah says in the Qur’an\n\n‘Believers, when you are about to pray, wash your faces, and your hands and arms up to the elbows, and pass your wet hands lightly over your heads, and wash your feet up to the ankles. If you are in a state of ceremonial impurity, purify yourselves. But if you are ill, or on a journey, or if one of you has come from the toilet, or if you have been in intimate contact with women and can find no water, then have recourse to pure dust, passing therewith lightly over your faces and your hands. God does not want to impose any hardship on you, but He wants to purify you, and to bestow on you the full measure of His blessings, so that you may be grateful.’\n\n(5:6)\n\n:The Prophet (peace be upon him) said to one of his Companions\n\n‘Pure dust is adequate, even if you continue to be without water for 10 years. When you have water, then use it to wash yourself.’\n\nRelated by Ahmad, hadith No. 21,568; Abu Dawud, hadith No. 333; al-Tirmidhi, hadith No. 124; al-Nassa’i, hadith No. 322; al-Hakim, vol. 1, p. 284; al-Bayhaqi in Al-Sunan al-Kubra, hadith No. 880\n\n:He also said\n\n‘The entire earth is made a place of worship and purification for me.’\n\nRelated by al-Bukhari, hadith No. 335; Muslim, hadith No. 521\n\nScholars are unanimous that dry ablution is perfectly legitimate when the conditions for it apply. They also agree that it replaces purification with water, making it permissible to pray, perform the tawaf, recite the Qur’an, etc."
                    },
                    {
                        "id": 2,
                        "name": "Conditions allowing dry ablution",
                        "content": "There are certain conditions in which dry ablution is allowed and valid for Muslims.  To perform dry ablution successfully one must form the intention first and make sure the rest of the conditions are available.\n\nDry ablution is valid if it fulfills the following conditions:\n\n1-Intention to uplift minor or major impurity: Intention is required in all types of worship, and dry ablution is an act of worship.\n\n2-Possession of mental faculties: Dry ablution is invalid if done by an insane person or performed for an unconscious person.\n\n3-Awareness: It is not valid if done by one who does not distinguish actions, such as a child below seven years of age.\n\n4-Inability to use water for ablution: This may be due to the unavailability of water.\n\n:Allah says\n\n‘If you can find no water, then have recourse to pure dust, passing therewith lightly over your faces and your hands.’\n\n(5:6)\n\n:The Prophet (peace be upon him) said\n\n‘Pure dust is a source of purification for a Muslim when he does not find water, even if this continues for 10 years. If water is available, he should use it for ablution.’\n\nas this is better.’ Alternatively, the inability to use water may be due to fear that it causes harm. This may apply to a person who is ill and fears that water might aggravate his complaint or delay his recovery. In the Qur’anic verse mentioning ablution, Allah mentions illness as a valid reason for dry ablution. Moreover,\n\nJabir reports: ‘We were on travel and one of us was hit by a stone which caused a cut in his head. Then he slept and had a wet dream. He asked his companions: “Do you think I can resort to dry ablution in my condition?” They said that the concession did not apply to him as water was available. He, therefore, took a bath, and he died soon after. When we returned, we mentioned this to\n\n:the Prophet (peace be upon him) he said\n\n‘not know? Asking gives information to one who does not know. It would have been sufficient for him to resort to dry ablution and put a bandage over his wound, wipe over it and wash the rest of his body.’\n\nRelated by Ahmad, hadith No. 3,056; Abu Dawud, hadith No. 336; Ibn Majah, hadith No. 572; al-Hakim, vol. 1, pp. 284–5\n\nAgain, dry ablution may be resorted to in very cold weather when the use of water may be harmful.\n\n:Amr ibn al-'As reports that once on an expedition\n\n‘I had a wet dream on a very cold night. I feared that I might die if I had a bath, and resorted to dry ablution. I then led my companions in the Fajr prayer.’\n\nRelated by Ahmad, hadith No. 17,812; Abu Dawud, hadith No. 334; al-Hakim, vol. 1, p. 285; al-Daraqutni, hadith No. 681\n\n5-Dry ablution must be with pure dust that has not been contaminated by any impurity. For example, it is invalid if the dust had been urinated upon and it was not subsequently purified. It should also be dry with fine dust attaching to one’s hand when it is struck.\n\n:Ibn 'Abbas explained the Qur’anic statement\n\n‘If you can find no water, then have recourse to pure dust, passing therewith lightly over your faces and your hands.’\n\n(5:6)\n\nstating that it means ‘soil that had not been contaminated with impurity’. If such soil is unavailable, one may do the dry ablution on whatever surface can be found, such as sand, stone, etc. \n\n:Allah says\n\n‘So fear Allah as much as you are able.’"
                    },
                    {
                        "id": 3,
                        "name": "How it is done",
                        "content": "To perform dry ablution, one needs to have the right intention, then say ‘in the name of Allah’, then strike the ground with both hands once, blow the dust off them or shake them, then wipe over one’s face and hands up to the wrists. Ammar reports a hadith in which the Prophet (peace be upon him) is quoted to have said:\n\n‘Tayammum is done with one strike for both one’s face and hands.’\n\nRelated by Ahmad, hadith No. 183,191; Abu Dawud, hadith No. 327; al-Tirmidhi, hadith No. 144; al-Nassa’i, in Al-Sunan al-Kubra, hadith No. 302\n\n:The Prophet (peace be upon him) also said to Ammar\n\n‘It was sufficient for you to do like this:” He struck on the ground with his hands, then shook them, then wiped with them the back of his hand with his left hand, then wiped his face with both hands.’\n\nRelated by al-Bukhari, hadith No. 347; Muslim, hadith No. 368"
                    },
                    {
                        "id": 4,
                        "name": "Conditions rendering dry ablution invalid",
                        "content": "There are some conditions that render dry ablution invalid such as the presence of water or anything that invalidates ablution. It also becomes invalid if the reason for it no longer exists such as illness.\n\n-Dry ablution is invalidated by anything that invalidates normal ablution.\n\n2-The availability of water, if the dry ablution has been resorted to for the unavailability of water. The Prophet (peace be upon him) told his Companion whom he had advised to resort to dry ablution:\n\n‘If you find water, then perform the ablution.’\n\n3-Dry ablution also becomes invalid if the reason for it, such as illness, no longer exists."
                    }
                ]
            },
            {
                "id": 7,
                "content": [{
                        "id": 1,
                        "name": "Impurities and how to remove them",
                        "content": "The Arabic term, najasah, i.e. impurity, applies to every foul material thing Islam requires to be avoided.[1]\n\nRemoving impurities\n\n1-Impurities that are on the ground or the floor are removed by washing them off once, ensuring that the impure matter is gone. When a Bedouin urinated in the mosque,\n\n‘the Prophet (peace be upon him) ordered that a pail of water be poured over the urine.’\n\nRelated by al-Bukhari, hadith No. 220; Muslim, hadith No. 284\n\n2-Impurities that are not on the ground, such as being on clothes or utensils or some other container.Such impurities must be washed until they are removed.\n\nIf the impurity is that of a dog which licked a utensil or ate from it, it is removed by washing it seven times, one of which should be with using soil.\n\n:The Prophet (peace be upon him) said\n\n‘If a dog licks your plate, you should wash it seven times, and mix the first with soil.’\n\nRelated by Muslim, hadith No. 279; al-Nassa’i, hadith No. 338\n\nThis ruling applies to utensils, Other materials such as clothes or furniture items would only be washed once. \n\nAs for the impurity of the pig, it is the correct view that it is like other impurities and its removal requires washing it off once only, provided that the wash leaves no trace of the impurity. It is not required to be washed seven times.[2]\n\nIf the impurity is urine, faeces, blood, or the like, it is washed, rubbed and squeezed until no trace of it is left. One wash is enough if it leaves no trace. The impurity of the urine of a male infant who has not eaten normal food may be removed by sprinkling water over it,\n\n:as the Prophet (peace be upon him) said\n\n‘The urine of a female child should be washed while that of a male child should be sprinkled with water.’\n\nRelated by Ahmad, hadith No. 757; Ibn Majah, hadith No. 525; al-Hakim, vol. 1, p. 270\n\nThe hide of carrion becomes free of impurity when tanned,\n\n:as the Prophet (peace be upon him) said\n\n‘Any hide that is tanned is free of impurity.’ If menses stains a woman’s garment, it is washed with water; a woman came to the Prophet (peace be upon him) and said: Menstrual blood may get onto the clothes of any one of us; what should she do with it? He said: “She should scratch it, then rub it with water, then wash it, then pray in it.’\n\nThis has been related by al-Bukhari (227) and Muslim 291\n\nIt is important to take the necessary care to remove any impurity, whether it falls on one’s body, clothes or the place where one prays, because to be free of impurity is essential for the validity and acceptance of prayer."
                    },
                    {
                        "id": 2,
                        "name": "Menses: definition and rulings",
                        "content": "Menses or Hayd is the natural blood discharge from women uterus through her vagina. It could start at the age of 9 and stops by the age of 50. It usually lasts for 6 to 7 days and it requires a bath at the end “ghusl”.\n\nThe Arabic term, al-Hayd, which means ‘menstruation’, refers in Islamic context to the natural discharge of blood by a healthy woman on certain times from the lining of the uterus through the vagina, without the woman having had a childbirth.[1]\n\nBeginning and end\n\nIt has been confirmed that no period of menstruation occurs in girls younger than nine years of age. :A’ishah is quoted as saying\n\n‘When a girl completes nine years, then she is a woman.’\n\nMentioned by al-Tirmidhi, hadith No. 1,109; al-Bayhaqi in Al-Sunan al-Kubra, but without a chain of transmission\n\nLikewise, by the age of 50 most women will have stopped menstruating. 'A’ishah is reported to have said: ‘When a woman is 50 years of age, she stops menstruation.’[2]\n\nDuration\n\nIn most cases, menstruation lasts for six or seven days. The Prophet (peace be upon him) said to Hamnah bint Jahsh, who had blood discharge that continued for a very long time.\n\n‘Your period of menstruation is six or seven days, as Allah knows best, then take a bath and pray for 24 or 23 days, as other women menstruate and have their time of purification in their regular periods.’\n\nRelated by Ahmad, hadith No. 27,144; Abu Dawud, hadith No. 287; al-Tirmidhi, hadith .No. 128; Ibn Majah, hadith No. 726\n\nSome scholars are of the view that there is no minimum or maximum length of a woman’s period, and that it is determined by the custom of women in the family or community.\n\nWhat it entails\n\n1-It requires a bath at the end:\n\n:The Prophet (peace be upon him) said to a woman\n\n‘Do not pray for the same number of days when you had your normal period, then take a bath and offer your prayers.’\n\nRelated by al-Bukhari, hadith No. 325\n\n2-Puberty:\n\n:The Prophet (peace be upon him) said\n\n‘Allah does not accept the prayer of a girl who experiences the period without covering her head.’\n\nRelated by Ahmad, hadith No. 25,167; Abu Dawud, hadith No. 641; al-Tirmidhi, hadith .No. 377; Ibn Majah, hadith No. 655\n\nThis signifies that once a girl begins to have the period, she must cover her head, which means that Islamic duties apply to her and this takes place only when a person attains puberty.\n\n3-It is a significant mark: A divorced woman’s waiting period is considered to have been completed when she has had three menstruations.\n\n:Allah says\n\n‘Divorced women shall wait, by themselves, for three monthly courses.’\n\n(2:228)\n\n4-A woman’s period is a sure mark that she is not pregnant.\n\nImportant note: When a woman finishes her period before sunset, she must offer her Thuhur and 'Asr prayers for that day; and if she finishes her period before dawn, she must offer her Maghrib and 'Isha’ prayers for that night. The time of each two prayers is considered one when there is a valid reason to delay the first prayer. This is the view of the majority of scholars, and it is upheld by Malik, al-Shafi'i and Ahmad."
                    },
                    {
                        "id": 3,
                        "name": "Things forbidden during menstruation",
                        "content": "Women in menstruation are forbidden from having penetrative sexual intercourse, prayers, fasting, holding Qur'an, performing Tawaf, reciting Qur'an, staying in a mosque, and getting divorced.\nThings forbidden during menstruation\nCertain things become forbidden when a woman is in menstruation:\n\n1-Penetrative sexual intercourse:\n\n:Allah says\n\n‘They ask you about menstruation. Say: “It is an unclean condition; so keep aloof from women during menstruation, and do not draw near to them until they are cleansed.’\n\n(2:222)\n\nWhen this verse was revealed, the Prophet (peace be upon him) advised that foreplay is permissible.\n\n:He said\n\n‘You may do everything except intercourse.’\n\nRelated by Muslim, hadith No. 302\n\n2-Divorce: A man may not divorce his wife when she is in the period.\n\n:Allah says\n\n‘O Prophet (peace be upon him), when you [Muslims] divorce women, divorce them for [the commencement of] their waiting period, and keep count of period.’\n\n(65:1)\n\nWhen 'Umar reported to the Prophet (peace be upon him) that his son 'Abdullah divorced his wife and she was in the period,\n\n:the Prophet(peace be upon him) told him that\n\n‘Abdullah must re-instate the marriage.’\n\nRelated by al-Bukhari, hadith No. 521; Muslim, hadith No. 1,471\n\n3-Prayer: A woman does not offer prayers during her period.\n\n:The Prophet (peace be upon him) said to Fatimah bint Abi Hubaysh\n\n‘When you start your period, do not pray.’\n\nRelated by al-Bukhari, hadith No. 331; Muslim, hadith No. 333\n\n4-Fasting: A woman does not fast during her period.\n\n:In a conversation with women the Prophet (peace be upon him) asked\n\n‘Is it not the case that when a woman is in her period she neither prays nor fasts?’ They answered: Yes.’\n\nRelated by al-Bukhari, hadith No. 304\n\n5-Performing the tawaf at the Ka'bah: When 'A’ishah started her period shortly before reaching Makkah for her pilgrimage,\n\n:the Prophet (peace be upon him) said to her\n\n‘You may do all the rituals required of pilgrims, except for tawaf, which you may not do until you have cleansed yourself.’\n\nRelated by al-Bukhari, hadith No. 305; Muslim, hadith Nos. 1,211 and 119\n\n6-Reciting the Qur’an: This is the view of most scholars among the Prophet’s  (peace be upon him) Companions and the following generations. However, if a woman needs to recite the Qur’an, as in the case of fearing to forget what she had memorized, or if she is a teacher and needs to teach the Qur’an to her class, or to read her regular portion, she may do so. But if she has no such need, then it is better not to recite the Qur’an, as some scholars maintain.\n\n7-Holding the Qur’an:\n\n:As Allah says in reference to the Qur’an\n\n‘only the purified can touch.’\n\n(56:79)\n\n8-Staying in a mosque:\n\n:The Prophet (peace be upon him) said\n\n‘I do not permit staying in the mosque for a man in the state of ceremonial impurity, (i.e. janabah), or a woman in her period.’\n\nRelated by Abu Dawud, hadith No. 232; al-Bayhaqi in Al-Sunan al-Kubra, hadith No. 4,323\n\n ‘When the Prophet (peace be upon him) stayed in the mosque during Ramadan, he used to let his wife A’ishah comb his head, but she remained in her home as she was in the period.’\n\nRelated by al-Bukhari, hadith No. 296\n\nIt is also not permissible for a woman in the period to pass through the mosque if she fears to stain it.  "
                    },
                    {
                        "id": 4,
                        "name": "Postnatal bleeding",
                        "content": "Postnatal bleeding: This refers to the blood discharged by women after childbirth.\nDuration\n\nThere is no minimum period for postnatal bleeding, and therefore it depends on whether the discharge stops or continues. Its maximum duration is usually 40 days, however with some women it takes longer to finish. Al-Tirmidhi said that all scholars among the Prophet’s (peace be upon him) Companions and their successors agreed that a woman does not pray for 40 days after childbirth, unless she becomes clean before that, and in this case she takes a bath and offer her prayers normally.\n\n:Umm Salamah reports\n\n‘During the Prophet’s (peace be upon him) lifetime, a woman who has given birth used to stay 40 days.’\n\nRelated by Ahmad, hadith No. 26,584; Abu Dawud, hadith No. 312; al-Tirmidhi, hadith No. 139; Ibn Majah, hadith No. 648\n\nRulings:\n\nThe same rules regarding menstruation apply to postnatal discharge."
                    }
                ]
            }
        ]

    }, {
        "level": 4,
        "content": [{
                "id": 1,
                "content": [{
                        "id": 1,
                        "name": "Prayer",
                        "content": "Muslims are asked to meet Allah five times a day through performing Salah or the Islamic Prayers. These five meetings are the main factors for the love of Allah to be granted a happy life and Jannah.\n\nThe Arabic term salah, which is normally translated as ‘prayer’, originally means ‘supplication’. In Islamic context it is defined as ‘an act of worship that includes saying specific words as well as doing specific actions, starting with the glorification, Allah-u akbar, and concluded with salam.[1]\n\nIt is prayer that builds a Muslim’s character: it keeps his heart pure and consolidates his faith. It helps a person to organize his affairs, giving him stronger motivation to maintain good conduct, be charitable and participate in good causes. As such, prayer has a clear positive role in organizing society.\n\nPrayer points out the way of divine guidance and adds real meaning to life. It ensures that man does not feel loss, as it guides him along the way followed by all Prophets (peace be upon them all).\n\nPrayer is a demonstration of man’s gratitude for the numerous great blessings Allah has bestowed on him. It is also an unmistakeable manifestation of man’s servitude to Allah. In prayer a person speaks directly to Allah, shows humility before Him, and addresses Him with reciting the Qur’an, glorification and supplication. Moreover, in prayer man feels his bond with Allah, which elevates him over the material world in order to give him clearer vision and reassurance. When the concerns and temptations of life become too strong, prayer helps man to regain his proper perspective, enabling him to see the truth and giving him a sense of what is greater and beyond. He will realize that life could not have been so perfect, and that things could not have been made subservient to man, in order to leave him living on the margin, caring nothing except for immediate enjoyments.[2]\n\nPrayer provides light in this life and in the life to come. It is a cause for bestowing Allah’s mercy on man and increasing his provisions. It also ensures forgiveness of sins, increase of good deeds and elevating man’s position with Allah.\n\nPrayer provides spiritual nourishment. When we wish to rise to a higher level, we should fulfil all our duties, particularly prayer. When a person performs the ablution and stands up in full humility to pray, addressing Allah, supplicating in hope and looking forward for Allah’s grace, he will enjoy inner comfort and reassurance because he has assigned all his cares and concerns to the One who is ever merciful, the One to whom all dominion belongs and who is able to accomplish everything."
                    },
                    {
                        "id": 2,
                        "name": "The call to prayer",
                        "content": "Being a caller to prayer is an honor that shouldn't be granted to anyone. The one who recites Adhan and iqamah to remind all Muslims of their prayers must be honest, sane adult, trustworthy, and have a loud voice.\n\nThe Arabic term adhan, originally means ‘making an announcement’, and it is used in this sense in verse 9: 3 of the Qur’an. In an Islamic context it means ‘an announcement in specific wording at designated times informing people that prayer is due,’ while iqamah informs people in specific wording given by the Legislator that they should rise to pray.[1]\n\nStatus:\n\nBoth the adhan and the iqamah are collective duties, which means that when they are performed by some people, the rest are not accountable. Both are clearly apparent Islamic rituals and, therefore, it is not permissible to neglect them.[2]\n\nConditions\n\n1-They must be done by a sane Muslim man. If they are done by an unbeliever, a mad or drunken person, or one who is too young then they are invalid. These are common requirements for all types of Islamic worship.\n\n2-The adhan must be done at the time when the prayer falls due. If it is done earlier, it is invalid. The iqamah should be done just before starting the prayer.\n\n3-Both should be done in the right order, without gaps.\n\n4-Both should be done in Arabic and in the specific wording explained in the Sunnah.\n\nWomen are not required to do either of these duties, but a number of eminent scholars, such as al-Shafi'i and Ahmad ibn Hanbal say that it is perfectly acceptable if they do or not.\n\n:A’ishah reports\n\n‘that she used to ‘call the adhan and the iqamah and then lead the women in prayer, standing in the middle of the first row.’\n\nRelated by al-Bayhaqi. Sabiq, Fiqh al-Sunnah, vol. 1, p. 120\n\nQualities the caller to prayer should possess\n\n1-He should be an honest, trustworthy person, because he is referred to in the matter of prayer and fasting.\n\n2-He should be a sane adult. However, if a boy who is aware of his actions calls the adhan, his action is valid.\n\n3-He should know the times for prayer, so as to make sure to call the adhan on time. If he is not fully aware of the relevant times, he may be in error.\n\n4-He should have a loud voice.\n\n5-He should purify himself after any discharge that invalidates ablution.\n\n6-He should say the adhan facing the qiblah.\n\n7-He should place his forefingers in his two ears and turn his face to the right when saying hayy 'ala al-salah and to the left when saying hayy 'ala al-falah. However, if he is giving the Athan via loudspeakers as in the case of modern mosques, turning left and right wold weaken the sound and hence one shouldn’t do it.\n\n8-He should elongate the adhan and be quick with the iqamah.\n\nWhat is to be said:\n\n:It was narrated that ‘Abdallah ibn Zayd said\n\n‘When the Messenger of Allah (peace be upon him) ordered that a bell should be made so that it could be struck to call the people to prayer, a man walked around me whilst I was sleeping [i.e., in a dream], carrying a bell in his hand. I said, “O slave of Allah, will you sell this bell?” He asked, “What will you do with it?” I said, “We will call the people to prayer.” He said, “Shall I not tell you of something better than that?” I said, “Yes.” He said, “Say: Allah-u akbar (four times); Ashhadu an la ilaha illa Allah (two times); Ashhadu anna Muhammadan Rasul Allah (two times); hayy [ala al-salah (two times); hayy [ala al-falah (two times); Allah-u akbar Allah-u akbar; La ilaha illa Allah. Then he went a short distance away from me and said: “And when the prayer is about to begin (iqamah), say: Allah-u akbar Allah-u akbar; Ashhadu an la ilaha illa Allah; Ashhadu anna Muhammadan Rasul Allah; hayy [ala al-salah; hayy [ala al-falah; Qad qamat al-salah qad qamat al-salah; Allah-u akbar; La ilaha illa Allah. The following morning, I went to the Messenger of Allah (peace be upon him) and told him what I had seen. He said, “This is a true dream, in sha Allah. Get up with Bilal and teach him what you saw, for he has a more melodious voice than you.” So I got up with Bilal and taught him, and he gave the call to prayer. ‘Umar ibn al-Khattaab heard that in his house and he came out, dragging his lower garment and saying, “By the One Who sent you with the truth, O Messenger of Allah, I saw the same as he saw!” The Messenger of Allah (peace be upon him) said, “To Allah be praise.’\n\nRelated by al-Albaani in Saheeh Abi Dawood, hadith No. 469\n\nThe wording means: ‘Allah is supreme; I bear witness that there is no deity other than Allah; I bear witness that Muhammad is Allah’s messenger; come to prayer; come to success; Allah is supreme; there is no deity other than Allah.’\n\n:Anas reports that\n\n‘Bilal was instructed to repeat the wording twice in adhan and once in iqamah, with the exception of the phrase denoting readiness to start the prayer.’\n\nRelated by al-Bukhari, hadith No. 605; Muslim, hadith No. 378\n\nThese are the preferred forms of adhan and iqamah, but if in adhan one repeats the phrases testifying Allah’s oneness and the Prophet’s (peace be upon him) message, or repeats the phrases of iqamah twice, there is no harm because this is  an acceptable difference between scholars. In the adhan for Fajr (i.e. dawn) prayer, it is mandatory to add the phrase assalatu khayrun min al-nawm, which means ‘prayer is preferable to sleep’,\n\n:as Abu Mahdhurah mentions that\n\n‘the Prophet (peace be upon him) instructed him to do so.’"
                    },
                    {
                        "id": 3,
                        "name": "What to say when hearing the adhan and after it",
                        "content": "One of Muslims' favorite sounds should be the sound of Adhan. It is the reminder for one to perform prayers and once one hears it, he should repeat after it except for one phrase. Learn what you should say exactly.\n\nIt is recommended when hearing the adhan to repeat what it says,\n\n:as Abu Sa'id al-Khudri reports that the Prophet (peace be upon him) said\n\n‘When you hear the call to prayer, repeat what the caller says.’\n\nRelated by al-Bukhari, hadith No. 621; Muslim, hadith No. 1,093\n\nOne exception, however, is that when the caller says ‘hayy 'ala al-salah; hayy 'ala al-falah;’ we should say:\n\n‘la hawla wala quwwata illa billah, which means ‘no power works except by Allah’s permission.’\n\nRelated by Muslim, hadith No. 385\n\nIn Fajr prayer, when the caller says ‘prayer is better than sleep’, anyone who hears him is recommended to say the same. This is not recommended for iqamah. After the athan, it is recommended to say:\n\n‘Peace be to the Prophet (peace be upon him) and his household. My Lord, the Lord of this perfect call and the due prayer, grant Muhammad the means and give him the honourable station You promised him.’\n\nRelated by al-Bukhari, hadith No. 614. The hadith includes that ‘whoever says this will benefit from the Prophet’s intercession on their behalf on the Day of Judgement"
                    },
                    {
                        "id": 3,
                        "name": "What to say when hearing the adhan and after it",
                        "content": "One of Muslims' favorite sounds should be the sound of Adhan. It is the reminder for one to perform prayers and once one hears it, he should repeat after it except for one phrase. Learn what you should say exactly.\n\nIt is recommended when hearing the adhan to repeat what it says,\n\n:as Abu Sa'id al-Khudri reports that the Prophet (peace be upon him) said\n\n‘When you hear the call to prayer, repeat what the caller says.’\n\nRelated by al-Bukhari, hadith No. 621; Muslim, hadith No. 1,093\n\nOne exception, however, is that when the caller says ‘hayy 'ala al-salah; hayy 'ala al-falah;’ we should say:\n\n‘la hawla wala quwwata illa billah, which means ‘no power works except by Allah’s permission.’\n\nRelated by Muslim, hadith No. 385\n\nIn Fajr prayer, when the caller says ‘prayer is better than sleep’, anyone who hears him is recommended to say the same. This is not recommended for iqamah. After the athan, it is recommended to say:\n\n‘Peace be to the Prophet (peace be upon him) and his household. My Lord, the Lord of this perfect call and the due prayer, grant Muhammad the means and give him the honourable station You promised him.’\n\nRelated by al-Bukhari, hadith No. 614. The hadith includes that ‘whoever says this will benefit from the Prophet’s intercession on their behalf on the Day of Judgement"
                    }
                ]
            },
            {
                "id": 2,
                "content": [{
                        "id": 1,
                        "name": "Conditions for the validity of prayer",
                        "content": "Linguistically speaking, the word shart, which is translated as ‘condition’, means ‘mark’, but in Islamic contexts it means ‘what is necessary for something to exist but does not form part of it.’[1] The following nine conditions must be met for the prayer to be valid:\n\n1-Islam: Prayer is not valid if performed by an unbeliever.\n\n2-Sanity: Prayer is not valid if performed by an insane person, because it is not required of the insane.\n\n3-Puberty: Praying is not required of a child until he or she attains puberty. However, a child should be instructed to perform the prayer when it is seven years of age. The order may be coupled with gentle beating if the child does not pray after reaching 10 years of age.\n\nThe Prophet (peace be upon him) said,\n‘Order your children to pray when they are seven, and beat them gently for not praying after they are ten.’\n\n4- Purification: This includes both types of purity; purity from najasah (impurities) on one’s body, clothes and the prayer area and it also includes uplifting the ritual state of impurity through wudhu or dry ablution.\n\n5-Appropriate time: Each prayer has its appointed time range and for a prayer to be valid, it has to be offered within that time range.\n\nAllah says,\n‘Indeed, prayer has been decreed upon the believers a decree of specified times.’\n(4:103)\n\nA hadith mentions that the angel Gabriel led the Prophet (peace be upon him) in offering all five prayers on two consecutive days, choosing the beginning of the time of every prayer on the first day, and the end of its time range on the second day.\nHe then told the Prophet (peace be upon him),\n‘Prayer is valid between these two times.’\nRelated by Ahmad, hadith No. 3,081; Abu Dawud, hadith No. 393; al-Tirmidhi, hadith No. 149; al-Nassa’i, hadith No. 526\n\nThis means that prayer is invalid before its time is due or after it had lapsed, except for a valid reason.\n\n6- Covering the Awrah, The Awrah of a man in prayer is the area from his navel to his knees. The woman’s awrah in prayer is her full body except her face and hands. The cover must not be transparent.\n\nAllah says,\n‘Children of Adam, dress well when you attend any place of worship.’\n(7:31)\n\nThe Prophet (peace be upon him) said,\n‘Allah does not accept the prayer of any woman who has attained puberty unless she has a head cover.’\n\n7-Facing the qiblah (i.e. the direction towards the Ka[bah) when one is able to do so.\n\nAllah says,\n‘Turn your face, then, towards the Sacred Mosque.’\n(2:144)\n\nThe Prophet (peace be upon him) said,\n‘When you want to pray, do the ablution well, then face the qiblah.’\nRelated by al-Bukhari, hadith No. 6,251; Muslim, hadith No. 397\n\n8-Intention: This is a condition that cannot be omitted in any situation. A hadith reported by Umar quotes the Prophet (peace be upon him) as saying:\n‘Actions are but by intention.’ The intention is a mental process and need not be vocalized."
                    },
                    {
                        "id": 2,
                        "name": "The essentials in prayer",
                        "content": "Prayer has 14 essentials,[1] i.e. rukn, and these cannot be omitted intentionally, unintentionally or out of ignorance. They are:\n\n1-Standing up: This applies in obligatory prayers for everyone who is able to stand up.\n\nAllah says,\n‘Stand up before Allah in devout obedience.’\n(2:238)\n\nThe Prophet (peace be upon him) said to 'Imran ibn Husayn,\n‘Pray standing up; but if you are unable to do so, then sitting down; and if you are unable to do that, then pray reclining.’\nRelated by al-Bukhari, hadith No. 1,117\n\n2-Allah’s glorification at the beginning of prayer: This is to say Allah-u akbar, which means ‘Allah is supreme’. Nothing other than this glorification is acceptable. When the Prophet (peace be upon him) saw a man praying wrongly,\nhe told him,\n‘When you stand up to pray, say Allah-u akbar.’\nRelated by al-Bukhari, hadith No. 793; Muslim, hadith No. 397:\nHe also said,\n‘The consecration of prayer is to say Allah-u akbar and it ends with salam.’\nRelated by Ahmad, hadith No. 1,006; Abu Dawud, hadith No. 61; al-Tirmidhi, hadith No. 3; Ibn Majah, hadith No. 275\n\nThis means that prayer is not entered into without this particular glorification (takbeer).\n\n3-Reading the first surah, Al-Fatihah, in every rak'ah,\nas the Prophet (peace be upon him) says,\n‘A person who does not read al-Fatihah has not prayed.’\nRelated by al-Bukhari, hadith No. 756; Muslim, hadith No. 394\n\n4-Bowing, i.e. ruku', in every rak'ah:\n\nAllah says,\n‘Believers! Bow down and prostrate yourselves.’\n(22:77)\n\nThe Prophet (peace be upon him) said to the person who did not pray well,\n‘Then bow down until you have bowed well.’\nRelated by al-Bukhari, hadith No. 757; Muslim, hadith No. 397.\n\n5-Standing up after bowing and making sure to stand erect:\n\nThe Prophet (peace be upon him) told the person who did not pray well,\n‘Then rise until you stand erect.’\nRelated by al-Bukhari, hadith No. 793; Muslim, hadith No. 397\n\n6-Prostration:\n\nAllah says,\n‘Believers! Bow down and prostrate yourselves.’\n(22:77)\n\nThe Prophet (peace be upon him) said to the person who did not pray well,\n‘Then prostrate yourself until you have prostrated well.’ Two prostrations are essential in every rak'ah, and the prostration must be by placing seven parts of the body on the ground, as the Prophet (peace be upon him) said: ‘I have been commanded to prostrate myself on seven bones: my forehead (including the nose as he pointed to his nose as well), two hands, two knees and my feet.’\nRelated by al-Bukhari, hadith No. 812; Muslim, hadith No. 490\n\n7-Lifting one’s head after prostration, sitting between the two prostrations and standing up after the second. The Prophet (peace be upon him) taught the one who prayed wrong: ‘You then sit comfortably.\n\n8-Taking a comfortable position in all rukns, which signifies being still. This is equivalent to the time it takes to say what is required in every rukn. We note that the Prophet (peace be upon him) ordered the one who did not pray well to ensure this in every rukn and to repeat his prayer because it was lacking in his first prayer.\n\n9-tashahhud. Ibn Masud said: ‘Before the tashahhud was made obligatory to us we used to say “Salam to Allah from His servants, (i.e Assalamu 'ala Allah min 'ibadih), but the Prophet (peace be upon him) said:\n‘Do not say ‘Salam to Allah’, but say ‘Greetings to Allah (i.e. at-tahiyyatu lillah.’\nRelated by Ahmad, hadith No. 3,920; Abu Dawud, hadith No. 968; al-Nassa’i in Al-Sunan al-Kubra, hadith No. 899; al-Daraqutni, hadith No. 1,327\n\nThe fact that Ibn Mas'ud said ‘Before it was made obligatory’ makes clear that it is obligatory.\n\n10-Sitting down for the last tashahhud because this was consistently done by the Prophet (peace be upon him), and he said:\n‘Pray as you have seen me pray.’\nRelated by al-Bukhari, hadith No. 631\n\n11-Salam at the end,\nas the Prophet (peace be upon him) says,\n‘that the prayer ‘ends with salam.’\n\nThis means that when a worshipper finishes his prayer, he turns his face to the right and says:\n‘Assalamu 'alaikum wa rahmatullah, and turns to the left and says the same.’\n\n12-Doing all the rukns in the right order, because the Prophet did them in this order and\n\nsaid\n‘Pray as you have seen me pray.’\n\nFurthermore, when he taught the person who did not pray well, he explained every rukn and said ‘then’ before mentioning the next one. This indicates that the rukns should be done in order."
                    }
                ]
            },
            {
                "id": 3,
                "content": [{
                    "id": 1,
                    "name": "Duties in prayer",
                    "connect": "There are eight duties a Muslim must obey to in prayers, like the glorification. And if they are deliberately omitted, the prayer is invalid. If it is forgotten, it is compensated for by two prostrations at the end.\n\nNine duties (obligatory acts) must be observed in prayer, and if they are deliberately omitted, the prayer is invalid. If any is forgotten, it is compensated for by two prostrations at the end of prayer. If they are omitted out of ignorance, the prayer is valid. These eight duties are as follows:\n\n1-All the glorifications (takbeer), i.e. Allah-u akbar, other than the initial one that is for consecration. These are called the glorification of moving on.\n\nIbn Mas'ud said,\n‘I saw the Prophet (peace be upon him) saying Allah-u akbar every time he moved up or down, every rising and every sitting.’\nRelated by Ahmad, hadith No. 3,736; al-Tirmidhi, hadith No. 253; al-Nassa’i, hadith No. 1,149.\nThe Prophet (peace be upon him) continued to do so throughout his life and he ordered us to pray in the same way he prayed.\n\n2- The imam leading the prayer and a person praying alone says sami'a Allah liman hamidah (i.e. ‘may Allah answer the prayer of the one who praises Him’) when standing up after bowing.\n\nAbu Hurayrah said,\n‘The Prophet (peace be upon him) used to say Allah-u akbar when he started the prayer and when he bowed, then he said sami'a Allah liman hamidah when he rose after bowing. Then when he was in the upright position he said: Rabbana wa lak alhamd i.e. “You are our Lord and all praise is due to You.’\nRelated by Muslim, hadith No. 392.\n\n3-Every worshipper in the congregation says only Rabbana wa lak alhamd, while the imam leading the prayer and a person praying alone says it after saying sami'a Allah liman hamidah. This is clear in the above-quoted hadith reported by Abu Hurayrah, and in the other hadith reported by Abu Musa in which he quotes the Prophet (peace be upon him) saying:\n‘that when the imam says sami'a Allah liman hamidah, the ones in the congregation should say Rabbana wa lak alhamd.’\nRelated by al-Bukhari, hadith No. 689; Muslim, hadith No. 411\n\n4-When bowing, one should say subhana Rabbiy A’theem, which means ‘I praise my Lord the great and exonerate Him from any fault or defect’. The duty is to say it at least once.\n\n5-In prostration one should say subhana Rabbiy al-a'la, which means “I praise my Lord the most high and exonerate Him from any fault or defect”.\n\nHudhayfah reported that the Prophet (peace be upon him)\n‘used to say subhana Rabbiy al A’theem when he bowed and subhana Rabbiy al-a'la in his prostration.’\nRelated by Ahmad, hadith No. 23,240; Abu Dawud, hadith No. 871; al-Tirmidhi, hadith No. 262; al-Nassa’i, hadith No. 1,046; Ibn Majah, hadith No. 888.\nIt is recommended to say these glorifications at least three times in each bowing and prostration.\n\n6-When sitting between the two prostrations one should say Rabb ighfir li, i.e. ‘My Lord, forgive me.\n\nHudhayfah reported that ‘the Prophet (peace be upon him) used to say\n‘Rabb ighfir li, Rabb ighfir li, in between the two prostrations.’\nRelated by Ahmad, hadith No. 2,375; Abu Dawud, hadith No. 874; al-Nassa’i, hadith No. 1,145; Ibn Majah, hadith No. 897\n\n7-The first tashahhud, except for people in the congregation when the imam forgets this tashahhud and rises for the next rak'ah. Those in the congregation are exempt from it because they have an overriding obligation to follow the imam. When the Prophet (peace be upon him) forgot this tashahhud he did not go back to perform it.\n‘He only prostrated himself at the end in compensation for forgetting it.’\nRelated by al-Bukhari, hadith No. 1,230; Muslim, hadith No. 570.\nThis tashahhud requires saying: Al-tahiyyatu lillah, was-salawatu wat-tiyyibat. Assalamu 'alayka ayyuha-nnabiyyu wa rahmatullahi wa barakatuh. Assalamu ' alayna wa 'ala 'ibadi-llahis-salihin. Ashhadu an la ilah illa Allah, wa ashhadu anna Muhammad-an 'abduhu wa rasuluh. This means: ‘Greetings are offered to Allah, and blessings and all good things belong to Him. Peace be to you, Prophet (peace be upon him), with Allah’s grace and blessings. Peace be to us and to all good servants of Allah. I bear witness that there is no deity other than God, and I bear witness that Muhammad is His servant and messenger.\n\n8-To sit down for this first tashahhud, as stated in the hadith reported by Ibn Mas'ud, quoting the Prophet (peace be upon him) :\n‘When you are seated after each two rak'ahs say the tashahhud.’\nRelated by Ahmad, hadith No. 4,160; al-Nassa’i, hadith No. 1,163\nAnother hadith reported by Rifa'ah ibn Rafi'  quotes the Prophet as saying:\n‘When you sit down in the middle of the prayer, sit comfortably, putting your left thigh underneath you and then say the tashahhud.’\nRelated by Abu Dawud, hadith No. 860; al-Tabarani in Al-Mu' jam al-Kabir, hadith No. 4,528\n\n9. The salutation upon the Prophet (peace be upon him) (salla Allahu alaihi wa sallam) in the last rak’ah known as Assalatul Ibrahimiyah."
                }]
            },
            {
                "id": 4,
                "content": [{
                    "id": 1,
                    "name": "What is recommended (Sunnah) in prayer",
                    "content": "There are some recommendations that Muslims should keep in mind when they pray. These recommendations are actions and words that the prophet (PBUH) has performed and his companions followed his footsteps.\n\nThese are of two types: actions and words\"\n\nThe Sunnah words of the prayer are as follows:\n1- Saying after the opening takbeer, “Subhaanaka Allaahumma wa bi hamdika, wa tabaaraka ismuka, wa ta’aala jadduka wa laa ilaaha ghayruka (Glory and praise be to You, O Allah; blessed be Your name, exalted be Your Majesty, and there is no god but You).” This is called du’aa’ al-istiftaah (opening du’aa’).\n\n2- Seeking refuge with Allah.\n\n3- Saying Bismillaah.\n\n4- Saying Ameen.\n\n5- Reciting a surah after al-Faatihah.\n\n6- Reciting out loud, in the case of the imam or individual in the first two rak'ah of Fajr, Maghreb and Isha.\n\n7- Saying after the tahmeed (Rabbana wa laka’l-hamd): “Mil’ al-samawaati wa mil’ al-ard wa mil’ ma shi’ta min shay’in ba’d (Filling the heavens, filling the earth, and filling whatever else You wish).”\n\n8- Saying the tasbeeh (when bowing or in prostration) more than once, such as a second or third time or more.\n\n9- Saying “Rabb ighfir li (Lord forgive me)” more than once between the two prostrations.\n\n10- Saying the recommended du’aa’ after offering the salutation upon the Prophet (peace be upon him) and his family known as Assalatul Ibrahimiyah.\n\nSunnah actions which are postures:\n1- Raising the hands when saying the opening takbeer.\n\n2- Raising the hands when bowing.\n\n3- Raising the hands when rising from bowing.\n\n4- Raising the hands after the first tashahud while standing up for the 3rd rak'ah.\n\n5- Placing the right hand over the left on the chest while in the standing position.\n\n6- Looking towards the place of prostration.\n\n7- Standing with the feet apart.\n\n8- Holding the knees with fingers spread apart when bowing, holding the back straight and making the head parallel with it.\n\n9- Placing the parts of the body on which one prostrates firmly on the ground. Keeping the elbows away from the sides, and the belly from the thighs, and the thighs from the calves; keeping the knees apart; holding the feet upright; placing the hands level with the shoulders with the fingers spread.\n\n10- Sitting between the two prostrations and in the first tashahhud in a way that is known as Iftirash. This is sitting on the left foot while raising the right foot. In the last rak'ah of a 3 or 4 rak'ah prayers, the Sunnah is to sit in what is known as Tawarruk. This is to sit on the left hip while placing the left foot underneath the right leg.\n\n11- Placing the hands on the thighs with the fingers together between the two prostrations, and in the tashahhud, except that in the latter the pinkie and ring fingers should be held in, a circle made with the middle finger and thumb, and one should point with the forefinger while shaking it in its place when in the tashahud position.\n\n12- Turning to the right and left when saying the salaam to conclude the prayers."
                }]
            },
            {
                "id": 5,
                "content": [{
                    "id": 1,
                    "name": "What invalidates the prayer",
                    "content": "Prayers are all Muslims' duty. But prayer is invalid in some cases like; invalid purification, loud laughter, or deliberately changing or adding a rukn. Learn what to avoid in order not to invalidate the prayer.\n\nA prayer becomes invalid in several cases that are summed up as follows:[1]\n1-Whatever invalidates purification also invalidates prayer, because purification is a condition for the validity of prayer. The absence of this condition renders the prayer invalid.\n2-Loud laughter: This is universally agreed,[2] because it is like speaking, if not worse. Such laughter indicates total disrespect and is totally inconsistent with prayer and the need to show humiliation before Allah, who commands us:\nStand up before Allah in devout obedience\n(2:238)\nA mere smile, however, does not invalidate prayer, as reported by Ibn al-Mundhir and others.\n3-Deliberate normal speech for any purpose other than that of the prayer itself.[3] Zayd ibn Arqam reports: ‘We used to speak during prayer, with a man talking to the one next to him in the row. Then the order was revealed:\nStand up before Allah in devout obedience\n(2:238)\nWe were commanded to be silent and forbidden to speak\nRelated by al-Bukhari, hadith No. 4,534; Muslim, hadith No. 539\nIf one is unaware of the prohibition, or is in a state of oblivion and speaks, his prayer is not invalidated.\n4-Deliberate exposure of one’s Awrah.\n5-Turning one’s back towards the qiblah, because facing the qiblah is a condition for the validity of prayer.\n6-Contact with impurity: When the worshipper is aware of any contact with impurity, or when he starts the prayer forgetting having had such contact then remembers it during the prayer, and does not immediately remove it, this invalidates prayer.\n7-Deliberately omitting an essential duty, whether it is a pillar, an obligatory act or a condition of the prayer without a valid reason.\n8-Doing any of several things that are not related to the prayer, such as eating and drinking.\n9-Leaning against something without any legitimate reason, because standing up is a condition for the validity of prayer.\n10-Deliberately adding a rukn that involves an action, such as doing more than one bowing or more than two prostrations in one rak'ah. Needless to say, this alters the form of prayer and as such, the prayer becomes invalid according to the universal view of scholars.\n11-Deliberately changing the order of rukns, because following the proper order is itself a rukn as we have already noted.\n12-Deliberately saying Assalamu 'alaikum before the prayer is finished.\n13-Deliberately changing the meaning when reciting al-Fatihah, as its recitation is a rukn."
                }]
            },
            {
                "id": 6,
                "content": [{
                    "id": 1,
                    "name": "What is reprehensible in prayer",
                    "content": "During prayers, one has to avoid some acts that are discouraged in a prayer. Those acts such as; moving too much, reciting only the Fatha in the first two rakaa, closing the eyes, and other gestures discussed below.\n\nWhat is reprehensible in prayer The following are discouraged in prayer :\n1-Reciting only the first surah, al-Fatihah, in the first two rak'ahs because this is against the Prophet’s (peace be upon him) practice and guidance.\n2-Repeating the surah, al-Fatihah, in the same rak'ah, because this is also against the Prophet’s (peace be upon him) practice. However, if one repeats it for a reason, as in the case of someone who has read it mechanically the first time and wanted to reflect on its meaning by reciting it again, then there is no harm, provided this does not lead to obsession.\n3-Turning one’s face slightly during prayer, without a reason, is also discouraged. When asked about this, the Prophet (peace be upon him) said ‘This is a time stolen by Satan from a person’s prayer.’ Related by al-Bukhari, hadith No. 751 If turning is for a reason, as in the case of someone who starts to have disturbing doubts about his prayer and needs to make the spitting gesture three times to the left during prayer, this is acceptable. In fact the Prophet (peace be upon him) recommended it in such a case. The same applies to a woman who is worried about a young child or a toddler who might be wandering around and she fears that the child might be lost. All this applies to slight turning, but if a person turns with his whole body, or turns his back towards the qiblah, then the prayer becomes invalid, unless there is a legitimate reason such as strong fear, etc.\n4-Closing one’s eyes in prayer, because this would be imitating the worship of the Majians, and it is also said that this is similar to what the Jews do. We, Muslims, are commanded not to be like the unbelievers.\n5-Placing one’s arms, up to the elbows, on the floor during prostration. The Prophet (peace be upon him) said ‘Let your body be in the right position when you prostrate yourself, and let not any of you place his arms on the floor like a dog does.’ It is, therefore, important to lift one’s arms above the floor, so as not to take a posture like an animal.’\n6-Making many movements, because this is contrary to the humble appearance required in prayer.\n7-Placing one’s hands over one’s waist on both sides. Abu Hurayrah said ‘The Prophet (peace be upon him) prohibited that a man puts his hands over his waist on both sides.’ Related by al-Bukhari, hadith No. 1,220; Muslim, hadith No. 545 8- Praying without having anything covering a man’s shoulders. Also it is disliked to pray while covering one’s mouth without a legitimate reason.[2]\n9-Starting movements before the imam in congregational prayers. The Prophet (peace be upon him) said ‘If anyone lifts his head before the imam, does he not fear that Allah may make his head like the head of an ass or may make him look like an ass.’ Related by al-Bukhari, hadith No. 691; Muslim, hadith No. 427 10-Clasping one’s fingers together. The Prophet (peace be upon him) told ‘someone who performed the ablution and came to the mosque for prayer that he should not do so.’ Related by Abu Dawud, hadith No. 562; al-Tirmidhi, hadith No. 386 and it stands to reason that it is even worse in prayer.\n11-Folding one’s hair or clothes. Ibn 'Abbas reports: ‘The Prophet (peace be upon him) was commanded to place seven bones on the floor in prostration and not to fold his clothes or hair. This means one shouldn’t fold his sleeves or clothes for prayer but rather leave it loose to bow and prostrate with him and also not to gather the hair if it is long in a bun for example for prayer.\n12-Praying when food is present or when one has the urge to go to the toilet. The Prophet (peace be upon him) says ‘Prayer is not preferred when food is around or when one feels the urge to go to the toilet.’ Related by Muslim, hadith No . 560 Praying is discouraged when food is around only if one is hungry and wants to eat and can have it.\n13-Raising one’s eyes to the sky. The Prophet (peace be upon him) says: ‘Those people who lift their eyes to the sky in prayer should stop, or their sights might not be safe.’ Related by Muslim, hadith No. 429"
                }]
            },
            {
                "id": 7,
                "content": [{
                    "id": 1,
                    "name": "Congregational prayer: its importance and status",
                    "content": "In addition to the honor Allah has granted Muslims through prayers, he has given them the honor of Congregational prayer. Congregational prayer is a duty for Muslims that Allah and his prophet (php) have made clear.\n\nMuslims are agreed that offering the five obligatory prayers in mosques is one of the best acts undertaken in obedience to Allah. Allah has given the Muslim community the opportunity to meet at certain times, such as the five daily prayers, the Friday prayer, the prayer on the two Eid days, and the prayer when there is an eclipse. These are great meetings and they serve the interests of the Muslim community, as people meet and discuss their affairs, as well as the affairs of other Muslim communities.\n\nAllah says\n\n‘O mankind, indeed We have created you from male and female and made you peoples and tribes that you may know one another. Indeed, the most noble of you in the sight of Allah is the most righteous of you. Indeed, Allah is Knowing and Acquainted.’\n\n(49:13)\n\nThe Prophet (peace be upon him) instructed the Muslims to attend congregational prayers at all time, explaining that it earns much greater reward.\n\nHe says\n\n‘Prayer in a congregation is 27 grades better than praying alone.’\n\nRelated by al-Bukhari, hadith Nos. 645 and 646; Muslim, hadith No. 650\n\nHe also said\n\n‘When a person prays in congregation his prayer gives him a reward which is 25 times the reward of his prayer at home or at his place in the market. This is so because when he performs the ablution at home, then goes out to the mosque for no reason other than attending the prayer, he is given a grade and forgiven a sin for every step he makes. When he is actually engaged in prayer, the angels bless him as long as he is at his place of worship.’\n\nRelated by al-Bukhari, hadith No. 647\n\n**Status:** Congregational prayer is a duty for Muslim men, and this is clear in both the Qur’an and the Sunnah.\n\nAllah says in the Qur’an\n\n‘When you are with the believers and about to lead them in prayer, let one group of them stand up with you.’\n\n(4:102)\n\nThe formula, ‘let a group of them stand [in prayer] with you’ is expressed in the Arabic text in the imperative form, and this form clearly indicates obligation. It is true that this verse refers to a situation when the Muslim community is in a state of fear, as in a situation where an enemy force may attack them. Needless to say, the order applies even more clearly in a state of peace.\n\nThe evidence from the Sunnah is found in the hadith\n\nreported by Abu Hurayrah\n\n‘Allah’s messenger said: “The prayers found too hard by the hypocrites are 'Isha’ and Fajr. Had they known how much goodness they bring, they would have come crawling to join them, even though they would have to crawl. I have even thought of ordering the prayer to be held and ordering one of you to lead the prayer, then I would go with some men carrying bundles of firewood. We would go to some people who abstain from coming to prayer and I would burn their homes.’\n\nRelated by al-Bukhari, hadith No. 644; Muslim, hadith No. 651\n\nThe hadith clearly indicates that the congregational prayer is a duty because:\n\n1) the Prophet (peace be upon him) described those who do not attend it as ‘hypocrites’, but a person who does not perform a Sunnah, or a recommended practice, is never considered hypocrite. This means that they have abstained from a duty.\n\n2) The Prophet (peace be upon him) said that he had thought of punishing them severely for staying away from the congregational prayer. Punishment is only inflicted for failing to do a duty. What stopped him from acting on this idea was that punishment by fire is only inflicted by Allah. Some scholars also say what stopped him from punishing them in this way was the fact that there were women and children in those homes, and these are not required to attend congregational prayers.\n\nAnother report mentions that a blind man asked the Prophet’s (peace be upon him) permission to offer his prayers at home. The Prophet asked him whether he could hear the adhan when he was at home. He affirmed that he could.\n\nThe Prophet (peace be upon him) said\n\n‘You have to respond. I cannot find any excuse for you.’\n\nRelated by Muslim, hadith No. 653\n\nThe Prophet (peace be upon him) also said\n\n‘Whoever hears the call must respond; his prayer away (from the mosque) is invalid unless he has a good reason.’\n\nRelated by Abu Dawud, hadith 551; Ibn Majah, hadith No. 793; al-Hakim, vol. 1, p. 245\n\nIbn Mas'ud said\n\n‘There we were, and only a person who was well known as a hypocrite would stay away (from the congregational prayers).’\n\nRelated by Muslim, hadith No. 654\n\nCongregational prayer is a duty that is applicable to men, but not to women or children who have not yet attained puberty. In reference to women,\n\nthe Prophet (peace be upon him) said\n\n‘Their homes are better for them.’\n\nRelated by Abu Dawud, hadith No. 567; Ahmad, hadith No. 2/76; al-Hakim, vol. 1, p. 209\n\nHowever, there is no reason to prevent women from attending congregational prayers at the mosque, provided they go out properly dressed, fearing nothing. It is correct to say that attending congregational prayers at the mosque is binding on those to whom it applies. For a person who does not attend the congregational prayer, choosing instead to offer his prayers alone, his prayer is valid but he incurs the sin of failing to do a duty if he were in the vicinity of a masjid.\n\nThe person to lead the congregational prayer in the mosque is the regular imam, or the one who knows the Qur’an best. It is acceptable that a young person or a blind man should lead the prayer. It is permissible for a person offering an obligatory prayer to lead another offering a voluntary prayer, or the reverse. Likewise, a traveler may lead the prayer, with residents behind him, or a resident leads with travelers behind him. A person who performed the normal ablution may lead the one who had only dry ablution, or the reverse. An imam may lead the prayer even when there are in the congregation one or more people who are better qualified to lead it.\n\nIt is preferable when there is a group of women offering a prayer that one of them should lead the prayer.\n\n'A’ishah used to lead a group of women in prayer, standing among them in the first row. Umm Salamah also used to do the same. The Prophet (peace be upon him) appointed Waraqah to do the adhan for her, and ordered her to lead the members of her household in obligatory prayers. However, if a man leads the prayer when there are only women in the congregation, this is acceptable."
                }]
            },
            {
                "id": 8,
                "content": [{
                    "id": 1,
                    "name": "Friday prayer",
                    "content": "Friday prayer is a duty on all male Muslims. Those who are free, sane, attained puberty, not travelling, have no excuse to miss it. It is performed at the time of Zuhr prayer and it is invalid without a sermon (speech).\n\nFriday prayer is obligatory to every male,\n\n:as Allah says\n\n‘Believers! When the call to prayer is made on Friday, go straightaway to the prayer and leave off your trading. This is best for you, if you but knew it.’\n\n(9:62)\n\n: The Prophet (peace be upon him) says\n\n‘Attending Friday prayers is obligatory to everyone who has attained puberty.’\n\n:He also said\n\n‘Some people shall cease to absent themselves from Friday prayer, or else Allah will seal their hearts and they would then be counted among those who are oblivious.’\n\nRelated by Muslim, hadith No. 865\n\nAl-Nawawi said: ‘This hadith makes clear that Friday prayer is obligatory to every individual (male) Muslim.’[1]\n\n:As the Prophet (peace be upon him) says\n\n‘Friday prayer is a duty binding on every Muslim.’\n\nRelated by Abu Dawud, hadith No. 1,067; al-Bayhaqi in Al-Sunan al-Kubra, hadith No. 5,578\n\nOn whom it is binding\n\nFriday prayer is a duty binding on every Muslim male who is free, sane, having attained puberty and is present in the area where he resides. This means that a person to whom any of these does not apply is exempt from Friday prayer.\n\n: The Prophet (peace be upon him) says\n\n‘Friday prayer with a congregation is a duty binding on every Muslim, except four: a slave, a woman, a child or an ill person.’\n\nIt is not binding on a person who is travelling because the Prophet (peace be upon him) did not offer Friday prayer on any of his travels. When he offered the pilgrimage, it happened that the day of attendance at Arafat was a Friday, but the Prophet did not offer Friday prayer then. He offered Thuhur and combined it with Asr. A traveller who finds himself in a town where Friday prayer is offered should offer it with the Muslim community. Moreover, if a slave, a woman, a child, an ill person or a traveller attends it, it is acceptable and replaces Thuhur prayer.\n\nTiming\n\nFriday prayer is offered at the same time as Thuhur prayer, i.e. just after the sun has started to move down at midday, up until the shade of any object is equal to its height.\n\n: Anas reports\n\n‘The Prophet (peace be upon him) used to offer Friday prayer when the sun had started to go down.’\n\nRelated by al-Bukhari, hadith No. 904\n\nThis is what is reported to have been done by the Prophet’s Companions.[2] It was also reported that the Prophet (peace be upon him) used to pray it before that. Some scholars say that it is permissible to pray it about half an hour before thuhur time when needed.\n\nThe sermon\n\nGiving a sermon is a rukn of Friday prayer, and it is invalid without it, because the Prophet (peace be upon him) did it all the time, never omitting it. It is of two parts that must be completed before the prayer.[3] The Imam must praise Allah, say the testimony of Tawheed and salutation and to recite at least one ayah.\n\nWhat is recommended in respect of the sermon\n\nIt is recommended to include in the sermon, or khutbah, a supplication for the Muslim community praying to Allah to grant them what gives them a happy life in this world and in the life to come, and to pray to rulers to be God-fearing and guided towards what benefits their communities. This is following the Prophet’s (peace be upon him) practice, because ‘the Prophet (peace be upon him) used to supplicate when he gave the khutbah on Friday,\n\n: and as he supplicated\n\n‘he would point out with his finger.’\n\nRelated by Muslim, hadith No. 874\n\nIt is also recommended that one person gives both parts of the khutbah and leads the prayer, raising his voice, and standing up when giving the khutbah.\n\n: Allah mentions that the Prophet gave the khutbah standing up\n\n‘When people see some trade or entertainment, they head off towards it, leaving you standing there.’\n\n(62:11)\n\n: Jabir ibn Samurah reported\n\n‘Allah’s messenger used to give the khutbah standing up, then he sat down, then stood up and continued the khutbah. If anyone tells you that he gave the khutbah seated, he does not tell you the truth.’\n\nRelated by Muslim, hadith No. 862\n\nIt is recommended that the imam should stand on a pulpit or at a high spot so that people could hear and see him better. He is recommended to sit down briefly between the two parts of the khutbah,\n\n: as Abdullah ibn Umar said\n\n‘The Prophet (peace be upon him) used to give two khutbahs standing up, separating them by sitting down.’\n\nRelated by al-Bukhari, hadith No. 928; Muslim, hadith No. 861; al-Daraqutni, hadith No. 160\n\nIt is also recommended that both khutbahs should be short, and the second should be shorter than the first.\n\n: Ammar quotes the Prophet (peace be upon him) as saying\n\n‘When a man makes his prayer long and his khutbah short, he demonstrates his good understanding. Therefore, make your prayer long and your khutbah short.’\n\nRelated by Muslim, hadith No. 869\n\nIt is also recommended that the imam should offer the greeting of salam to the congregation when he stands on the pulpit facing them.\n\n: Jabir reports\n\n‘When the Prophet (peace be upon him) stood up on the pulpit, he would offer the salam greeting.’\n\nRelated by Ibn Majah, hadith No. 1,109\n\nHe is also recommended to sit on the pulpit until the adhan is completed.\n\n: Ibn Umar reported\n\n‘The Prophet (peace be upon him) used to give two khutbahs, he would sit on the pulpit until the call for prayer is finished, then he would stand up and give the khutbah.’\n\nRelated by Abu Dawud, hadith No. 1,092\n\nWhat is forbidden in Friday prayer\n\nWhen the imam is giving the khutbah it is forbidden for people in the congregation to talk.\n\n: The Prophet (peace be upon him) says\n\n‘Whoever talks on Friday when the imam is giving the khutbah is like an ass carrying books.’\n\nRelated by Ahmad, hadith No. 2,033; al-Tabarani in Al-Mu'jam al-Kabir, hadith No. 12,563.\n\n: He also says\n\n‘If on Friday when the imam is delivering the khutbah you say to your friend, “listen”, then you have said what is unacceptable.’\n\nRelated by al-Bukhari, hadith No. 394; Muslim, hadith No. 85\n\nIt is also forbidden to walk forward, stepping over people’s shoulders as they sit to listen to the khutbah, in order to reach a place in front.\n\n: The Prophet (peace be upon him) said to someone who did just that\n\n‘Sit down. You have hurt people and caused them inconvenience.’\n\nRelated by Ahmad, hadith No. 17,674; Abu Dawud, hadith No. 1,118; al-Nassa’i, hadith No. 1,399; Ibn Majah, hadith No. 1,115; al-Hakim, hadith No. 424\n\nNeedless to say, to do so hurts people and diverts their attention from listening to the khutbah. Only the imam may do so if he cannot otherwise reach his place. It is also reprehensible to separate two people and sit between them.\n\n: The Prophet (peace be upon him) says\n\n‘Whoever takes a bath on Friday then he goes to the mosque, without separating between two people and he offers his obligatory prayer , he is forgiven whatever he might have done in between the (last) two Fridays.’\n\nRelated by al-Bukhari, hadith No. 910\n\nMinimum requirements\n\nIf one arrives at the mosque with the Friday prayer already in progress, he is deemed to have joined the prayer correctly if he joins completing at least the second rak'ah. He will need then to add another rak'ah after the imam has finished.\n\n: Abu Hurayrah quotes the Prophet (peace be upon him) as saying\n\n‘Whoever completes one rak'ah of Friday prayer (with the imam) is considered as having offered this prayer.’\n\nRelated by al-Nassa’i, hadith No. 1,425; Ibn Khuzaymah, hadith No. 1,850; al-Tabarani in Musnad al-Shamiyyin, hadith No. 2,885; al-Daraqutni, hadith No. 1,596.\n\nIf he prays with the imam less than one rak'ah, he completes his prayer as Thuhurprayer, i.e. 4- rak'ahs.\n\nForm\n\nFriday prayer consists of two rak'ahs with the imam reciting the Qur’an aloud in both. The Prophet (peace be upon him) did that, and what he did is part of his Sunnah. This is universally agreed by scholars.[4]\n\n‘It is recommended that the imam recites Surah 62, Al-Jumu'ah, after al-Fatihah in the first rak'ah, and Surah 63, The Hypocrites, in the second.’\n\nRelated by Muslim, hadith No. 879\n\n‘or Surahs 87 and 88, because the Prophet (peace be upon him) did that.’\n\nRelated by Muslim, hadith No. 878\n\nRecommended in Friday prayer\n\n1-It is recommended, i.e. a Sunnah, to go to the mosque early to earn great reward.\n\n: Abu Hurayrah reports that the Prophet (peace be upon him) said\n\n‘Whoever takes a bath on Friday, just like the one to remove ceremonial impurity, and goes to the mosque very early is like one who offers a camel (for charity); and whoever goes in the second hour is like one who offers a cow; and the one who goes in the third hour is like one who offers a horned ram; and whoever goes in the fourth hour is like one offering a chicken; while the one going in the fifth hour is like one offering an egg. Then when the imam starts, the angels attend to listen to Allah’s praises.’\n\nRelated by al-Bukhari, hadith No. 881; Muslim, hadith No. 850\n\n: The Prophet (peace be upon him) also says\n\n‘Whoever cleans himself and takes a bath on Friday, goes to the mosque really early, walking rather than riding, gets close to the imam, listens and says nothing frivolous, will have for every step he makes, the reward a whole year, fasting the day and worshipping at night.’\n\nRelated by Ahmad, hadith No. 16,172; Abu Dawud, hadith No. 345; al-Tirmidhi, hadith No. 496; al-Nassa’i, hadith No. 1,384; Ibn Majah, hadith No. 1,087\n\n2-It is also a Sunnah that one should take a bath on Friday, as noted in the hadith quoted earlier and reported by Abu Hurayrah. In fact, everyone should be keen to take a bath on Friday, particularly if one is known to have an unpleasant smell. Some scholars consider it a duty, because of a hadith\n\n: reported by Abu Sa'id al-Khudri, quoting the Prophet (peace be upon him)\n\n‘A bath on Friday is a duty for every Muslim who has attained puberty.’\n\nRelated by al-Bukhari, hadith No. 879; Muslim, hadith No. 846\n\nHowever, the most authentic opinion is that it is highly recommended.\n\n3-Furthermore, it is strongly recommended to wear perfume and take care of one’s cleanliness, removing whatever needs to be removed of one’s body, such as clipping one’s nails. This is more than taking a bath, as it involves removing bad smells and their causes, such as removing any hair that is recommended to be shaved, such as pubic hair, armpit hair, trimming one’s moustache. Though there is no authentic hadeeth recommending this, there are a lot of evidences stating that the companions and the scholars of different schools of thought recommended it.\n\n4-It is recommended also to wear some of one’s best clothes. Ibn Umar reports: ‘Umar ibn al-Khattab saw a fine suit near the door of the mosque, and said: “Allah’s messenger, you may wish to buy this suit and wear it on Fridays and to receive delegations when they come.”’ Al-Bukhari considers this report to indicate the preferability of wearing one’s best clothes for Friday prayer. Hence, he enters it in his anthology under the heading: ‘Wearing one’s best clothes.’ Ibn Hajar said: ‘This hadith is treated as evidence supporting the idea of wearing good clothes for Friday prayer because the Prophet (peace be upon him) approved Umar’s idea of maintaining good appearance on Fridays. Moreover, the Prophet (peace be upon him) says ‘Anyone of you will do well to buy two garments to use on Fridays instead of the two he wears for attending to his work.’ Related by Abu Dawud, hadith No. 1,078; Ibn Majah, hadith No. 1,095; al-Tabarani in Al-Mu'jam al-Kabir, hadith No. 373.\n\n5-It is also a Sunnah to pray to Allah to grant our Prophet (peace be upon him) praise and peace on the preceding night of Friday and during the daytime, as he told us to do so.[5]\n\n6-Another Sunnah is to recite in the Fajr prayer Surahs 33 and 76, as the Prophet (peace be upon him) frequently did so, and to recite Surah 18, during the day. The Prophet (peace be upon him) says ‘Whoever recites Surah 18, The Cave, on Friday will have a column of light rising from underneath his feet to the sky, giving him light on the Day of Judgement, and will be forgiven what he does in between the last two Friday prayers.’ Related by al-Nassa’i in Al-Sunan al-Kubra, hadith No. 10,722; al-Hakim, vol. 2, p. 399.\n\n7-When one enters the mosque on Friday or any other time, he is instructed not to sit down until he has offered a prayer of two rak'ahs in greeting to the mosque, because the Prophet (peace be upon him) ordered this.[6] If the imam is giving his speech, the entrant is advised to make his two rak'ahs short.\n\n8-Another Sunnah is frequent supplication on Friday, hoping to make his supplication at the time when prayers are answered. The Prophet (peace be upon him) says: ‘In every Friday, there is an hour, in which any Muslim who happens to be standing up in prayer at that time, and prays to Allah for anything, Allah will certainly grant it to him or her.’ Related by al-Bukhari, hadith No. 935; Muslim, hadith No. 852"
                }]
            },

            {
                "id": 9,
                "content": [{
                    "id": 1,
                    "name": "The Eid prayer",
                    "content": "Muslims celebrate two Eids a year. They start their Eid by performing a prayer that is one of the most favorite acts to them and they consist of two rakaa and a speech that reminds them of the Islamic ethics.\n\nMuslims have two Eids a year. The Eid is an occasion of pleasure and happiness, and each of the two Eids has a religious significance. The first, Eid al-Fitr, occurs when Muslims have finished fasting the month of Ramadan, while the second, Eid al-Adha, signals the end of the first 10 days of the lunar month, Dhul-Hijjah.\n\nRuling:\n\nThe Eid prayer is a collective duty, which means that when some Muslims offer it, the rest are not accountable for their omission. If no one offers it, then all share in the sin. This is because it is one of the clearest manifestations of the Islamic identity of the community. Moreover, the Prophet (peace be upon him) always did it, as did his Companions after he had passed away. The Prophet (peace be upon him) even ordered that women who were in their periods, and were as a result exempt from prayer, attend it, but were not to take part in the prayer itself. They attend to share in its blessings and in the joy of the community, which clearly indicates its importance. If the Prophet (peace be upon him) ordered women who were exempt from prayer to attend, then its attendance is more strongly incumbent on men. In fact, some scholars consider it mandatory duty on all men.\n\nMany scholars, however, are of the view that it is a confirmed Sunnah, i.e. highly recommended, as the Prophet (peace be upon him) offered it regularly and ordered men and women to attend it.\n\nConditions:\n\nThe most important conditions are that it should be offered in time, the presence of the required number of people and residence. This means that it is invalid if offered before it falls due, or if attended by less than three people. Moreover, it is not required of a person who is traveling.[1]\n\nPlace:\n\nIt is recommended to offer the Eid prayer in an open space away from residential buildings.\n\n:Abu Sa'id al-Khudri reports\n\n‘The Prophet (peace be upon him) used to go out to pray the Eid prayer of al-Fitr and al-Adha in the open space.’\n\nRelated by al-Bukhari, hadith No. 956; Muslim, hadith No. 889\n\nApparently this he did in order to publicize this Islamic tradition. It is permissible to offer it in a large mosque when there is a need for that, such as rain, strong winds, or other severe weather conditions.[2]\n\nTime:\n\nThe Eid prayer becomes due at the time when the Sunnah prayer known as Duha is due, which means it starts when the sun has risen in the sky about one spear’s length. This is when the Prophet (peace be upon him) and his successors used to offer it, and prior to the sun being at that height, prayer is discouraged.[3] It is recommended to start the Eid al-Adha prayer at the beginning of its time range and to delay the Eid al-Fitr prayer because the Prophet (peace be upon him) did that. People need to attend to their sacrifice after the prayer at Eid al-Adha, while the delay in Eid al-Fitr prayer helps a person who has not yet paid Zakat al-Fitr to pay it, as it must be paid up to immediately before the prayer.[4]\n\nDescription and recitation:\n\nThe Eid prayer consists of two rak'ahs, similar to the Friday prayer, In the first rak'ah and after the Takbeer (glorification), Allah-u akbar, and the opening supplication, the same after that, al-Fatiha and another surah are recited glorification of takbeer is repeated seven more times, after that, al-Fatiha and another surah are recited. In the second rak'ah the same takbeer is repeated five times, other than the takbeer for standing up from sujood before reciting al-Fatihah. This is based on the hadith.\n\n:reported by A’ishah\n\n‘Allah’s messenger used to say Allah-u akbar in the Eid prayers of al-Fitr and al-Adha seven times in the first rak'ah and five in the second.’\n\nRelated by Abu Dawud, hadith No. 1,149\n\n‘With each takbeer, it is recommended that one raise his hands, because the Prophet (peace be upon him) did that.’\n\nRelated by Ahmad, hadith No. 18,848\n\nThen the imam says silently a'udhu billahi min al-Shaytan al-Rajim (i.e. ‘I seek shelter with Allah against Satan, the accursed.’) He then recites the Qur’an aloud, reciting after al-Fatihah Surah Al Al'ala (87) in the first rak'ah and Surah Al Ghashia (88) in the second, as it is reported by Jabir ibn Samurah that the Prophet (peace be upon him) did that:\n\n‘It is also authentically reported that he read Surah Qaf 50 in the first rak'ah and Surah Al Qamar 54 in the second.’\n\nRelated by Muslim, hadith No. 891\n\nTherefore, it is good to do this in turn, looking always to make things easier for the congregation.\n\nKhutbah:\n\nUnlike the Friday prayer, the khutbah in the Eid prayer is given after the prayer.\n\n:Ibn Umar said\n\n‘The Prophet (peace be upon him), Abu Bakr and Umar used to offer the Eid prayer before giving the khutabah.’\n\nRelated by al-Bukhari, hadith No. 963; Muslim, hadith No. 888\n\nIf missed:\n\nIt is not recommended for anyone who misses out on the Eid prayer to offer it after it has finished, because this was not reported as suggested by the Prophet (peace be upon him). Moreover, it is a prayer for which a certain congregation gathers. It must, therefore, be offered in this fashion.\n\nWhat is recommended:\n\n1-It is a Sunnah, i.e. recommended, that the Eid prayer is organized at an open, well-known space, preferably outside the village or town, so that the community can gather and perform this distinctive act of worship. However, if it is offered in mosques for one reason or another, the prayer is still valid.\n\n2-As noted when we referred to its time, it is recommended to start the Eid al-Adha prayer early and to delay the Eid al-Fitr prayer.\n\n‘It is also a Sunnah to eat a few dates before going out to offer the Eid al-Fitr prayer, and not to eat anything on Eid al-Adha until the Eid prayer has finished and one eats from his sacrifice, as the Prophet (peace be upon him) did that on these occasions.’\n\nRelated by al-Tirmidhi, hadith No. 542; Ibn Majah, hadith No. 1,756\n\n‘eating an odd number of dates on Eid al-Fitr.’\n\nRelated by al-Bukhari, hadith No. 953\n\n4-It is a Sunnah also to walk to the place of the prayer, and to start early, soon after finishing the Fajr prayer, so that one can sit at a convenient place near the imam, and to earn the reward for awaiting the prayer.\n\n5- Men are recommended to take a bath before the prayer, wear perfume and put on a fine appearance, wearing some of one’s best clothes. Women are the same, but must not wear perfumes or expose their adornment.\n\n6- The imam is recommended to give a comprehensive speech, outlining the main principles of the Islamic faith.\n\n7-It is further recommended to say: Allahu Akbar, Allahu Akbar, La Ilaha illa Allah, wallahu Akbar Allahu Akbar walillahi Alhamd.\n\n:Allah says in the verse outlining the duty of fasting in Ramadan\n\n‘You are, however, required to complete the necessary number of days and to extol and glorify God for having guided you aright and to tender your thanks.’\n\n(2:185)\n\nThis takbeer is said from the sunset of the last day of Ramadan until the Imam comes out for Eid prayer, and also from the Fajr prayer on the 9th day of Thul Hijjah till the sunset of the 13th of the same month. It is announced after the Fard prayers. Men say their Takbeer (glorifications) aloud, while women recite them in a low voice, if they are in public.\n\n8-Changing route. It is recommended to change one’s route, going to the prayer one way and following a different route on the way back. Jabir reports that the Prophet (peace be upon him) did that on Eid days. It is said that this is done so that both routes will, on the Day of Judgment, testify for us, or that this special act of worship is shown in different areas.\n\nPeople need to congratulate one another on this occasion, saying to one another: ‘May Allah accept your and my good actions.’ The Prophet’s (peace be upon him) Companions used to do so, showing pleasure to meet other people."
                }]
            },
            {
                "id": 10,
                "content": [{
                    "id": 1,
                    "name": "The Prayer for Rain",
                    "content": "Offering prayers for rain (salaat al-istisqa’) is a Sunnah, as confirmed by saheeh hadeeths and the practice of the early generations of Islam.\n\nOffering prayers for rain (salaat al-istisqa’) is a Sunnah, as confirmed by saheeh hadeeths and the practice of the early generations of Islam. Ibn Qudaamah said: Prayer for rain is a confirmed Sunnah, proven by the practice of the Messenger of Allah (peace be upon him) and of his successors.[1]\n\nAbu Dawood (1165), at-Tirmidhi (558), an-Nasaa’i (1506) and Ibn Maajah (1266) narrated that Is-haaq ibn Abdillah ibn Kinaanah said:\n\nal-Waleed ibn ‘Uqbah, who was the governor of Madinah, sent me to ask Ibn ‘Abbaas about the prayer of the Messenger of Allah (peace be upon him) for rain (istisqa’). He said: The Messenger of Allah (peace be upon him) went out wearing modest clothes, walking humbly and beseeching Allah, until he reached the prayer place, where he ascended the minbar, but he did not give a khutbah like this khutbah of yours; rather he continued to offer supplication (du‘aa’), beseech Allah and recite takbeer, then he prayed two rak‘ahs as he used to pray at Eid\n\nDescription and recitation:\n\nThe prayer for rain consists of two rak'ahs, similar to Eid prayer.\n\nIn the first rak'ah, and after the takbeer (glorification), Allah-u akbar, and the opening supplication, takbeer is repeated seven more times, after that, al-Fatihah and another surah are recited. In the second rak[ah, the same takbeer is repeated five times other than the takbeer for standing up from sujood before reciting al-Fatihah.\n\n:This is based on the hadith reported by 'A’ishah\n\nAllah’s messenger used to say Allah-u akbar in the Eid prayers of al-Fitr and al-Adha seven times in the first rak[ah and five in the second\n\nRelated by Abu Dawud, hadith No. 1,149\n\nWith each takbeer, it is recommended that one raises his hands. Then the imam says silently a'udhu billahi min al-Shaytan al-Rajim (i.e. ‘I seek shelter with Allah against Satan, the accursed.’) He then recites the Qur’an aloud, reciting after al-Fatihah Surah Al A’ala (87) in the first rak[ah and Surah Al Ghashia (88) in the second, as it is reported by Jabir ibn Samurah that the Prophet (peace be upon him) did that. It is also authentically reported that he read Surah Qaf (50) in the first rak[ah and Surah Al Qamar (54) in the second\n\nRelated by Muslim, hadith No. 891\n\nThough this was for Eid prayers but the prayer for rain is identical to it. Therefore, it is good to do this in turn, looking always to make things easier for the congregation."
                }]
            },
            {
                "id": 11,
                "content": [{
                    "id": 1,
                    "name": "The Prayer of Eclipse",
                    "content": "Praying it is a communal obligation and it must be prayed in congregation and in the masjid. When the eclipse is visible and can be seen by people, the call is made to gather the Muslims in the mosque.\n\nWhen the sun was eclipsed at the time of the Messenger of Allah (peace be upon him), he commanded someone to call out “al-salaatu jaami’ah (congregational prayer is about to begin)”, and he led the people in prayer. Then he addressed them and explained to them the reason for the eclipse, and declared their pre-Islamic beliefs to be null and void. He explained to them what they should do, such as praying and making du’aa’ and giving in charity.\n\n:He said\n\nThe sun and the moon are two of the signs of Allah; they do not become eclipsed for the death or life of anyone. If you see that then call upon Allah and magnify Him, and pray, and give in charity\n\nRelated by an-Nasa'i, Book 16, hadith No. 16\n\nHow it is prayed:\n\nPraying it is a communal obligation and it must be prayed in congregation and in the masjid. When the eclipse is visible and can be seen by people, the call is made to gather the Muslims in the mosque. The Imam leads the prayer by offering takbeer, recites the Dua'a in the beginning of the prayer, seeks refuge in Allah from Satan, recites al-Fatiha and then recites a long surah after it. He then bows and prolongs his ruku and then stands straight saying: Sami’a Allahu liman Hamidah, rabana wa lakal Hamd. He then begins to recite al-Fatiha again and another long surah but shorter than the first one. After that, He bows and prolongs his ruku but less than the first one and then stands straight saying: Sami’a Allahu liman Hamidah rabana wa lakal Hamd and prolongs his standing position. He then offers two long prostrations and also prolongs his sitting in between the prostrations. After that, he stands up and repeats the same format as the first rak'ah but shorter. He then sits for tashahud and offers Salam.\n\nTime:\n\nThe eclipse prayer begins when the eclipse takes place, and should end once it is cleared out. One must not take the predictions of astronomers and pray without seeing it, but rather should only begin prayer once the eclipse is visible. While in prayer, the Imam finishes the prayer either by estimating the time or when someone notifies him."
                }]
            },
            {
                "id": 12,
                "content": [{
                    "id": 1,
                    "name": "Janazah prayer: for a deceased person",
                    "content": "Janazah prayer is a collective duty. It is performed with the presence of the body of the deceased person in front of the praying people. It consists of standing up, four glorifications, and reciting Al Fatha.\n\nIt is very important that everyone should always remember death and the end of one’s life in this world, preparing for this eventuality by doing good works, repenting of sin and rectifying injustice, so as to have the right preparation for one’s future, eternal life.\n\nIt is part of the Sunnah, (recommended actions) to visit people who are ill and remind them of the need to repent of sin and to write their wills. When a person is known to be close to death, it is a Sunnah to remind him to say: La ilaha illa Allah, (i.e. there is no deity other than Allah), so that it is the last thing he says. He should not be reminded to say it again unless he speaks something else. If it was the last thing he said before dying, he will go to Paradise as our Prophet (peace be upon him) had told us.[1] When a person dies, it is recommended to close his eyes and to take steps to prepare him for burial and bury him without delay.\n\nStatus:\n\nThe prayer for a deceased person is a collective duty,(fard kifaayah), which means that it must be done by some people, and when it is done, those who did not attend it are absolved of the responsibility. The basis of this verdict is the fact that when the body of a deceased person was brought in the mosque and he had some debt outstanding,\n\n:the Prophet (peace be upon him) said to his Companions\n\n‘Pray for your brother.’\n\nRelated by al-Bukhari, hadith No. 2,289; Muslim, hadith No. 1,619\n\nMoreover, when the Prophet (peace be upon him) was given the news of the death of Negus,\n\n:he said to his Companions\n\n‘A brother of yours has passed away. Stand up and pray for him.’\n\nRelated by Muslim, hadith No. 952.\n\nConditions:\n\nThe conditions for the validity of the janazah prayer are the same as the conditions of prayer mentioned earlier, with the exception that it is not time-bound and that the body of the deceased must be present in front of the people offering the prayer. Moreover, both the deceased and the one offering the prayer should be Muslims, and they should both  be in a state of purification, even if it be dry ablution when there is a need for it.\n\nEssentials:\n\nThe people offering the prayer for the deceased should stand up, as this is a prayer and standing up is required in all prayers. It consists of four takbeer (glorifications), i.e. Allah-u akbar,\n\n‘because the Prophet (peace be upon him) offered it for the Negus with four takbeer.’\n\nRelated by al-Bukhari, hadith No. 1,245; Muslim, hadith No. 951.\n\nOther essentials are reciting al-Fatihah because the hadith that mentions that no prayer is valid without reciting al-Fatihah applies to all prayers;\n\nblessing the Prophet (peace be upon him); supplication for the deceased as the Prophet (peace be upon him) said\n\n‘When you pray for a deceased person, make your supplication sincere.’\n\nRelated by Abu Dawud, hadith No. 3,199; Ibn Majah, hadith No. 1,497\n\nfinishing with salam, because the hadith that makes salam the end of prayer also applies; and doing these essentials in the right order.\n\nRecommended practices\n\nIt is recommended to raise the hands with every one of the four takbeer (glorifications) to say A'udhu billahi min al-Shaytan al-Rajim before reciting al-Fatihah; to include oneself and all Muslims in one’s supplication; and to say all this quietly, not audibly.[2]\n\nTime:\n\nThe time to offer the janazah prayer starts after having washed the body of the deceased, wrapped and prepared him or her for burial. If one misses the congregational prayer, he can offer it at the cemetery.\n\nImportance:\n\n:The Prophet (peace be upon him) said\n\n‘Whoever takes part in a funeral until the janazah prayer has been offered shall have a share of the reward, and whoever takes part until the deceased has been buried shall have two shares. People asked: ‘What are these shares?’ The Prophet (peace be upon him) said: They are like two huge mountains.’\n\nRelated by al-Bukhari, hadith No. 1,325; Muslim, hadith No. 945\n\nHow it is done\n\n1. The imam, or the person who is offering the prayer alone, stands close to the head of the deceased male, or near the middle of the body of the deceased female, as Anas reported the Prophet (peace be upon him) did that.\n\n2. He then says Allah-u akbar to start the prayer, and follows this with a'udhu billahi min al-Shaytan al-Rajim, then recites al-Fatihah silently, even when the prayer is offered at night.\n\n3. Then the imam says the second Allah-u akbar and follows it with sending the Ibrahimic salutation to the Prophet (peace be upon him) as said at the end of every normal prayer.\n\n4. Then he says the third takbeer and follows it with supplications for the deceased. There are supplications said by the Prophet (peace be upon him) on such occasions, such as:\n\na. ‘Our Lord, forgive us all: the living and the dead; the present and the absent; the young and the old; the males and the females. Our Lord, whoever of us You keep alive enable them to live as Muslims, and those of us whose souls You gather let them end their lives as believers.’\n\nb. Other supplications for the deceased include:\n\n‘My Lord, forgive him (or her); bestow mercy on him and wipe his sins; bless his place and widen his entrance; wash him with water, snow and hail; clear him of sins as stains are removed from a white robe; place him in a home better than his home, and give him a family better than his family, and a spouse better than his spouse. Admit him into heaven and shelter him from torment in the grave and punishment in hell.’\n\nRelated by Muslim, hadith No. 963\n\nc. If the deceased is a child, the supplication includes:\n\n‘My Lord, make him precede his parents (to Paradise) and a cause to give them great reward.’\n\nRelated by [Abd al-Razzaq in Al-Musannaf, vol. 3, p. 529, hadith No. 6,589\n\n5. Then he says the last Allahu Akbar and pauses a little. It is good to add a supplication here, such as:\n\n‘Our Lord, do not deprive us of the reward of this funeral and do not give us a hard trial after him.’\n\nRelated by Malik in Al-Muwatta’, hadith No. 612; [Abd al-Razzaq in Al-Musannaf, vol. 3, p. 488, hadith No. 6,425\n\n6. He then finishes with salam once only to the right, but if he makes them two salams, to the right and left, this is also valid.\n\nIf one joins the prayer after it has started, he completes the prayer after the imam has finished. If one misses the prayer before the deceased is buried, one may go to the grave and pray the janazah prayer there, as the Prophet (peace be upon him) did when he was informed that the cleaner who used to look after the mosque had died. He went to her grave and prayed there.[3]\n\nIf the deceased is in a different town, one may offer the janazah prayer on being informed of his death, even if this happens a month or more later.[4] If a woman has a miscarriage, the janazah prayer is offered for the aborted embryo if the pregnancy was more than four months, though some scholars validate the janazah for a fetus as young as forty days, based on more than one statement of the Prophet (peace be upon him)."
                }]
            }
        ]
    }, {
        "level": 5,
        "content": [{
                "id": 1,
                "content": [{
                    "id": 1,
                    "name": "Fasting",
                    "content": "Fasting is not an act that is meant to torture you. In fact, it is one of the most meaningful forms of worship that Allah has asked us to perform whenever we can. It is the easiest way to see the world differently.\nLinguistically speaking, fasting means abstention from something. In an Islamic context, it means intentional abstention from eating and drinking, as well as all that invalidates fasting, from the break of dawn until sunset with the intention of worshipping Allah.[1]\n\nThe spiritual concept of fasting\n\n1-Fasting is a means of expressing one’s gratitude for Allah’s blessings. It stops a person from eating, drinking and sex, which are some of Allah’s great blessings. To refrain from them for a considerable time is to show one’s appreciation of these blessings. An aspect of Allah’s grace may be taken for granted, or people may be oblivious to it until it is denied, and people will then know its importance. They will then recognize Allah’s grace and feel grateful for it. To express gratitude for Allah’s blessings is a duty that is required logically and from the Islamic viewpoint.\n\nAllah refers to it in the verse that imposes the duty of fasting the month of Ramadan:\n\n‘telling us that the fulfilment of this duty is the way ‘to tender your thanks.’ (2:185)\n\n2-Fasting is a means to maintain a God-fearing attitude. When a person abstains from what is lawful in order to please Allah and in fear of His punishment, that person willingly refrains from what is forbidden. This means that fasting leads one to steer away from what Allah has prohibited. Fasting is indeed made a duty for us in order to nurture this feeling of fearing Allah,\n\nas He says\n\n‘Believers, fasting is decreed for you as it was decreed for those before you, so that you may be God-fearing.’ (2:183)\n\n3-Fasting overcomes desire. When man eats a full meal, he thinks of satisfying other desires. When he is hungry, other desires take a secondary place in his interests.\n\nThe Prophet (peace be upon him) advises young people saying\n\n‘Young men, whoever of you can afford marriage should get married because marriage will help him lower his gaze and maintain his chastity. The one who is unable to get married may fast, as fasting provides protection [against sin].’\n\nRelated by al-Bukhari, hadith No. 5,065; Muslim, hadith No. 1,400\n\nThis shows that fasting is a means that helps man to refrain from sin.[2]\n\n4-Fasting encourages people to be compassionate and kind to those who are in need. When a person fasts and experiences hunger for a long time, he will remember his feelings, and he will be more willing to be charitable to people who are poor and in need of help. His kindness to such people will earn him rich reward from Allah.\n\n5-Fasting puts the rich and the poor on the same level, as they will all bear the same pain of hunger. This increases one’s reward.[3]\n\n6-Fasting helps to overcome the temptation presented by Satan, who exploits human desires to lead people away from Allah’s path, and such desires are always stronger when one eats and drinks.\n\nSafiyyah reports that the Prophet (peace be upon him) said\n\n‘Satan has his way with a human being like his own blood.’\n\nRelated by al-Bukhari, hadith No. 7,171; Muslim, hadith No. 2,174\n\n7-Fasting helps man to disregard the fleeting pleasures of this life and to look for the lasting happiness in the life to come.\n\nConditions: The following conditions must apply for the duty of fasting to be valid:\n\n1-Being a Muslim: Fasting is not valid if it is done by an unbeliever. It is an act of worship, and worship cannot be offered by an unbeliever. When an unbeliever embraces Islam, he or she is not required to fast for previous years.\n\n2-Puberty: Fasting is not required of anyone who has not attained the age when Islamic worship applies, which is the attainment of puberty.\n\nThe Prophet (peace be upon him) says\n\n‘Three are exempt from duties.’\n\nRelated by at-Tirmidhi, Book 17, hadith No. 1\n\nOne of these is a child until attaining puberty. However, if a child below this age understands actions and requirements and fasts, that fast is accepted. Fathers and guardians will do well to encourage such children to fast so as to be familiar with fasting.\n\n3-Sanity: Fasting is not required of an insane or mentally disabled person.\n\n4-Sound health: A person who is ill and cannot fast is not required to fast. However, if he or she fasts, their fast is valid.\n\nAllah says\n\n‘He who is ill or on a journey shall fast instead the same number of days later on.’ (2:185)\n\nWhen a person who is ill in Ramadan recovers and is back in good health, he should compensate for not fasting during his illness by fasting the same number of days that were missed.\n\n5-Being in one’s place of residence: A person who is on a journey is not required to fast. However, if he or she fasts, their fast is valid.\n\nAllah says\n\n‘He who is ill or on a journey shall fast instead the same number of days later on.’ (2:185)\n\nWhen a person who undertakes a journey in Ramadan, and avails himself of the concession not to fast, is back in his hometown, he should compensate for not fasting during his travel by fasting the same number of days.\n\n6-Women who are in their period or having postnatal bleeding may not fast. In fact, fasting is prohibited for women during the menstrual and postnatal periods. The Prophet (peace be upon him) stated this clearly.[4]\n\nHowever, they must fast the same number of days later.\n\nA’ishah said\n\n‘We used to have these periods and we were ordered to fast in compensation, but no compensation for prayer was required.’\n\nRelated by al-Bukhari, hadith No. 321; Muslim, hadith No. 335\n\nEssentials: rukns. The first is the abstention from anything that invalidates fasting from the break of dawn until sunset. This is based on the Qur’anic verse that includes\n\n‘Eat and drink until you can see the white streak of dawn against the blackness of the night. Then resume the fast till nightfall.’ (2:187)\n\nThe second rukn is that a person intends this abstention as an act of worship. It is intention that distinguishes whether a particular deed is one of worship or an ordinary action. Intention also distinguishes between acts of worship. A fast may be an obligatory worship, as in the case of fasting in Ramadan, or it may be a different fast. This rukn is based on the hadith in which\n\nthe Prophet (peace be upon him) says\n\n‘Actions are but by intention and every person shall have but that which he intended.’\n\nRelated by al-Bukhari, hadith No. 1; Muslim, hadith No. 1,907.\n\nStatus: Allah has given us the binding duty of fasting the month of Ramadan, making it one of the five pillars of the Islamic faith.\n\nHe says\n\n‘Believers, fasting is decreed for you as it was decreed for those before you, so that you may be God-fearing.’ (2:183)\n\nHe also says\n\n‘The month of Ramadhan [is that] in which was revealed the Qur'an, a guidance for the people and clear proofs of guidance and criterion. So whoever sights [the new moon of the month, let him fast it.’ (2:185)\n\nAbdullah ibn ' Umar reports that he heard the Prophet (peace be upon him) say\n\n‘Islam has been built on five pillars: testifying that there is no deity other than Allah and that Muhammad is the Messenger of Allah (peace be upon him), attending regularly to the prayers, paying the zakat, fasting in Ramadan and making the pilgrimage to the Sacred House if one is able to undertake the journey.’\n\nRelated by al-Bukhari, hadith No. 8; Muslim, hadith No. 16\n\nFurthermore,\n\nTalhah ibn ' Ubaydillah reported that a Bedouin with dishevelled hair said to the Prophet peace be upon him\n\n‘O Messenger of Allah, tell me what fasting Allah has made obligatory to me.’ The Prophet (peace be upon him) said: ‘The month of Ramadan.’ The man asked: ‘Anything else?’ The Prophet (peace be upon him) said: ‘No, unless you wish to volunteer something.’\n\nRelated by al-Bukhari, hadith No. 46; Muslim, hadith No. 11\n\nThe Muslim community is unanimous that fasting the month of Ramadan is obligatory, and that it is one of the pillars of Islam, essentially known to all Muslims, and that anyone who denies this obligation is an unbeliever or an apostate. This means that the obligation of fasting is confirmed by the Qur’an, the Sunnah and the unanimity of Muslims. Muslims also unanimously agree that anyone who denies it is an unbeliever."
                }]
            },
            {
                "id": 2,
                "content": [{
                        "id": 1,
                        "name": "Confirmation of the start of Ramadan",
                        "content": "Ramadan is a lunar month, so its start and end are confirmed by the sighting of the new moon. It requires two acceptable Muslims testifying to the fact, but if no one sees it; Muslims must complete the precedent month.\n\nAs Ramadan is a lunar month, its beginning is determined by the sighting of the new moon. Thus, if someone sights the new moon himself or confirms its sighting by a Muslim person of integrity or gets to know of it, the month is deemed to have started.\n\nThis is implied by the divine order\n\n‘So whoever sights [the new moon of] the month, let him fast it.’\n\n(2:185)\n\nThe Prophet (peace be upon him) says\n\n‘When you have sighted the new moon, fast.’\n\nRelated by al-Bukhari, hadith No. 1,900; Muslim, hadith No. 1,080\n\nIbn 'Umar reports\n\n‘I told the Prophet (peace be upon him) that I sighted the new moon of Ramadan and he fasted and ordered people to fast.’\n\nRelated by Abu Dawud, hadith No. 2,342; al-Darimi, hadith No. 1,733; Ibn Hibban, hadith No. 3,447; al-Hakim, vol. 1, p. 585\n\nIf the new moon is not sighted, and no Muslim testifies to sighting it, it becomes obligatory to complete the preceding month, Sha[ban 30 days. The beginning of Ramadan can only be confirmed by one of these two ways: the sighting of the new moon or completing the month of Sha[ban 30 days.\n\nThe Prophet (peace be upon him) says\n\n‘Begin fasting when you have sighted the new moon and finish your fasting when you have sighted the new moon. If it is too cloudy, you are otherwise unable to sight it, then complete the month of Sha'ban 30 days.’\n\nRelated by al-Bukhari, hadith No. 1,909; Muslim, hadith No. 1,081\n\nThe end of the month of Ramadan is also determined by the sighting of the new moon of Shawwal, with two acceptable Muslims testifying to the fact. If two witnesses do not testify, then Ramadan must be completed 30 days."
                    },
                    {
                        "id": 1,
                        "name": "When the intention should be formed",
                        "content": "What is more important than fasting is forming the intention. Muslims are obliged to form the intention and it must be formed before dawn. If the fasting is voluntary it is acceptable to form it during the day.\n\nA person who fasts must intend to fast, for the intention is a rukn of fasting as the Prophet (peace be upon him) says: ‘Actions are but by intention.’\n\nEvery person shall have but that which he has intended.’ In obligatory fasting, such as the fasting in Ramadan, atonement for some misdeed, compensatory fasting or pledged fasting, the intention should be formed during the night, before the break of dawn even by seconds.\n\nThe Prophet (peace be upon him) says: ‘A person who has not intended to fast before dawn renders his fast invalid.’\n\nRelated by Abu Dawud, hadith No. 2,454; al-Tirmidhi, hadith No. 733; al-Nassa’i, hadith No. 2,331; Ibn Majah, hadith No. 1,700; al-Darimi, hadith 1,740; al-Daraqutni, hadith No. 2,214\n\nIf during the day, having not eaten or drunk anything since dawn, a person forms the intention to fast that day, it will be acceptable only if that fasting is voluntary.\n\nA’ishah reports: ‘The Prophet (peace be upon him) came in one day and asked: “Have you got anything (to eat)?” We said: “No.” He said: Then, I am fasting.’\n\nRelated by Muslim, hadith No. 1,154\n\nOn the other hand, obligatory fasting cannot be started with an intention formed during the day. The intention in obligatory fasting must be formed during the night, before dawn. It is sufficient to form the intention on the start of Ramadan for the whole month, providing he doesn’t miss a day in between."
                    }
                ]
            },
            {
                "id": 3,
                "content": [{
                    "id": 1,
                    "name": "Exemptions from fasting",
                    "content": "Allah the most merciful has exempted some people from fasting in Ramadan. Some cases like; sick, old people, or travelers. And they have to make up for those days later and give compensation to the poor and needy.\n\n1- Illness and old age: A person who is ill and hopes to recover good health may not fast during the days when he is ill. When he is back in health he must fast the same number of days he did not fast in Ramadan, during the following eleven months.\n\nAllah says\n\n‘[Fast] on a certain number of days. But whoever of you is ill, or on a journey, shall fast instead the same number of days later on.’\n\n(2:184)\n\nHe also says\n\n‘So whoever sights [the new moon of] the month, let him fast, and whoever is ill or on a journey then an equal number of other days. Allah intends for you ease and does not intend for you hardship.’ (2:185)\n\nThe type of illness that gives the exemption from fasting is one that makes fasting hard.\n\nA person suffering a chronic illness with little or no hope of recovery, and one who is permanently unable to fast such as a frail, elderly person, need not fast and are not required to fast later. What they are required to do is to give compensation in the form of feeding a poor person for every day when they did not fast. In the early days of Islam, when fasting was made a duty, Muslims were given the choice of either to fast or to feed one poor person for the day. Thus, Allah made the feeding of a poor person equal to fasting. This remains the case when exemption is permanent.\n\nImam al-Bukhari mentions in his anthology of authentic hadiths: ‘Al-Hasan and Ibrahim mentioned that an elderly person who finds fasting too hard may feed a poor person. Anas did that for a year or two when he was too old: he fed a poor person in compensation for every day he could not fast.\n\nRegarding an elderly man or woman who finds fasting too hard,\n\nIbn ' Abbas said: ‘Each should feed one poor person in compensation for every day of fasting.’\n\nRelated by al-Bukhari, hadith No. 4,505\n\nThus, a person who is permanently unable to fast, either because of a chronic illness or being elderly, should compensate for non-fasting by feeding a poor person. Scholars used to estimate that by a measure equal to 1.125 kilograms of wheat, rice, dates, or the staple diet of one’s town. However, it is better to say that feeding a poor person should be of what one usually feeds his family,\n\nas Allah says in regard to the compensation of a broken oath: ‘The breaking of an oath must be atoned for by the feeding of 10 needy persons with more or less the same food as you normally give to your own families, or by clothing them, or by the freeing of one slave. He who cannot afford any of these shall fast three days instead.’ (5:89)\n\nIf an ill person fasts, his fasting is valid.\n\n2- Travel: A person on a journey is given the concession that he does not need to fast in Ramadan, but he must compensate for it by fasting the same number of days he did not fast during his travel.\n\nAllah says: ‘[Fasting for] a limited number of days. So whoever among you is ill, or on a journey,[during them] - then an equal number of days [are to be made up].’ (2:184)\n\nHe also says: ‘So whoever sights [the new moon of] the month, let him fast; and whoever is ill or on a journey then an equal number of other days.’ (2:185)\n\nSomeone asked the Prophet (peace be upon him) about fasting during travel. He answered\n\n‘If you wish you may fast, and you may not fast if you wish.’\n\nRelated by al-Bukhari, hadith No. 1,943; Muslim, hadith No. 1,121\n\n‘The Prophet (peace be upon him) started his travel to Makkah fasting, but when he reached al-Kadid he broke his fast, and so did his Companions.’\n\nRelated by al-Bukhari, hadith No. 1,944; Muslim, hadith No. 1,113\n\nExemption from fasting is applicable to travel that covers a distance similar to that which allows shortening prayers.[2] This is estimated at about 80 kilometers. Another way of gauging it is according to what Muslims there consider as traveling.\n\nMoreover, travel must be for a legitimate purpose. If it is undertaken to commit a sinful action, or to dodge fasting, the exemption does not apply.\n\nIf a traveler chooses to fast, his fasting is valid.\n\nAnas reports: ‘We used to travel with Allah’s messenger, and a fasting person did not press an advantage against one who did not fast, nor did the one who was not fasting claim that he was doing better.’\nRelated by al-Bukhari, hadith No. 1,947; Muslim, hadith No. 116\n\nIt is a condition for fasting during travel that fasting should not cause hardship. If the person concerned finds fasting too hard or harmful, then it becomes prohibited and sinful to fast during travel. During his travel, the Prophet (peace be upon him) saw a man who was being given covering shade because it was too hot, and people gathered around him. When he was informed that the person was fasting,\n\nthe Prophet (peace be upon him) said: ‘It is not an act of righteousness to fast when traveling.’\n\nRelated by al-Bukhari, hadith No. 1,946\n\n3- Menstruation: When a woman is in her menstrual period, or having postnatal bleeding, she must not fast. In fact, if she fasts, her fast is invalid. Abu Sa'id al-Khudri mentions that the Prophet (peace be upon him) clearly stated that a woman in menstruation may neither pray nor fast. She is required to compensate by fasting later on. 'A’ishah said: ‘It happened to us and we were ordered to fast later in compensation, but not to compensate for missed prayers.’\n\n4- Pregnancy and breastfeeding. A woman who is pregnant or breastfeeding and fears for herself or her child as a result of fasting may not fast.\n\nAnas reported that the Prophet (peace be upon him) said:\n\n‘Allah has reduced a traveler’s prayer by half and exempted him from fasting, and He has exempted pregnant and breastfeeding women from fasting.’\n\nRelated by Ahmad, hadith No. 20,326; al-Tirmidhi, hadith No. 715; al-Nassa’i, hadith No. 2,274; Ibn Majah, hadith No. 1,667\n\nBoth pregnant and breastfeeding women must compensate for not fasting by fasting a similar number of days later on, or they can feed a poor person for each day they do not fast.\n\nIbn 'Abbas said: ‘If a breastfeeding or a pregnant woman fears for her child, she does not fast, but she feeds a poor person.’\n\nRelated by Abu Dawud, hadith No. 2,318"
                }]
            },
            {
                "id": 4,
                "content": [{
                    "id": 1,
                    "name": "Fasting and its effect in life",
                    "content": "Fasting is more than just boycotting food and drinks. There are a lot of hidden messages behind fasting. It is a beneficial form of worship that doesn't only redeem your body but also your soul and mind.\n\n1- It is a commitment to obeying Allah and, as such, it helps to refrain from sin.\n\n2- It provides good training to tolerate hardship with a cheerful manner.\n\n3- It reminds us of Allah’s favours, as He has given us good food and drink and allowed us sex with our spouses. When we refrain from these during the day, we better appreciate Allah’s blessings.\n\n4- It serves as a reminder of the need for our poor brethren.\n\n5- Man fulfills the meaning of servitude to Allah through fasting.\n\n6- Fasting helps anyone who is addicted to something forbidden to overcome his addiction."
                }]
            },
            {
                "id": 5,
                "content": [{
                    "id": 1,
                    "name": "What invalidates fasting",
                    "content": "There are some acts that invalidate Muslims fasting, and they must be aware of. These acts include; eating, drinking, having sexual intercourse, forcing oneself to vomit, cupping, or fasting during menstruation.\n\nA fasting person invalidates his fast by any of the following actions:\n\n1-Eating or drinking deliberately:\n\nAllah says: ‘And eat and drink until the white of dawn becomes distinct to you from the black thread [of night]. Then resume the fast till nightfall.’ (2:187)\n\nFurthermore, anything that takes the place of eating and/or drinking shares the same ruling and invalidates fasting. For example, receiving intravenous fluids takes the place of food and drink because it nourishes the body the same as food and drink.\n\n2-Sexual intercourse: Whoever has sexual intercourse with his wife when fasting, their fast is invalidated. The person who thus invalidates his fast during Ramadan is required to repent for having committed this sinful action, seek Allah’s forgiveness, fast a day in compensation for this invalidated day and further expiate his wrong by freeing a slave from bondage. If this is unavailable or unaffordable, then the expiation takes the form of fasting two consecutive months. If the offender is unable to fast two months, then he feeds 60 poor people.\n\nAbu Hurayrah reports:\n\n‘We were sitting with Allah’s messenger when a man came in and said ‘O Messenger of Allah, I am ruined.” The Prophet (peace be upon him) asked him: “What have you done to be ruined?” He said: “I had intercourse with my wife when I was fasting (in Ramadan).” The Prophet (peace be upon him) asked him: “Can you afford to free a slave?” The man said he could not. The Prophet (peace be upon him) asked: “Can you, then, fast two consecutive months?” The man said: “No.” The Prophet (peace be upon him) asked: “Can you feed 60 poor people?” The man again said: “No.” The Prophet (peace be upon him) waited. Then as we were still with the Prophet (peace be upon him), he was brought a sack of dates. He asked: “Where is the man who asked me earlier?” The man identified himself. The Prophet (peace be upon him) said: “Take this and give it away to charity.” The man said: “Shall I give it to anyone poorer than me, Messenger of Allah? By Allah, there is not in between the two sides of Madinah a household that is poorer than my own family.” The Prophet (peace be upon him) smiled widely, then said: Feed your family with it.’\n\nRelated by al-Bukhari, hadith No. 1,936; Muslim, hadith No. 1,111\n\nRelated to this, fasting is invalidated by deliberate ejaculation, as in the case of masturbation or foreplay leading to ejaculation. All this counts as deliberate arousal and this is contrary to fasting. In such a case, the person who does any of these must compensate by repenting and fasting a day after Ramadan. There is no other expiation required because such expiation is binding only in the case of the man having sexual intercourse with his wife.\n\n3-Deliberate vomiting: This means deliberately throwing up whatever is in one’s stomach of food or drink. If it happens unintentionally, the fast remains valid.\n\nThe Prophet (peace be upon him) said:\n\nWhoever throws up unintentionally need not compensate for his fast, but the one who throws up deliberately must repeat his fast.’\n\nRelated by [Abdullah ibn Ahmad in Zawa’id al-Musnad, hadith No. 10,463; Abu Dawud, hadith No. 2,380; al-Tirmidhi, hadith No. 720; Ibn Majah, hadith No. 1,676; al-Nassa’i in Al-Sunan al-Kubra, hadith No. 3,117\n\n4-Cupping: This involves bringing blood out through the skin, rather than the veins. If a fasting person undergoes cupping, he invalidates his fasting,\nas the Prophet (peace be upon him) says: ‘Both the cupping and the cupped persons break their fast.’\n\nRelated by Abu Dawud, hadith No. 2,367; Ibn Majah, hadith No. 1,680; Ibn Khuzaymah, hadith No. 1,983\n\nThe person administering the cupping also invalidates his fast if he sucks the blood with his mouth, but if the sucking is done by some tools, then his fast remains valid.\n\n5-Menstruation and postnatal bleeding: When a woman begins her menses, or her postnatal period, her fast is invalidated. She must compensate by fasting later.\n\nThe Prophet (peace be upon him) said: ‘Is it not true that when she has the period, she neither prays nor fasts?.’\n\nRelated by al-Bukhari, Book 30, hadith No. 58\n\n6-Intending to break the fast: Any fasting person who forms the intention of breaking or ending his fast before the time is due invalidates his fast, even though he might not eat or drink. Intention is one of two essentials for the validity of fasting. If it is broken, with the intention to end the fast, the fast is broken."
                }]
            },
            {
                "id": 6,
                "content": [{
                    "id": 1,
                    "name": "The Night of Decree and I'tikaf in Ramadan",
                    "content": "I'tikaf means committing oneself to something, but in Islamic contexts, it refers to staying in seclusion in a mosque, by a Muslim who knows what he is doing, for the worship of Allah.\n\nStatus: This is a recommended action, i.e. Sunnah, and it draws a person closer to Allah, who says in the Qur’an:\n\n‘And We charged Abraham and Ishmael [saying], \"Purify My House for those who perform Tawaf and those who are staying [there] for worship and those who bow and prostrate [in prayer].’\n\n(2:125)\n\nThis verse makes clear that it was an approved practice in earlier faiths.\n\nAllah also says in the verse explaining rulings applicable to fasting:\n\n‘And do not have relations with them (your wives) as long as you are staying for worship in the mosques.’(2:187)\n\nA’ishah reports that:\n\n‘the Prophet (peace be upon him) used to spend the last ten days of Ramadan in seclusion in the mosque until he passed away.’\n\nRelated by al-Bukhari, hadith No. 2,020; Muslim, hadith No. 1,172\n\nAll Muslims agree that it is an aspect of Islam and that it is a Sunnah, which becomes binding only if a man commits himself to it by making a pledge to do it.\n\nThus, the fact that i' tikaf is a Sunnah is confirmed by the Qur’an, the hadith, and the unanimity of scholars. Islam recommends Muslims to practice this Sunnah and stay in the mosque in the last 10 nights of Ramadan when they should devote more of their time to worship.\n\nThe Prophet’s (peace be upon him) practice in these 10 nights was to devote all his time to worship, staying up every night, eager to be attending to his worship on the Night of Decree, which falls in one of these 10 nights.\n\nThe Night of Power is a night of great significance, including:\n\n1. It is the night when the Qur’an was bestowed.\n   ‘Indeed, We sent the Qur'an down during the Night of Decree.’ (97:1)\n\n2. On this night, Allah determines everything that takes place in the year ahead:\n   ‘On that night is made distinct every precise matter. [Every] matter [proceeding] from Us. Indeed, We were to send [a messenger].’ (44:4-5)\n   This is a sub-decree because Allah had determined everything more than 50,000 years before creation. However, on this night, Allah determines what happens to His creation during the following year: who will survive and who will die; the saved and the ruined; the happy and the miserable; the powerful and the humiliated. Whatever Allah wishes to happen during the following year is written down on this Night of Decree.\n\n3. It is a blessed night\n   ‘as Allah says\n   ‘Indeed, We sent it down during a blessed night.’ (44:3)\n\n4. Worship on this night is better rewarded than worship over one thousand months:\n   ‘as Allah says\n   ‘The Night of Decree is better than a thousand months.’ (97:1)\n   This means that worship on the Night of Decree is better rewarded than worship for a thousand months without the Night of Decree, which is equal to 83 years and three months.\n\n5. The angel Gabriel and other angels descend with blessings, goodness, and forgiveness on that night,\n   ‘as Allah has stated\n   ‘On that night, the angels and the Spirit, by their Lord’s leave, descend with all His decrees.’ (97:4)\n\n6. The Night of Decree is a night of peace,\n   ‘as Allah says\n   ‘That night is peace, till the break of dawn.’\n   (97:5)\n   It is a night that is free of evil and harm when a great deal of worship and good actions are dedicated to Allah’s pleasure. Hence, it is all peace.\n   ‘Abu Hurayrah reports that the Prophet  (peace be upon him) said\n   ‘Whoever stands in prayer the Night of Decree in worship sincerely dedicating such worship for Allah’s pleasure shall be forgiven their past sins.’\n   Related by al-Bukhari, hadith No. 2,014; Muslim, hadith No. 760"
                }]
            }

        ]
    }, {
        "level": 6,
        "subtopic": [{
                "id": 1,
                "content": [{
                        "id": 1,
                        "name": "Zakat",
                        "content": "Zakat is one of the 5 pillars of Islam. It is a charity duty imposed on a certain threshold of excess money and paid to the poor. It is the most important pillar after testifying that there is no deity than God and prayer.\n\nDefinition:\n\nLinguistically speaking, the Arabic word zakat signifies growth and increase. In Islamic contexts, it refers to a duty imposed on money that exceeds a certain threshold, bound by time, and is payable to specific groups.\n\nStatus:\n\nZakat is an Islamic obligation and one of the five pillars upon which the structure of Islam is built. It is indeed the most important rukn of Islam after prayer.\n\nAllah says\n\n‘Attend regularly to your prayers and pay your zakat.’\n\n(73:20)\n\n‘Take a portion of their money as charity so that you may cleanse and purify them thereby.’\n\n(9:103)\n\nThe Prophet (peace be upon him) says\n\n‘Islam has been built on five pillars: testifying that there is no deity other than Allah worthy of being worshipped and that Muhammad is the Messenger of Allah (peace be upon him), attending to the prayers, paying the zakat, making the pilgrimage to the Sacred House, and fasting in Ramadan.’\n\nRelated by al-Bukhari, hadith No. 8; Muslim, hadith No. 16\n\nWhen the Prophet (peace be upon him) sent his Companion, Mu’adh ibn Jabal as governor of Yemen, he gave him instructions as follows:\n\n‘Call on them to believe and declare that there is no deity other than Allah worthy of being worshipped and that I am Allah’s messenger. If they accept this from you, then inform them that Allah has made it obligatory for them to offer five prayers on every day and night. If they accept this from you, then inform them that Allah has imposed on them a charity duty that will be taken from the rich among them and paid to the poor.’\n\nRelated by al-Bukhari, hadith No. 1,395; Muslim, hadith No. 19.\n\nAll Muslims throughout the world agree that it is a binding duty, and the Prophet’s (peace be upon him) Companions agreed to fight those who rebelled against it."
                    },
                    {
                        "id": 2,
                        "name": "Conditions of Zakat",
                        "content": "Zakat is due on Muslims only but some conditions are to be applied such as; being free, owning more than person’s need from money food and clothes, and in some cases the turn of a full lunar year on a person’s property.\n\nConditions: Zakat is a duty incumbent on those who meet the following conditions:\n\n1-Islam: Zakat is not accepted from unbelievers in Islam because it is a financial worship which brings a Muslim closer to Allah. No worship is acceptable from an unbeliever until he or she embraces Islam.\n\nAllah says\n\n‘What prevents their Charity from being accepted from them is that they have disbelieved in Allah and His Messenger.’\n\n(9:54)\n\n2-Freedom: No zakat is taken from slaves.\n\n3-True and settled ownership of the threshold of zakat in excess of a person’s necessities, such as food, clothes and residence.\n\n4- The turn of a full lunar year after the ownership of the threshold of zakat.\n\nThe Prophet  (peace be upon him) says:\n\n‘No zakat is due on any property until the turn of a year.’\n\nRelated by al-Tirmidhi, hadith No. 632; Ibn Majah, hadith No. 1,792; al-Bayhaqi in Al-Sunan al-Kubra, vol. 4, p. 173\n\nThis condition does not apply to agricultural produce, mineral resources or rikaz. With regard to agricultural produce,\n\n Allah says:\n‘Eat of their fruit when they come to fruition, and give (to the poor) what is due to them on harvest day.’\n\n(6:141)\n\nMineral resources and rikaz are gained from the ground, and as such the condition of the turn of the year does not apply to it"
                    },
                    {
                        "id": 3,
                        "name": "The beneficiaries of zakat",
                        "content": "Zakat is for 8 classes of people; the poor, the needy , the administrative workers , those whose hearts are to be won over, freeing people in bondage, paying debts , travellers in need and for further god causes.\n\nZakat is payable only to those who may benefit by it. These are the eight classes named in the following verse:\n\n‘Zakah expenditures are only for the poor and for the needy, and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of Allah and for the [stranded] traveler - an obligation [imposed] by Allah. And Allah is Knowing and Wise.’\n\n(9:60)\n\nTo give more details about these classes:[1]\n\n1-The poor: A poor person is one who does not have enough to meet his and his dependants’ needs of food, drink, clothes and home. He may have nothing, or may not have enough. He is given what meets his needs for a full year.\n\n2-The needy: A needy person is one who gets half what he needs for living, or even more than half. He is given out of zakat funds what he needs for a year.\n\n3- Administrative workers: This refers to anyone assigned by the Muslim ruler to collect zakat. The ruler gives him what he needs during his travel until he returns, even though he may be rich. This is because such a person devotes his time to this work. The administrative workers include all those who are given the tasks of collecting, recording, safeguarding and distribution of zakat to its rightful beneficiaries. This certainly applied when Muslim governments undertook the collection and distribution of zakat, however, in modern times most, if not all, Muslim governments have abandoned this duty. However, there are many civil and charitable organizations which have taken on this responsibility and undertake this duty. These may deduct from what they collect of zakat money to pay to their staff, who are employed for this task. However, they may not pay zakat money except for their work in the administration of zakat. If a member of staff works only half of his working hours on zakat duties, while the other half is devoted to other aspects of his employment, he may be paid only half his salary out of zakat funds.\n\n4- Those whose hearts are to be won over: These are people who may be unbelievers and they are given money out of zakat to win their goodwill towards Islam, or they may be Muslims but not very strong in faith, or they are people who have non-Muslim relatives who need to be encouraged to look favourably at Islam, or whose help is needed, etc.\n\n5-The freeing of people in bondage: This refers to Muslim slaves who may be bought to give them their freedom. Their price may be paid out of zakat funds. Alternatively, a slave might have agreed a deal to buy his own freedom, and he or she is given what helps them to complete the deal and buy their freedom. This enables slaves to be good members of society, able to conduct their own affairs and to serve Allah’s cause as best as they can. The same applies to pay ransom to free Muslim captives taken by the enemy.\n\n6-Debtors: This applies to a person who has incurred a debt for a legitimate purpose, whether it is for personal reasons or to help others. Debtors are given from the zakat funds what helps them to repay their debts. If someone incurred a debt to pay for the reconciliation of quarrelling parties, he is helped with zakat funds, even though he may be wealthy.\n\n7-To further Allah’s cause: This applies to fighters for Allah’s cause who volunteer to join the Muslim army and they have no salary. They are given money from zakat, even though they may not be in need.\n\n8- The traveller in need:This refers to a traveller who is unable to continue his journey to his place of residence. He may not be able to borrow what he needs, so he is given from zakat what he needs for his journey home.\n\nThis certainly applied when Muslim governments undertook the collection and distribution of zakat, however, in modern times most, if not all, Muslim governments have abandoned this duty. However, there are many civil and charitable organizations which have taken on this responsibility and undertake this duty. These may deduct from what they collect of zakat money to pay to their staff, who are employed for this task. However, they may not pay zakat money except for their work in the administration of zakat. If a member of staff works only half of his working hours on zakat duties, while the other half is devoted to other aspects of his employment, he may be paid only half his salary out of zakat funds."
                    },
                    {
                        "id": 4,
                        "content": [{
                            "id": 1,
                            "name": "Zakat may not be given to",
                            "content": "Zakat isn't a must in 6 classes of people; those who can earn their living, offspring, wives, ancestors, unbelievers, prophet's descendants, and slaves. It isn't necessary to satisfy the 8 zakat deservers.\n\n1-People in money and those able to earn their living:\n: The Prophet (peace be upon him) said\n‘There is no share in zakat for anyone who has plenty or who is able to earn his living.’\nRelated by Ahmad, vol. 5, p. 362; Abu Dawud, hadith No. 1,633; al-Nassa’i, vol. 5, p. 99\nHowever, a person with sufficient means, or a rich person, may be given out of zakat if they qualify as zakat administrators or debtors. Likewise, the one who is able to earn one’s living may be given zakat money if he is studying full time, provided that he studies either Islamic studies or a discipline needed by the Muslim community."
                        }]
                    }

                ]
            },
            {
                "id": 2,
                "content": [{
                    "id": 1,
                    "name": "Denying zakat",
                    "content": "If a Muslim denies zakat and he is fully aware of Islamic rules and has access to scholars he is considered as an apostate. Only those who are new to Islam or have valid reason are not deemed to be unbelievers. Anyone who denies the duty of zakat, such a person is considered an apostate, and the rulings of apostasy apply to him."
                }]
            },
            {
                "id": 3,
                "content": [{
                    "id": 1,
                    "name": "Withholding zakat",
                    "content": "Withholding zakat is a grave sin but it does not mean that the person is an unbeliever. They are liable to punishment and zakat could be taken from them by force until they submit to God’s commands. A person who does not pay zakat out of greed, while recognizing that it is obligatory, commits a grave sin but is not considered an unbeliever. Zakat is an aspect of faith, but its non-fulfilment does not take a person out of the faith. In reference to the one who withholds zakat, the Prophet (peace be upon him) said: ‘He will then take his way, either to heaven or to hell.’ Related by Muslim, hadith No. 987 The possibility that he may go to heaven means that he is not an unbeliever. Such a person is liable to punishment and zakat is taken from him by force. If he fights to withhold it, he is fought until he submits to Allah’s command and pays his zakat. Allah says: ‘Yet if they should repent, establish prayer and pay the zakat, let them go their way. For Allah is Forgiving and Merciful.’ (9:5) Abu Bakr said: ‘By Allah, if they deny to pay out a young goat, less than a year old, which they used to pay to Allah’s messenger, I would fight them for it.’ Related by al-Bukhari, hadith No. 1,400; Muslim, hadith No. 20"
                }]
            },
            {
                "id": 4,
                "content": [{
                    "id": 1,
                    "name": "Properties liable to zakat",
                    "content": "Zakat is paid on 5 types of properties; cattle, gold and silver, commercial goods, grains and fruits and mineral resources. Each has its conditions. Those who neglect paying it are promised a painful suffering. Zakat is payable on five types of property: 1-Cattle, including camels, cows and sheep: Abu Hurayrah reports that the Prophet (peace be upon him) said ‘Any owner of camels, cows or sheep who does not pay out their dues shall be made to sit at the bottom of Qarqar Valley on the Day of Judgement when the hoofed animals will step over him and the horned ones will hit him with their horns.’ Related by Muslim, hadith No. 988 2-Gold and silver, and what takes their role (such as currency): Allah says in the Qur’an ‘To those who hoard up gold and silver and do not spend them in Allah’s cause, give the news of a painful suffering.’ (9:34) The Prophet (peace be upon him) says ‘Anyone who owns gold or silver but does not pay out their dues shall come on the Day of Judgement when plates of fire shall be made ready for him, and they will be heated in hell then his forehead, side and back shall be branded with them. When they cool down, they will be reheated. That day is as long as 50 thousand years.’ Related by Muslim, hadith No. 987 3-Commercial goods: These include everything offered for sale for profit. Allah says ‘Believers, spend on others out of the good things you have earned.’ (2:267) Scholars generally agree that this Qur’anic statement refers to commercial goods. 4-Grains and fruits: Grains include every type of grain that is edible and can be stored, such as wheat, barley, corn, etc. Fruits refer to dates and raisins. Allah says ‘Believers, spend on others out of the good things you have earned, and out of that which We bring forth for you from the earth.’ (2:267) The Prophet (peace be upon him) says ‘For whatever is irrigated by rain and springs, or needs no irrigation, a zakat duty of one tenth (i.e. 10 %) is payable, and for whatever is irrigated by camels, the zakat duty is half of one tenth -i.e. 5 %.’ Related by al-Bukhari, hadith No. 1,483 Under that which is ‘irrigated by camels’ we may include whatever is irrigated by labour and machines. The point of difference is the cost involved in irrigating the second type. 5-Mineral resources and rikaz, or what was buried in the ground by people of past generations: The basis of making zakat payable for these resources is the same verse as for fruits and grains: ‘Believers, spend on others out of the good things you have earned, and out of that which We bring forth for you from the earth.’ (2:267) The Prophet (peace be upon him) says: ‘A duty of one fifth (i.e. 20%) is payable for rikaz.’ Related by al-Bukhari, hadith No. 1,499; Muslim, hadith No. 1,710 Scholars are generally agreed that zakat is payable for mineral resources"
                }]
            },
            {
                "id": 5,
                "content": [{
                        "id": 1,
                        "name": "Social effects of zakat",
                        "content": "Zakat has numerous social effects. It erases zakat payer sins, purifies his heart from any greed and removes any traces of miserliness. It also spreads a spirit of mutual care and love within the Muslim community. Zakat has very important objectives and yields numerous benefits, such as: 1-Blessing one’s money, purging it of stigma and protecting it against negative influences. 2-Removing traces of greed and miserliness from the heart of the zakat payer. It erases his sins and trains him to give generously for Allah’s cause. 3-Looking after the poor and the needy and helping the deprived. 4-Spreading an atmosphere of mutual love and care within the Muslim community. 5-Giving thanks to Allah for giving us more than we need for our living. 6-It is a demonstration of true belief in Allah. 7-It earns Allah’s pleasure and leads to bestowing more of Allah’s grace and blessings."
                    },
                    {
                        "id": 2,
                        "name": "Economic benefits of zakat",
                        "content": "Zakat has a huge positive economic effect on the society. It helps solving poor and needy problems. It plays a significant role in wealth and resources redistribution and encourages better productivity. 1-It plays a very important role in the redistribution of wealth and income. 2-It goes a long way in solving the problems of the poor and the needy. 3-It is instrumental in the redistribution of resources among the different areas of investment and consumption. 4-It encourages better productivity and greater consumption."
                    }
                ]
            },
            {
                "id": 6,
                "content": [{
                    "id": 1,
                    "name": "Zakat due on loans",
                    "content": "Zakat due on loans differs according to the state of the borrower. If his is not able to pay; then the lender has to pay it just for one year. But in case he can repay it, the lender has to pay zakat for all the period. If the borrower is facing hardship and cannot repay the debt, the lender pays zakat for the loan once it is repaid. If it had been with the borrower for several years, the lender pays its zakat for one year only. On the other hand, if the loan is given to someone who has money and is able to repay it, its zakat is due on the lender every year, because financial instruments being with someone able to repay them is like its being with the lender."
                }]
            },
            {
                "id": 7,
                "content": [{
                    "id": 1,
                    "name": "Zakat on gold and silver",
                    "content": "Zakat must be paid on gold and silver. An amount of 2.5 percent is required to be paid but there are some conditions that should be met like; ownership of the threshold, full ownership and the turn of a year. Zakat is payable on gold and silver, which were the standard currencies for long periods of history, as Allah says ‘To those who hoard up gold and silver and do not spend them in Allah’s cause, give the news of a painful suffering.’ (9:34) Needless to say, such warnings are given only in the case of neglecting a duty. As we noted, the Prophet (peace be upon him) says: ‘Anyone who owns gold or silver but does not pay out their dues shall come on the Day of Judgement when plates of fire shall be made ready for him, and they will be heated in hell then his forehead, side and back shall be branded with them. When they cool down, they will be reheated. That day is as long as 50 thousand years, until Allah has judged between His servants.’ Furthermore, scholars are unanimous that if one owns 200 dirhams (i.e. the silver currency), he pays five dirhams annually in zakat, and if one owns 20 weights or dinars (i.e. gold currency), then zakat is payable on that gold. What is due on gold and silver The zakat payable on gold and silver is 2.5 %, which means that for 20 dinars (a dinar was the gold currency) half a dinar is payable. For any little or great amount above that the same rate of 2.5 % applies. Likewise, for 200 dirhams of silver five dirhams are payable, and for any greater amount the same rate applies. The Prophet (peace be upon him) says: ‘On silver the payable zakat is a quarter of one tenth.’ Related by al-Bukhari, hadith No. 1,454. Conditions for the zakat obligation to apply For zakat to be payable on gold and silver, the following conditions must apply: 1-Ownership of the threshold of zakat, which is 20 weights or dinars of gold. The hadith reported by ' Ali quotes the Prophet (peace be upon him) as saying ‘In the case of gold, you have nothing to pay until you own 20 dinars. If you have 20 dinars and you have had it for a year, the duty is to pay half a dinar.’ Related by Abu Dawud, hadith No. 1,573 and this threshold is estimated to be equivalent to 85 grams. The threshold for silver is 200 dirhams, as the Prophet (peace be upon him) said ‘No zakat is due on any amount less than five ounces.’ Related by Abu Dawud, Book 9, hadith No. 3 and the ounce is equal to 40 dirhams. Thus the threshold is equivalent to 200 dirhams., which is equivalent now to 595 grams of silver. The Prophet (peace be upon him) says: ‘On silver the payable zakat is a quarter of one tenth. If one has only 199 dirhams, then no duty is payable.’ 2- The passing of one lunar year with the gold or silver in possession of a Muslim. If a person has the threshold of gold or silver for less than one year, there is no zakat on it. Combining gold and silver The weightier view is that gold and silver are not counted together in calculating the threshold of zakat because they are two different kinds of precious metals. Therefore, they are treated like different kinds of other possessions, such as in the case of camels and cows, or barley and wheat."
                }]
            },
            {
                "id": 8,
                "content": [{
                    "id": 1,
                    "name": "Zakat on jewellery",
                    "content": "Scholars agree that Zakat is due on jewelry kept as savings. But they differ in their view on jewelry kept for permissible use. As a conclusion, zakat is not due on usable jewelry if it is within reasonable limits. There is no zakat on jewlery other than gold and silver. This means that there is no zakat on precious stones such as rubies or diamonds, regardless of their market value. Zakat is due only on gold and silver. ‘A woman came to see Allah’s messenger with her daughter, and the girl had two thick gold bracelets. The Prophet (peace be upon him) asked her “Do you pay zakat for these?” She said: “No.” He said: “Will you be pleased if God gives you for them two bracelets made of fire on the Day of Judgement?” She took them off and gave them to the Prophet (peace be upon him)” Related by Ahmad, vol. 11, p. 248; Abu Dawud, hadith No. 1,563; al-Tirmidhi, hadith No. 637; al-Nassa’i, vol. 5, p. 38; al-Bayhaqi, vol. 4, p. 140 This hadith is definitive on this question and is supported by another hadith in authentic anthologies. Some scholars have discussed at length the difference of opinion among scholars on this issue, arriving at the following conclusions: 1-Zakat is payable on jewellery kept as savings or for investment. The same applies to jewellery kept for personal use if the use is forbidden, such as gold and silver plates and cutlery, or gold jewellery for men, or women’s jewellery that is clearly excessive. 2-Zakat is not payable on jewellery kept for permissible use, such as women’s jewellery – within reasonable limits – and a man’s silver ring, as it cannot grow. Moreover, it is an article of personal need, like one’s clothes and furniture. 3-The same applies to permissible jewellery owned by a woman who wears or lends it freely, or is owned by a man for his family’s use or who lends it. 4-Jewellery and other gold and silver articles that are liable to zakat pay 2.5% annually in zakat, together with the person’s other property, if any. 5-It is a condition for zakat payable on such jewellery that the jewellery is, in itself or together with the person’s other zakatable property, above the threshold of zakat, i.e. 85 grams of gold. In arriving at this figure, the value is considered, not the weight, because there is an added value for the manufacture of the jewellery"
                }]
            },
            {
                "id": 9,
                "content": [{
                    "id": 1,
                    "name": "Commercial commodities",
                    "content": "Commercial commodities refer to everything a Muslim owns and uses for trade. They should be owned by personal action for the intention of trading and their value must be equal to or exceed Zakat threshold. This refers to everything, of whatever type, a Muslim prepares for trading. It is the largest and most comprehensive type of property liable to zakat. These are kept for business that aims to make a profit. Zakat is payable on all such commodities, as the generally phrased Qur’anic statement indicates, 'They would give a rightful share of their possessions to the one who asks [for help] and the one who is deprived' (51:19) 'Believers, spend on others out of the good things you have earned' (2:267). The Prophet (peace be upon him) said to Mu’adh ibn Jabal when he was about to leave to take up his post as governor of Yemen: 'Inform them that Allah has imposed on them a zakat duty that is taken from their wealthy and given to their poor.' Related by al-Bukhari, hadith No. 1395. Undoubtedly, commercial commodities represent money and are possessions. Conditions applicable to commercial commodities: 1- Their ownership. 2- They should be owned with the intention of trading. If a person inherits and sells what he inherited, there is no zakat on it as he sold it to get rid of it and not to invest it again. If he sold it to reinvest it again, this means he has to begin calculating zakat from the moment his intention changed to trading. 3- Their value should be equivalent to, or more than, the threshold of zakat. 4- The turn of a lunar year over the commercial commodities and their price. Usually, this is marked by the beginning date of such trading. On that particular day, the trader calculates the value of the merchandise in addition to the cash he has and gives 2.5% as zakat. Moreover, the five conditions we have mentioned at the beginning of this chapter also apply to commercial commodities. When a year has turned, their value is estimated. If their total value is more than the threshold of zakat, a duty of 2.5 percent is payable in zakat. In calculating the value of commercial commodities, the purchase price is not taken into account. They should be valued at the time when zakat is payable, i.e. at the turn of a year, because the value of any commercial goods may vary from time to time."
                }]
            },
            {
                "id": 10,
                "content": [{
                    "id": 1,
                    "name": "What the earth produces",
                    "content": "Zakat is obligatory on what the earth produces; grains which are fully grown, can be eaten, stored and meeting the threshold. Rikaz, which is gold or silver, and minerals, which is agreed to be anything coming from earth. Zakat is payable on what is produced from the earth, as is clearly stated in the Qur’anic verse: 'Believers, spend on others out of the good things you have earned, and out of that which We bring forth for you from the earth' (2:267). Zakat becomes due when grains are fully grown, and in other types when they appear to be good and may be eaten. On such produce, the condition of the turn of the year does not apply, because Allah says, 'Give (to the poor) what is due to them on harvest day' (6:141). Zakat is payable on all kinds of produce that are measured by volume and can be stored, such as wheat, barley, corn, rice, dates, raisins, etc. It is not due on fruits and vegetables because the Prophet (peace be upon him) mentioned packing as a criterion and storage, which fits with the general perspective of zakat.[1]. Fruits, vegetables, and other agricultural produce that are prepared for immediate sale are liable to zakat not as products of earth but as commercial goods. Conditions: Two conditions should be met to make zakat payable for agricultural produce: 1- The produce should be equivalent to or more than the threshold, which is five measures defined by the Prophet (peace be upon him). This is equivalent in our present-day measures to 612 kilograms of grain. The Prophet (peace be upon him) says, 'No zakat is due for what is less than five wisqs' Related by al-Bukhari, hadith No. 1,405; Muslim, hadith No. 979. A wisq is a volume measure estimated to be equal to 122 kilograms. 2- The owner should own the threshold of zakat at the time when zakat is due. The amount payable for agricultural produce that is irrigated without cost, such as that irrigated by rain or natural springs, the zakat duty is 10 percent, while if irrigation depends on labor and machines, the duty is 5 percent. This is based on the hadith that says, 'For what is irrigated by rain, rivers and springs, or does not need irrigation, the zakat is one-tenth, and for what is irrigated by camels, the zakat is half of one-tenth.' Related by al-Bukhari, hadith No. 1,483; Abu Dawud, hadith No. 1,696. Honey: The majority of scholars are of the view that no zakat is payable for honey. This appears to be the case because there is no clear statement in the Qur’an or the Sunnah mentioning it. The rule is that unless there is evidence to state an obligation, then no obligation exists. Imam al-Shafi'i said: 'The hadith that mentions that one-tenth is levied on honey is poor in authenticity, as is the other report, except for what is mentioned by 'Umar ibn 'Abd al-'Aziz. My view is that no zakat is payable for honey. There are confirmed reports and hadiths stating the types that are liable to zakat, but we have no confirmed report concerning honey. This suggests that it is not required. Ibn al-Mundhir said: 'There is no report that stands to proper examination concerning the payment of zakat on honey.[2]. Zakat on rikaz: Rikaz refers to whatever is found of gold, silver, or anything else that bears the sign of the Islamic era which was buried by unbelievers and does not require much labor or great expense to recover. If it requires expense and labor to recover, then it is not rikaz.[3] One fifth of it, whatever the quantity, is paid as zakat. The conditions of meeting the threshold of zakat and the turn of the year do not apply to rikaz. The Prophet’s (peace be upon him) hadith is very general, as he says, 'One fifth is due on rikaz' Related by al-Bukhari, hadith No. 1,499; Muslim, hadith No. 1,710. Rikaz is used to pay for the national interests of the Muslim community and those who are newly converted to Islam, or those whose hearts are to be reconciled, as we shall explain later. Zakat on minerals: Zakat is due on all types of minerals. The amount payable is one fifth, whatever the mineral might be. The fact that zakat is due on minerals is confirmed by the Qur’an and the Sunnah. Gold and silver, as well as other minerals, are mentioned in the Qur’an: 'Those who hoard gold and silver and do not spend them in Allah’s cause should know that a painful punishment awaits them' (9:34) The Prophet (peace be upon him) said: 'Allah has imposed a zakat duty on minerals: one-fifth of what is extracted.' Related by Ahmad, al-Bukhari, and Muslim. "
                }]
            },
            {
                "id": 11,
                "content": [{
                    "id": 1,
                    "name": "An'aam animals",
                    "content": "Zakat is obligatory on four types of an'aam animals: camels, cows, sheep, and goats. Camels: A Muslim who possesses camels is liable to pay zakat on them if they are kept for the purpose of breeding and milk, and not for carrying burdens. A specific number is fixed as the threshold, which is five camels. If the number is five or more, zakat is payable on them, unless they are kept purely for carrying burdens. In that case, no zakat is due on them. This is based on the hadith of the Prophet (peace be upon him): 'There is no zakat on less than five camels unless they are kept for breeding or milk.' Related by al-Bukhari, hadith No. 1,478; Abu Dawud, hadith No. 1,685; al-Tirmidhi, hadith No. 606. The amounts payable for zakat are fixed and increase with the number of camels. Cows: The threshold for cows is thirty. If a Muslim possesses thirty cows, one year old or more, one cow is due as zakat. If the number reaches forty, one cow in addition is due for zakat. If the number reaches fifty, two cows are due for zakat. The same rule applies to higher numbers, one cow being added for each additional ten cows. This is based on the Prophet’s (peace be upon him) hadith: 'There is no zakat on less than thirty cows. If the number reaches thirty, one cow is due as zakat.' Related by al-Bukhari, hadith No. 2,729; Muslim, hadith No. 984. Sheep: The threshold for sheep is forty. If a Muslim possesses forty sheep, one year old or more, one sheep is due as zakat. If the number reaches one hundred and twenty, an additional two sheep are due for zakat. If the number reaches two hundred, three sheep are due for zakat. The same rule applies to higher numbers, one sheep being added for each additional forty sheep. This is based on the hadith of the Prophet (peace be upon him): 'There is no zakat on less than forty sheep. If the number reaches forty, one sheep is due for zakat.' Related by Abu Dawud, hadith No. 1,680; al-Tirmidhi, hadith No. 632. Goats: The threshold for goats is forty. If a Muslim possesses forty goats, one year old or more, one goat is due as zakat. If the number reaches one hundred and twenty, an additional two goats are due for zakat. If the number reaches two hundred, three goats are due for zakat. The same rule applies to higher numbers, one goat being added for each additional forty goats. This is based on the hadith of the Prophet (peace be upon him): 'There is no zakat on less than forty goats. If the number reaches forty, one goat is due for zakat.' Related by al-Bukhari, hadith No. 1,774; Abu Dawud, hadith No. 1,681; Muslim, hadith No. 1,998. The animals mentioned in these hadiths are the an'aam animals, i.e. camels, cows, sheep, and goats. The Prophet (peace be upon him) is very clear about this in his sayings. Conditions: Two conditions should be met for zakat to be payable on an'aam animals: 1- The threshold should be reached, i.e. five camels, thirty cows, forty sheep or forty goats. 2- They should graze on pasture, which means that they graze on what grows in the earth naturally, such as pasture, plants and the like, without any cost to the owner. If they are fed with fodder or graze on someone else’s land, no zakat is payable on them. This is based on the Prophet’s (peace be upon him) hadith: 'No zakat is due on an'aam animals fed with fodder, nor if they graze on other people’s land, nor if they are put on land belonging to other people.' Related by Abu Dawud, hadith No. 1,696; al-Tirmidhi, hadith No. 632."
                }]
            },
            {
                "id": 12,
                "content": [{
                    "id": 1,
                    "name": "Zakat al-Fitr",
                    "content": "Zakat al-Fitr is due after the month of Ramadan is over. Each Muslim must pay it on his behalf and for those whom he is duty bound to support. How it is paid, to whom, the amount and the time are all explained below.\n\nThis zakat is given its name because it becomes due when the month of Ramadan is over. It is not levied on property, but on heads and people. [1]\n\nRuling: Zakat al-Fitr is a duty incumbent on every Muslim. Ibn 'Umar reports: ‘Allah’s messenger made the Zakat al-Fitr, a sa' [2] of dates or barley, binding on every Muslim: slave or free, male or female, young or old.’[3]\n\nConditions: Zakat al-Fitr is a duty that applies to all Muslims, whether they are young or old, male or female, as clearly stated in the hadith quoted above. It is also recommended to be paid for the unborn embryo if the pregnancy is past four months. People in the early period of Islam used to do so, as authentically reported to have been done by 'Uthman and others.\n\nEvery Muslim must pay it on his own behalf and on behalf of those whom he is duty bound to support, such as his wife and offspring. In the days of slavery, a master had to pay it for his slave. The Prophet (peace be upon him) said: ‘No zakat is payable on slaves except the Zakat al-Fitr.’[4] As a duty, Zakat al-Fitr applies to everyone who has more than what he needs for his food and the food of his dependants for the day and the night of the Eid. If one has in excess of that, which is enough to pay this zakat, then one must pay it.[5] This means that there are two conditions for this zakat to be payable: 1) Islam. It is not paid by non-Muslims; and 2) having more than one needs for his essential needs for the day and night of the Eid.\n\nPurpose: Zakat al-Fitr is made a duty as a condition to ensure a number of great benefits,[6] such as:\n\n1-It is a spiritual purification for the person who has completed the fasting in Ramadan. He might have slipped on occasions, committing some unintended errors.\n\n2-It enables the poor and the needy to enjoy the Eid without having to ask anyone for food. They share the delight that the Eid brings to all people in the community. Ibn 'Abbas said: ‘Allah’s messenger stipulated Zakat al-Fitr as purification for the fasting person from any frivolous talk or obscenity and as a food for the needy.’[7]\n\n3-It is a demonstration of gratitude to Allah for enabling us to fast during the month of Ramadan and to offer night worship and do other good works in a totally blessed month.\n\nWhat and how much\n\nThe amount due is four times the fill of a man’s cupped hands of wheat, barley, dates, raisins, dried yogurt, rice, corn, etc. which should be a staple food of one’s community. This is well established in a number of authentic hadiths, such as the one quoted above by Ibn 'Umar. A group of people may give their Zakat al-Fitr to one person, and one person may give his to a group.\n\nPayment of the price of the food is not an appropriate alternative to giving the food itself, because paying the price is contrary to what the Prophet (peace be upon him) ordered and to the practice of the Prophet’s (peace be upon him) Companions. They used to pay it in kind. Moreover, Zakat al-Fitr is an act of worship required to be fulfilled with food, and it is wrong to give it in any different form.[8]\n\nThis is the view of Malik, al-Shafi'i, Ahmad ibn Hanbal, Ibn Hazm and others. The Hanafi school of Fiqh and al-Thawri say that it is appropriate to pay the price of the same quantity of food. This is also reported to be the view of 'Umar ibn 'Abd al-'Aziz and al-Hasan al-Basri.\n\nThe scholars have discussed this point at length, Though ‘the permissibility of paying Zakat al-Fitr in value, rather than in kind, is indicated in the hadith that quotes the Prophet (peace be upon him): “Make them [i.e. the poor] self-sufficient on this day”, and this is fulfilled by paying the value as well as by giving food. it is best if possible to follow the Sunnah exactly by giving it as food. While this is easier and more feasible in our present time, particularly in industrial areas where people conduct all their transactions in money, the issue is not one of convenience. In many modern societies, the giving of wheat or dates may not be welcomed as this is not the staple used in their home. It appearsthat the Prophet (peace be upon him) stated that Zakat al-Fitr is paid in food for two reasons: 1) money was scarce among the Arabs at the time, which made it easier to give their zakat in kind; and 2) the purchase power of money differs from time to time, while a quantity of food meets a certain human need. During the Prophet’s time, food was easier to give and better for the person in need. If we can do the same without worrying that the food will be unwelcome or otherwise not useful for the person in question, that is certainly best. If we have doubts though, and find that the money will be more useful and welcome to the poor person, there should be no harm in giving it in value rather than in kind’[9]\n\nSome scholars of the Hanafi school of Fiqh say that it is better to give Zakat al-Fitr in kind at all times, because this complies with the Sunnah. Others give more details, saying that in times of hardship and scarcity of food it is better to pay this zakat in kind, but in times of plenty, paying it in money is better because it is more helpful to the poor.\n\nTime\n\nZakat al-Fitr becomes due when the sun has set on the last day of Ramadan, because this is what signals the end of the fast. The time to pay it is divided into two parts: the preferable one and the acceptable one. The preferable time is from the break of dawn on the Eid day until shortly before the Eid prayer. This is based on the hadith reported by Ibn 'Umar: ‘The Prophet (peace be upon him) ordered that the Zakat al-Fitr should be paid out before people go out to offer the Eid prayer.’[10] The acceptable time is one or two days before the Eid, as Ibn 'Umar and other Companions of the Prophet (peace be upon him) did that.\n\nIt may not be delayed until after the Eid prayer has been offered. If it is so delayed, it counts as an ordinary charity, and the person delaying payment is deemed to have committed an offence. The Prophet (peace be upon him) said: ‘For whoever pays it before the prayer, it is well and accepted, and for the one who pays it after the prayer, it counts as an ordinary charity.’[11] This type of zakat must be given only to the poor and needy.\n\nThe beneficiaries of zakat\n\nZakat is payable only to those who may benefit by it. These are the eight classes named in the following verse:\n\n‘Zakah expenditures are only for the poor and for the needy, and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of Allah and for the [stranded] traveler - an obligation [imposed] by Allah. And Allah is Knowing and Wise.’\n\n(9:60)\n\nTo give more details about these classes:[12]\n\n1-The poor: A poor person is one who does not have enough to meet his and his dependants’ needs of food, drink, clothes and home. He may have nothing, or may not have enough. He is given what meets his needs for a full year.\n\n2-The needy: A needy person is one who gets half what he needs for living, or even more than half. He is given out of zakat funds what he needs for a year.\n\n3-Administrative workers: This refers to anyone assigned by the Muslim ruler to collect zakat. The ruler gives him what he needs during his travel until he returns, even though he may be rich. This is because such a person devotes his time to this work. The administrative workers include all those who are given the tasks of collecting, recording, safeguarding and distribution of zakat to its rightful beneficiaries.\n\nThis certainly applied when Muslim governments undertook the collection and distribution of zakat, however, in modern times most, if not all, Muslim governments have abandoned this duty. However, there are many civil and charitable organizations which have taken on this responsibility and undertake this duty. These may deduct from what they collect of zakat money to pay to their staff, who are employed for this task. However, they may not pay zakat money except for their work in the administration of zakat. If a member of staff works only half of his working hours on zakat duties, while the other half is devoted to other aspects of his employment, he may be paid only half his salary out of zakat funds.\n\n4-Those whose hearts are to be won over: These are people who may be unbelievers and they are given money out of zakat to win their goodwill towards Islam, or they may be Muslims but not very strong in faith, or they are people who have non-Muslim relatives who need to be encouraged to look favourably at Islam, or whose help is needed, etc.\n\n5-The freeing of people in bondage: This refers to Muslim slaves who may be bought to give them their freedom. Their price may be paid out of zakat funds. Alternatively, a slave might have agreed a deal to buy his own freedom, and he or she is given what helps them to complete the deal and buy their freedom. This enables slaves to be good members of society, able to conduct their own affairs and to serve Allah’s cause as best as they can. The same applies to pay ransom to free Muslim captives taken by the enemy.\n\n6-Debtors: This applies to a person who has incurred a debt for a legitimate purpose, whether it is for personal reasons or to help others. Debtors are given from the zakat funds what helps them to repay their debts. If someone incurred a debt to pay for the reconciliation of quarrelling parties, he is helped with zakat funds, even though he may be wealthy.\n\n7-To further Allah’s cause: This applies to fighters for Allah’s cause who volunteer to join the Muslim army and they have no salary. They are given money from zakat, even though they may not be in need.\n\n8-The traveller in need: This refers to a traveller who is unable to continue his journey to his place of residence. He may not be able to borrow what he needs, so he is given from zakat what he needs for his journey home.\n"
                }]
            },
            {
                "id": 13,
                "content": [{
                    "id": 1,
                    "name": "The transfer of zakat to a different town",
                    "content": "Zakat is payable for the poor and needy wherever they are. It is permissible to transfer zakat to another town. It is also encouraged to pay it to poor relatives as it gives one the advantage of kindness to relatives.\n\nIt is permissible to transfer zakat from the town of the payer to a near or distant town when this is needed. The distant town may be poorer than the town where the payer lives, or he may have poor relatives in a distant place. To pay one’s zakat to one’s relatives gives one the advantage of kindness to relatives, which is strongly encouraged by Islam. This is the correct view, because the verse defining the eight classes of beneficiaries is general in its import:\n\n‘Zakah expenditures are only for the poor and  for the needy....’ (9:60)"
                }]
            }

        ]
    }
]