{
    "name": "Fathu Bahri",
    "subhead": "Supplication with Ayatil-Kurisiyyi",
    "author": "Fadhilat Shaykh Muh. Robiu Adebayo Abdul Malik R.T.A Al-Ilory",
    "content": [{
            "id": 1,
            "name": "To ALLAH belong the most Beautiful Names so call him by them (AL-AHRAAF) V 80 \n He is ALLAH beside whom there is La Ilaha Ila Huwa (none has the right to be worshipped but Him)",
            "content": [{
                    "id": 1,
                    "transliteration": "BADA'TU BISIMIL-LAHI ROBIYA RAMAANI WALAYSA LAHU BADIUN WALAYSALAHU THANINI ",
                    "translation": "I begin With the name of ALLAH; My God and my Beneficent Who has no beginning Nor an associate. "
                },
                {
                    "id": 2,
                    "transliteration": "WA BA'DU SOLAATUL-LAHI THUMMO SALAAMUHU ALAMAN LAHU KHULQUN JAMEELUN BI IHISAANI",
                    "translation": "I beseech ALLAH To Bestow His blessings And peace Upon (Mohammed) Who has the exalted Standard of character."
                },
                {
                    "id": 3,
                    "transliteration": "HUWAL-LAHU YA MON LM ILAAHA SIW AAHU HAY HUWAL-LAHU YA MANHU MUKAWWINU AKIWAANI",
                    "translation": "O ALLAH Than whom there is no other God; 0 ALLAH Who created The Creations"
                },
                {
                    "id": 4,
                    "transliteration": "HUWAL-LAHU ROBBUL-KHALIQI YAA MONI HUWA HU HUWAL-LAHU HAQON WAHUWA ROBI WARAMAANI 0 ALLAH;",
                    "translation": "O ALLAH; The God of the World! You are called HE You are The Only HE HE is ALLAH Truly; HE is my God; HE is my Benefactor "
                },
                {
                    "id": 5,
                    "transliteration": "SHAHIDITU BI ANNAL-LAHA FARIDUN WAKHALIQUN FASUBUHANO ROBIL ARISHI QOD JALA Fl SHANIN",
                    "translation": "I bear ALLAH is One And He is The Creator Glory be to ALLAH: God of the Throne; He is so exalted In all affairs "
                },
                {
                    "id": 6,
                    "transliteration": "SA'ALTUKA YA RAHAMAANU AMNAN WA RAHMOTAN WAGUFURA NAKALGALY BILUFIN WARID WANIN",
                    "translation": "I beseech You, 0 the most Compassionate, To secure and bless me. I seek Your highly regarded Forgiveness: Give me Your Grace And Pleasure "
                },
                {
                    "id": 7,
                    "transliteration": "ALA FARIHAM1N AYAA MALI AA YAA ROHEEMU WAKUN LANAA KA MOLL1KINA MAMALIKAAKIWAANI",
                    "translation": "O ALLAH, The Merciful Bless us; O King of all Kingdoms! Exalt our position"
                },
                {
                    "id": 8,
                    "transliteration": "AYAA ROBBI YAA QUDDUUSU QODD1S WATOHHIR LANAL-ARWAHAJINNA WA NUFUUSANAA RAOHANY ",
                    "translation": "O ALLAH, The Holy God! O The Holy Purify our hearts Cleanse our souls Of devil's whispering And give us rest of mind"
                },
                {
                    "id": 10,
                    "transliteration": "AYAA MUMINANI AAM1N LANA KULLA RAWHATIN WAMIN FITNATIL-AGIYARPUDHINA WASHAYTONI",
                    "translation": "O ALLAH, The Giver of Security, Secure us against Fear and troubles Of the jealous. "
                },
                {
                    "id": 11,
                    "transliteration": "LAKAD-DEENU WAD-DUNIYA MUHAYMINU RABBANA FAMOKIN LANA IZZAN WA-AMUNANA BI IMUKAANI ",
                    "translation": "You own the religion (of Islam) O ALLAH, The Watcher over His creature! O our God! Give us honour and protection. "
                },
                {
                    "id": 12,
                    "transliteration": "LAKAL-'IZZU TURRAN YAA 'AZZEZU AIZZANAA BI IZZIKA IZZAN KAASIRAN SULLAAOTHAANI ",
                    "translation": "You own all sorts of might 0 the Almighty! Promote me with Your Might And empower me To destroy all kinds of idols. "
                },
                {
                    "id": 13,
                    "transliteration": "AYAA ROBBI YAAJABBAARU JAJBIR KUSUURANAA WAKHUDH KULA MON YATGAALAYNA BI UDIWANI ",
                    "translation": "O God who compels! Repair our loss And destroy the wicked who act against us Out of enormity. "
                },
                {
                    "id": 14,
                    "transliteration": "WADHALLIL ILAAHI KULLA MON YATAKABBARU WAAYYID LANAL-ISLAAMA Fl KULLIBULDAANI ",
                    "translation": "O my Lord! Humiliate the arrogant And help Islam All over the world "
                },
                {
                    "id": 15,
                    "transliteration": "WAYA KHALIQOL-ARIWAAHI BIL-AMURI KULL1HA WASALLIM MINAL-AMRAADIAJISAAMO WILDANI",
                    "translation": "O ALLAH! You created the souls by Your command! Heal our offspring Of all ailments. "
                },
                {
                    "id": 16,
                    "transliteration": "AYAA BAARIAL-AJSAADI ANTA MUSOWWIRUN WAZAYYIN QULUBAL-MUSILIMEENA BI QUR'AN!",
                    "translation": "O ALLAH! The Creator of all bodies! You are The Bestower of forms Who created the creation in Various forms and colours! Refine the hearts of the Muslims With the Qur'an."
                },
                {
                    "id": 17,
                    "transliteration": "AGAFFAARU FAGFIRLY JAMEEA KHATEEATY ARM UZIMO DHAMBI ANNAHU MITHLU TUFANI",
                    "translation": "O ALLAH, (The All-forgiving) Forgive me all my sins: To me, my sins Are like the flood of 'TUUFAN'"
                },
                {
                    "id": 18,
                    "transliteration": "BIQOHREKA YA QOHHAARU FAQHAR ADUWWANAA WADAMIR SARI'AN AHALA KHASMI WATUGIYANI ",
                    "translation": "The Almighty, and The Subduer! Subdue our foes And destroy the adversary and transgressors in time. "
                },
                {
                    "id": 19,
                    "transliteration": "WAHAB LY AYA WAHHAABU ILIMAN WARAHAMOTAN WATHABBIT LANAL-AQDAAMO FI-KULLI AZIMOONI",
                    "translation": "O ALLAH, The Bestower! Give us Much knowledge and mercy, And Made us steadfast at all time. "
                },
                {
                    "id": 20,
                    "transliteration": "WAZIDNAA ILAAHI MIN LADUNKA MOWAAHIBAN FAIN-NAKA WAHAABUL-KHATOOYAA BI FAYDOONI",
                    "translation": "O our Lord! Give us Your charitable gifts For You are The Bestower Who gives in abundance! "
                },
                {
                    "id": 21,
                    "transliteration": "AYAAA ROBBI YAA RAZZAAQU FARZUQ JAMEE'ANAA BI HAQQEEKA FARZUQNAL-'ULUUMA BI TIBYAANI ",
                    "translation": "O God, The Provider! Provide us with means of living We beseech You by Your Real Essence To give us knowledge and understanding."
                },
                {
                    "id": 22,
                    "transliteration": "AFATTAAHU YAA FATTAAHU FAATIHU MliGILAQIN LANAFTAHAJAMEE'AL-KHAYRI QOSEEHI WAD-DANI",
                    "translation": "I call on You, The Opener! Upon You, The Opener I call! You have the solution To all problems: Open for us door of fortune; The far and near fortune "
                },
                {
                    "id": 23,
                    "transliteration": "'ALEEMU FALLIMNY 'ULUUMAN HAQEEQOTIN TUTHABBITU IKHLAASI WADEENY WA EEMONI",
                    "translation": "O ALLAH, The All-knowing! Teach me knowledge of the truth. And Make me steadfast and devoted To Islamic religion and faith."
                },
                {
                    "id": 24,
                    "transliteration": "WAYAA Q0OBIDU-QBIDI RUUHA MON YATAJABBARU ALAYNAA WAFIL-ISLAAMI ZIDNAA BI 'IRIFAANI ",
                    "translation": "O ALLAH, The Constrictor of souls! Constrict the souls Of the arrogant, And increase our knowledge of Islam. "
                },
                {
                    "id": 25,
                    "transliteration": "WAYAA BAASITOL-ARIZAAQI LIL KHALQI FARZUKON JAMEEA MUREEDI KULLA RIZIQIN WA IRIFAANI",
                    "translation": "O ALLAH, The Expander of Wealth! Give all my followers Means of living And knowledge. "
                },
                {
                    "id": 26,
                    "transliteration": "FAYAA QOOSIMAL-ARZAAQI WARZUQ JAMEE'ANAA WABALIG LANAL-MAQSUDA MINI GAYRI KHUSRANI ",
                    "translation": "O ALLAH, The Sharer of Wealth! Provide us with means of living, Means of life Give us our desires, And save us from loss "
                },
                {
                    "id": 27,
                    "transliteration": "WAYA KHAFIDU-KHFID AMURA WAGDIN WAMU'TADI WAYA ROOFIU-RFANY ALAKULI AQIRAANY",
                    "translation": "O ALLAH, The Abaser! Diminish the power Of the adversary and the transgressors O The Exalter! Uplift me above my equals. "
                },
                {
                    "id": 28,
                    "transliteration": "MU'IZZU JAMEE' AL-AMBIYAAI AIZZANY Bl'IZZIKA NAGDU THUMMO NAMUSI BIRIDWAANI",
                    "translation": "O ALLAH, The Giver of Honour! Honour me As You honoured Your Prophets. It is by Your Glory and Grace That I live from dawn to dusk! "
                },
                {
                    "id": 29,
                    "transliteration": "AIZZA LANAL-ISLAAMAANTA MU'IZZUHU WADHALLIL 'ADUWWAD-DEENI MIN AHLI KUFRANI",
                    "translation": "O ALLAH! Uplift Islam forever As You uplifted it in the past. Humiliate the enemies of Islam Disgrace the infidels!"
                },
                {
                    "id": 30,
                    "transliteration": "MUDHILLU JAMEE'AL-KAAFIREENAADHILLAHUM KADHA KULA MON YATIGA BIDHULIMIN WAUDI WANI ",
                    "translation": "O ALLAH, The Dishonourer Of the infidels! Degrade the disbelievers and transgress Who oppress us. "
                },
                {
                    "id": 31,
                    "transliteration": "DU'AA IYA-SMA' YASAMEEHU BI SURI'ATIN KADHAAKA DU'AAHAT-TABIHEENA BIKHULSOONI ",
                    "translation": "To my prayer Listen 0 the All-Hearing! And hear the prayer Of my devoted followers. "
                },
                {
                    "id": 32,
                    "transliteration": "WAYAA SAAMI' AL-ASIWAATI FIL-ARDI WAS-SAMAA WAYA MUHSINAN LIL MUHSINEENA KADHAL-JAANI ",
                    "translation": "O The All-Hearing of voices Of those on earth And of those in heaven! O The Beneficent To the good doers! "
                },
                {
                    "id": 33,
                    "transliteration": "BASHEERUN BIKULI SHAYIN LASHAKA SHAAHIDAN BI MORIAU KULLUL-KHALIQI TURRAN BI ITQONI ",
                    "translation": "O ALLAH, The All-Seeing! You see every creature. No doubt. "
                },
                {
                    "id": 34,
                    "transliteration": "TARAANI WAHAALy YAA BASEERU FAFARIJAN KURUBIYA WADHIHIB KULLA SHARRI WA ADJAANI",
                    "translation": "O The All-Seening! You see me in my pitiful condition: Free me from grief; Make me happy: Save me from evils and darkness."
                },
                {
                    "id": 35,
                    "transliteration": "AYA HAKAMAL-HUKKAAMI WAL-ADILU HUKMUHU ALAA HASIDINA-HKUM BI WAYLIN WAKHUSRAANI ",
                    "translation": "O ALLAH, The Best of judges! You are The just: You do justice; Judge the envious; Make them woeful. "
                },
                {
                    "id": 36,
                    "transliteration": "BINAL-TUF LAYEEFAN BIL-BARIYYATI MINNATAN BILUTFEEKA FAKSHIF KULA KARIBIN WA AHAZANI ",
                    "translation": "O The most courteous To the creation! Give us Your Blessings And absolve us of grief and sorrows."
                },
                {
                    "id": 37,
                    "transliteration": "ILAAHI YAANTAL-HAKAMUWAL-ADILU ROBBANAA WA ANTA LATEEFUN LUTFUKAL-LAHU YARI'AANI ",
                    "translation": "You are the Judge and The Just O our God! You are The Courteous and The Subtle one 0 our God! You are The Courteous and The Subtle one Who shepherd us By Your blessings! "
                },
                {
                    "id": 38,
                    "transliteration": "KHABEERUN WALAYAKHFAAALAYHI KHAFIYYATUN ALEEMUN BIMOO Fl QALBI INSI KADHAJAANI",
                    "translation": "He is ALLAH, The Aware From whom nothing is hidden. He is The All-knowing Who knows what the hearts of mankind And the jinns contain"
                },
                {
                    "id": 39,
                    "transliteration": "HALIMUNI 'ALIMUN YAA HALEEMAN BI KHALIQIHY AFUWWUNI GAFUURUN LIL MUSEEHI KASAK-JAANI",
                    "translation": "O ALLAH, The Clement! 0 The All-Knowing! You give clemency To Your Servants. You are The Pardoner: You forgive the sinners Among the mankind and jinns!"
                },
                {
                    "id": 40,
                    "transliteration": "AZZEMUNI ILAAHUN-NASI JALLAJALAAJUHU SHAKURU AYAA HANNAANU FAMUNAH Bl'IHSAANI ",
                    "translation": "O ALLAH, The Magnificent! The Lord of mankind! So Great is Your Majesty! You are The Grateful: You are The Merciful; Give us Your Blessings. "
                },
                {
                    "id": 41,
                    "transliteration": "ALIYYUN KABEERUN KULLU KHALIQUN ABEEDUHU AFEEZUNI-ALA DUNIYAA WA-UKHURA BI ITIQOONI ",
                    "translation": "O ALLAH, The Most Highest! You are The Most Greatest! All creatures are your servants. You are The Preserver Of the earth and heaven! "
                },
                {
                    "id": 42,
                    "transliteration": "MUQITU JAMEEHIL-KHALQI WAHUWA HASEEBUHUM WALAA TUKHZINA YAWMAL-HISABI BI-KHIDHLAANI",
                    "translation": "O ALLAH, The Maintainer Of the entire creation! Don't humiliate me On the day of reckoning"
                },
                {
                    "id": 43,
                    "transliteration": "JALEELUNI-AZEEMUN SHAANI JALLA ILAA HUNAA KARIMUNI AZIMUL-MANNI YAA KHAYRA MANNANI ",
                    "translation": "O ALLAH, The Sublime One! O The Magnificent, so Great You are For all affairs! You are The Generous! You are so Great In Your Blessings, O The Best Giver! "
                },
                {
                    "id": 44,
                    "transliteration": "ROQEEBUN MUJEEBUN YAA MUJEEBU IDHA DUHI AJIB DA'AWATAL-MADHLUMI MINI HALT LAHAFANI ",
                    "translation": "O ALLAH, The Watchful! O The Responsive You respond to Your caller When he calls. Hearken to the prayer Of the oppressed in distress!"
                },
                {
                    "id": 45,
                    "transliteration": "MUJEEBUN LI-ABUDIN QOOIMAN MUTADORRI'AN MUTABAAK1YAN MIN DHAMBI SIRRIN WA HI'ILANI ",
                    "translation": "O ALLAH! You respond to Your servant Who supplicates You in humility: You respond to Your servant Who cries regretfully About the sins he commits Openly and secretly. "
                },
                {
                    "id": 46,
                    "transliteration": "AYAA WAASVAL-ARIZAAQI QOD JEETU TOOLIBAN ZIYAA DATA ARIZAAQIN WA'ILMIN WA EEMOON ",
                    "translation": "O ALLAH, The great Provider I For the creation! I have come to You Seeking abundant means of living, Knowledge and faith. "
                },
                {
                    "id": 47,
                    "transliteration": "SAALITUKA YAAALLAHU ILIMAN WA HIKMOTAN FA ANTAL-HAKEEMU ANTA KHAALIQU AKWANI",
                    "translation": "O ALLAH! I beseech You To give me knowledge and wisdom You are the Wise! You are the Creator of the creation! "
                },
                {
                    "id": 48,
                    "transliteration": "WA DUUDU WA DUUDU YAA WADUUDU LI-ABDIHI FAJUD LI BIWUDIN MINKA YA KHAYRA MONANI 'ALLAH,",
                    "translation": "The Loving God Who loves His servant! Give me Your love O The Merciful! "
                },
                {
                    "id": 49,
                    "transliteration": "ILAAHIL-MAJEEDU MAJIDUKAL-MAJIDU MAJIDAN 'UBAYDAN YUREEDUL-MAJIDA FIKULLI AKIWAANI ",
                    "translation": "O My Noble Lord! Honour Your humble servant Who seeds Your Honour: O ALLAH! Give him Your Honour Wherever he goes. "
                },
                {
                    "id": 50,
                    "transliteration": "BA'ATHTA ROSUULAN SHAAHIDAN WAMUBALLIGAN BASHIRAN NADHIRAN RAHAMOTAL-INSI WAL-JANI 0 ALLAH!",
                    "translation": "O ALLAH! You sent (Your) messenger (Muhammad) To the world As a witness, As a bearer of good tidings, And as well as a warner and a mercy!"
                },
                {
                    "id": 51,
                    "transliteration": "ABAATTHA RUSLIL-HAQQI NAHWA IBAADIHI ALAB ATH ROSUULAL-HAQQI NAHWILIYARI AANI",
                    "translation": "O ALLAH! You are The sender of the noble messengers To your servants. (Guide me by their divine messages) And appoint for me a true helper."
                },
                {
                    "id": 52,
                    "transliteration": "AYAA SHAAHIDASH-HIDNI ALAA KULLI TOYYIBIN WA-ANTA SHAHEEDUN KULLA SIRRIN WA IHILAANI",
                    "translation": "O ALLAH, The Witness! Bear witness To all my noble acts, For You are The Witness To all actions Occurring in secret and in the open. "
                },
                {
                    "id": 53,
                    "transliteration": "AYAA HAQQU YAA ROBBY WAKEELU WA HASIBUNA QOWIYYUN MATEENUN QOWWINY INNANY WANI ",
                    "translation": "O ALLAH, The Truth! My God, The Trustee! You are sufficient for us. O The Powerful God! O The Firm One! Give me spiritual strength, For I am weak. "
                },
                {
                    "id": 54,
                    "transliteration": "WAKEEELU WAKEELU KUN WAKEELY WA INNANY MUFAWWIDU AMRY FEEKAAADHA BITUKLAANI",
                    "translation": "O ALLAH, The Trustee! Be my Trustee. For upon You I rely wholly. "
                },
                {
                    "id": 55,
                    "transliteration": "WA ANTA WALIYYUN KUN WALIYYI WAHADINY HAMEEDUN WA MUHSI KULLA SHAY'IN BIHISBAANI ",
                    "translation": "O ALLAH, The master! Be my Master and Guide You are The Praise Worthy, And The Reckoner of everything "
                },
                {
                    "id": 56,
                    "transliteration": "WA YAA MUBDIAL-AKIWAAN1MUHEEDUAA MUMEETU JAMEEL-KAWNI MUHIYA BIJISMAANI",
                    "translation": "O ALLAH, The Originator Of the creation! You are The Restorer of all beings! You are The Creator of death You are The Giver of life! "
                },
                {
                    "id": 57,
                    "transliteration": "WA YA HAYYU YA QOYYUMU YAA KHAYRA KHALIQIN FA HAYYI LANAL-ARIWAAHA MINKA BISULITONI ",
                    "translation": "O ALLAH! O The Alive and The Self-Subsisting! You are The Best Creator! Give life to our souls By Your Power! "
                },
                {
                    "id": 58,
                    "transliteration": "WA YAA WAHIDUL-MAWJUUDI YAA MAJIDAL-WARAA WAJUUDUKA FARDU WAHWA HAQQU BIWAHDANI",
                    "translation": "O ALLAH! The one and The Ever living! The creation glorifies You! You are One in essence: Your Oneness is real."
                },
                {
                    "id": 59,
                    "transliteration": "AYA WAHIDU YAAAHADU Y AA SOMODU YAA FARAD QULUUBAL- BARAYAA SAKHRAN LY BIWUJDANI",
                    "translation": "O ALLAH! YOU are One; You are The Only One Soften for me The hearts of the mankind Give me their love "
                },
                {
                    "id": 60,
                    "transliteration": "AQOODIRU YAA QOHHARU QOHHIR ADUWWANAA WAMUQTADIRU-QDIRLIUULAAANTA DHUUSHAN ",
                    "translation": "O ALLAH! You are The Able And The Subduer, O ALLAH! You are The Powerful, Give us progress O ALLAH! You are The Owner Of all affairs. "
                },
                {
                    "id": 61,
                    "transliteration": "MUQODDIMU QODDIMUNAA DAWAAMONILA-L'ULA MUAKHKHIRU AKHKI IIR AHALA KAYDIN WA UDIWAANI ",
                    "translation": "O ALLAH The Expediter! Give us everlasting progress. 0 ALLAH, The Delayer! Delay the dreaded acts Of the conspirators And the adversary."
                },
                {
                    "id": 62,
                    "transliteration": "AYAAAWWALAN YAAAKHIRAN ANTA ZOOHIRU WAYAA BAATINUN Fl N SHAY IN BISURI'ANI",
                    "translation": "O ALLAH, The First 0 ALLAH, The Last! 0 ALLAH, The Manifest! 0 ALLAH, The Hidden! You manifest in everything: You exit in everything!"
                },
                {
                    "id": 63,
                    "transliteration": "AWWALAN LAABADIUN LAHU WAHUWAAAKHIRUN 0 ALLAH! AYAA ZOOHIRAN YAA BATINAN LUTFUKAD-DANI ",
                    "translation": "You are The First without beginning! You are The Last without end! You are The Manifest no one sees You 0 The Owner of Grace! Give me you Grace. "
                },
                {
                    "id": 64,
                    "transliteration": "DA'AOTUKA YAA WAALY TAWALLA UMUURANAA TA'ALAYTA YAA MUTA'AALI 'AN AHLI KUFRAANI ",
                    "translation": "O ALLAH, The Governor! I beseech You To govern our affairs You are The Most Exalted Whose greatness is beyond The perception of the infidels."
                },
                {
                    "id": 65,
                    "transliteration": "AWAALY ULAATAL-AMURI WALL! UMUURANA KHIYAARA MINAL-UMARAI AHLA TUGYAANI",
                    "translation": "O ALLAH! You are The Governor of governors Appoint for us as leaders The pious among Your servants: Not the transgressors."
                },
                {
                    "id": 66,
                    "transliteration": "AYAA BARRU YAA TAWWAABU FAGFIR DHUNUBANA WA-AMIN JAMEE'AL MUSLIMEENA BI IHSAANI",
                    "translation": "O ALLAH, The source of Goodness! O The Acceptor of Repentance! Forgive our sins And give Your Blessings To the entire Muslims"
                },
                {
                    "id": 67,
                    "transliteration": "AMUNTAQIMAN MIN KULLI BAAGIN WAMU'TADIN ALAA FANTAQIM MIN ZOOLIMEENA BISUR'ANI ",
                    "translation": "O ALLAH, The Avenger! You avenge on the oppressors And the transgressors: Avenge us on those Who do us injustice. "
                },
                {
                    "id": 68,
                    "transliteration": "AFUWWUN GAFUURUN YAAAFUWWU FAINNANAA JANAYNA KHATOYA FAAFU 'ANNAA BIGUFURAANI ",
                    "translation": "The Pardoner and The ALL Forgiving! We've committed many sins: Pardon us as though we had no sin. "
                },
                {
                    "id": 69,
                    "transliteration": "RAHUFUN BI'ABUDIN INDAMAA  WAYAA MALIKAL-AMULAKI Q DANA QOONITON QOHRAN BISULITOONI",
                    "translation": "O ALLAH, The Compassionate! You are kind to Your servant When he is hopeless. O King of kings, You are The Sovereign! "
                },
                {
                    "id": 70,
                    "transliteration": "WAYAA DHAL-JALAALI JALLA IKIRAAMUKAL-ULAA SA'ALTUKA IKIRAAMAN YALUUHU BI LAMHAANI",
                    "translation": "O ALLAH, The Lord of Majesty! So Bounteous You are! I beseech You to grant me A manifest honour"
                },
                {
                    "id": 71,
                    "transliteration": "AYAA MUQISITOL-AQISAAMISIRRA N Bl'ILIMIHI 0 ALLAH WAYAA JAAMIAL-ASHITAATI MIN KULLI ARIKAANI ",
                    "translation": "The Equitable! 0 Gatherer of different entities, Anywhere and at any time! In a balanced way: You do equity with Your knowledge. "
                },
                {
                    "id": 72,
                    "transliteration": "WAYAA JAMI'AL-ASHITAATI IJIMAHA LANAL-MUNAA WAYAAMUKHRIJA KULLIN-NABAATI BIALWAANI",
                    "translation": "O ALLAH, The Gatherer of Different Entities! Give us our expectation. We beseech You O ALLAH! The Producer of vegetation In different colours. "
                },
                {
                    "id": 73,
                    "transliteration": "WA ANTA GANIYYUN ANI IBAADIKAAGININAA ILAYKAF-TAQORINAAANTA MUNZILU FURIQOONI",
                    "translation": "O ALLAH! You are The Self Sufficient You are free of all wants; You seek no assistance From Your servants Make us self sufficient, We implore Your help, For You are The Sender Of the criterion"
                },
                {
                    "id": 74,
                    "transliteration": "TOLABUTU GINAAANTA MUGNY FA-AGININAA FA INNAAKA MUGINL-ABUDI ANKULLI ASHIJAANI",
                    "translation": "O ALLAH! I seek Your help. You are The Enricher Make us contended With Your Provision: Surely You are The Enricher Of Your servants! Absolve us of grief. "
                },
                {
                    "id": 75,
                    "transliteration": "AMAANIU YAA DOORRAN ALAA KULLI MAN TOGAA WAYAA NAAFIHUN-FAA'NEE BIHILMIN WABURIANI ",
                    "translation": "O ALLAH, The Preventer, The Distressed Make the transgressors despondent 0 ALLAH, The Propitious! Give us the benefit of Knowledge. "
                },
                {
                    "id": 76,
                    "transliteration": "ILAA-HIYA YAA NUURAL-ANAMI FANAWWI QULUUBA MUREEDY BIL-ULUUMI WA WILDAARAN NI",
                    "translation": "O ALLAH, my Lord! You are The Light of The Creation* Illuminate the hearts of my followers With the divine knowledge Of the Qur'an S"
                },
                {
                    "id": 77,
                    "transliteration": "BINUURIKA YAAALLAHU ADI'UKA JAHARATAN  AGITHINAAAGITHINAA YAA ILAAHA BI EEMAANI ",
                    "translation": "O ALLAH! By Your Name: The Light I beseech You openly To help me: O my God help me: Make me faithful to You. "
                },
                {
                    "id": 78,
                    "transliteration": "FA MINKAAYAA HADI TOLABUTU HIDAAYATAN FA'ABLY ROSHADAN MINKA GAYRI HIRMANI",
                    "translation": "O ALLAH, The Guide! From You I seek guidance: Give me Your Guidance Don't deny me Your Guidance. "
                },
                {
                    "id": 79,
                    "transliteration": "BADEE'US-SAMAA WAL-ARIDI KHAYRA MUBUDIHIN WA BALLIGI LANAL-MAQSUUDA KUNLY BISURI'ANI ",
                    "translation": "O ALLAH, The incomparable creator Who created the heaven and the earth! O The Best Creator! Give us our desires in time. God is the light of the heavens and the earth."
                },
                {
                    "id": 80,
                    "transliteration": "I LAA-H IYA YAA BAAQI VVAYAA WAARITHA L-WARAA WA VVARITHA KULIL-KHALIQI YA KHAYRA DAYANI ",
                    "translation": "O ALLAH, My Lord! You are The Everlasting! You are The Supreme Inheritor Of the creation: You shall inherit the entire creation. You are The Best Judge. "
                },
                {
                    "id": 81,
                    "transliteration": "ROSHIDUN WAKULUL-KHALIQI YATLUBU RUSHAHU WAANTA SOBUURUN LIL-ANAAMI BIGUFRAANI ",
                    "translation": "O ALLAH! You are The Guide To the right path Your creatures seek You Guidance. You are The Pent: You forgive the wrong Of Your servants"
                },
                {
                    "id": 82,
                    "transliteration": "BI ASMAA'IKAL-HUNAA BI JAAHI NABIYYINAA MUHAMMAD! ABDIL-LAHI SOFWAATI ADNAANI ",
                    "translation": "O ALLAH! I beseech You By Your Beautiful Names And by Your Prophet Muhammed, The son of Abdul-lahi, And The best of Adnan dynasty. Give us Your blessings"
                },
                {
                    "id": 83,
                    "transliteration": "SAIDIN AA BI ASMOOHINI ILAAHI LAT! DAHAA BIHAL-AMBIYAA KULLAN BI AMNIN WA HEEMAANI ",
                    "translation": "We are blessed By ALLAH's Names, By His Names the apostles beseech Him: To Him they were faithful; In Him they trusted. "
                },
                {
                    "id": 84,
                    "transliteration": "HUWAL-KANZA WAL-IKISEERU WAL-KHAYRU JUMULATAN LIMAN KAANAABUDAN MU'MINANI AALA IRIFANI ",
                    "translation": "In His Hands Lies treasures and fortunes Of the faithful servants Who know and worship Him "
                },
                {
                    "id": 85,
                    "transliteration": "WADAMMI'R LANAL-A1DAAHA ANTA ILAAHUNAA FAKATHIR LANAL-ATIBAAHA FIKULLI AZIMAANI ",
                    "translation": "O ALLAH! Subdue our enemies And multiply our congregation At all time, For you are our Lord! "
                },
                {
                    "id": 86,
                    "transliteration": "BISIRRIKAYAAALLAHU FIL-KHALIQI DAA'IMAN BIJAAHI WALIYYI LAAHI ZAA SHAYKHI TIJANI ",
                    "translation": "O ALLAH! I beseech You By Your Glorious Name By which You created the creation I beseech You By Your chosen servant: Sheikh Teejaani, Give me victory Over my foes."
                },
                {
                    "id": 87,
                    "transliteration": "WA BALLIG JAMEEAL-AOLIYM MUFAADAHUN WA BARIK LAHUM ABUNAAHA ILMIN WA'IRFAANI ",
                    "translation": "O ALLAH! Give all Your chosen servants Their desires, And bless their students and followers"
                },
                {
                    "id": 88,
                    "transliteration": "WAAATEE LIKULLIL-MUSLIMEENA SALAMOTAN THABATAN LIQAOMIL-HAQQI DAOMAN A 0 ALLAH",
                    "translation": "The beneficent! RAHMONI Give the Muslims peace And tranquillity, Make us the follower of the truth And make us constant on Your Path."
                },
                {
                    "id": 89,
                    "transliteration": "WA AYYID AYAAALLAHU MUQODDAMIN O ALLAH! WA ZID LIMURIDEENA JAMEEAN BI IMKAANI ",
                    "translation": "Help our 'mukadams' Give the 'muridees' Their desires in multitude. "
                },
                {
                    "id": 90,
                    "transliteration": "WAY DAA'IMAL-MA'RUUFI BALLIG MURAADANAA WAYAA BAASITOL-YADAYNI KUN LY BIMINNAANI",
                    "translation": "O ALLAH, The Eternal Giver of Fortunes! Fulfil our expectations. You are The Expander of blessings, Give us Your Blessings. "
                },
                {
                    "id": 91,
                    "transliteration": "BI ADILIKA TUDHY MAN TASHAA WATUDILLU MAN TASHA FARISHUDANA MUDHINIBINA LIGUFANI",
                    "translation": "O ALLAH! UR By Your Justice You guide whom You wish for guidance, And You send astray Whom You wish to be astray! Guide the sinners To Your forgiveness."
                },
                {
                    "id": 92,
                    "transliteration": "FALAA HAOLA LINNAASI WALA QUWWATA LAHUM SIWA HUKIMI ROBBIL-ARSHI HAQQON BISULTOONI ",
                    "translation": "O ALLAH! WE, the mankind Neither have plan nor plot Against Your will. You are The Lord of The Throne You are The Real Sovereign! "
                },
                {
                    "id": 93,
                    "transliteration": "AYAAMULHAMO DA'WAATI BI ASIMAAI ROBBINA, WADHAKA GINA DARAYNI KHUDHIHA BIHEEMANI ",
                    "translation": "O you servant of ALLAH! You've seen taught The Most Beautiful Names Of our God They are The Invaluable Treasures Of earth and heaven. Hold fast to them With faith in ALLAH. "
                },
                {
                    "id": 94,
                    "transliteration": "WAKUN ROOKIAN KUN SAAJIDAN MUTA 'ABBIDA WA MUDHAKKIRAN MUTAFAK-KIRN KULL ZIMNI ",
                    "translation": "O you servant of ALLAH! Worship ALLAH, Bowing and prostrating. Worship ALLAH Remember and chart His Names; Think of ALLAH at all times. "
                },
                {
                    "id": 95,
                    "transliteration": "FA KAATIBU AADHAA ROBBIUN NAJILI MAALIKI ADEBAYO ZIDHU ROBBI MIN KULLI IRFAANI",
                    "translation": "This is an humble work He supplicates ALLAH To increase his knowledge."
                },
                {
                    "id": 96,
                    "transliteration": "WABARIK LANAAADHAL-KITAABA WAKULLAN  YUIAAZIMUHU MIN SAAIRIL-INSI WAL-JANI MAN",
                    "translation": "O ALLAH! Bless this (prayer) book And its readers Among the mankind and the firms!"
                },
                {
                    "id": 97,
                    "transliteration": "WA-'AMMIN JAMEEAL-MUSLIMEENA HIDAAyATAN DHUKURAN INAATHAN MIN KIBAARIN WAGILMAANI ",
                    "translation": "O ALLAH! Guide the entire Muslims: Both males and females; The old and youth alike "
                },
                {
                    "id": 98,
                    "transliteration": "KADHAAKA JAMI'A GHAAKIREENA WASHAAKIRAAT NAHARAN WALAYLAN MIN KUHULIN WASHUBBANI",
                    "translation": "O Allah! Guide the Worshippers. Both Males and Females: the middled aged and youth alikem who rember You day and Night"
                },
                {
                    "id": 99,
                    "transliteration": "WA-AJIMAIANAL-KHAYRAATI ANTA MOLEEKUHA FAFY KULLI YAOMIN YAA ROBBI ANTA FISHAANI ",
                    "translation": "O ALLAH! Give us fortunes In multitude You are the Owner of Fortunes: You are in charge of all affairs Everytime. "
                },
                {
                    "id": 100,
                    "transliteration": "WA FATIUL-BAARI FY DA'WATIL-LAHI ROBBINAA BI ASMAA'HIL-HUSNAA WA AYAATI QURI'AANI ",
                    "translation": "Fat'hul-Baary Is a book of supplication To ALLAH our Lord By His Most Beautiful Names And noble verses of the Qur'an "
                },
                {
                    "id": 101,
                    "transliteration": "ANILNAL-GINAAYAA ROBBI FID-DEENI WADDUNAA WA AMIM JAMEEAL-MUSLIMEENA BIFURIQOONI",
                    "translation": "We beseech ALLAH! To make us contended And to give the entire Muslims on earth, Protection (and guidance of the Qur'an). "
                },
                {
                    "id": 102,
                    "transliteration": "BI MI'ATI BAYTIN WATHALATHATI BAADAHAA NOZOMTU DU'AHI TOOLIBAN KHAYRA RA",
                    "translation": "My prayer book HMOONI Contains one hundred And three poetical verses. I composed them. Seeking the fortune Of the Most Beneficent."
                },
                {
                    "id": 103,
                    "transliteration": "SO LAATUN WATASLEEMUNIALAA SAYYIDIL-W MUHAMMADI KHAYRIL-KHALIQI AHASANA I ARA NSANI ",
                    "translation": "May the blessings And peace of ALLAH be Upon the leader of mankind, Muhammad The best of creatures; The best of mankind! "
                }
            ]

        },
        {
            "id": 2,
            "name": "DA'WAAT ROBBAANIYYAT MINAL-QUR'ANUL-KAREEM 'ROBBANNA' PRAYERS\n IN THE HOLY QUR'AN IN THE NAME OF ALLAH, THE MOST BENEFICENT THE MOST MERCIFUL. ",
            "content": [{
                    "id": 1,
                    "transliteration": "ROBBANA TAQOBBALMINNAA INNAKA AANTAS-SAMEEUL-ALEEMU. (Q.2 V-127)",
                    "translation": "O Lord! Accept (this service) from us: for You are The All Hearing, The All-Knowing. "
                },
                {
                    "id": 2,
                    "transliteration": "ROBBANA WAJIALNAA MUSLIMAYNU LAKA WAMI DHURIYYATINAA UMMOTAN MUSLIMOTANL-LAKA WA ARINAA MONAA SIKANAA WATUB ALAYNAA INNAKA ANTAT TAWAABUR-RAHEEM. (Q.2. V:-128) ",
                    "translation": "Our Lord! Make us Muslims, bowing to Your (Will), and of our progency a people Muslim, bowing to Your (Will); Ans show us our places for the celebration(due) rites; for You are the Oft-Returning, Most Merciful. "
                },
                {
                    "id": 3,
                    "transliteration": "ROBBANAAA WAB'ATH FEEHIM ROSUULAN MINIHUM YATILU ALYHIM AAYAATIKA WAYUALLIMUHUMUL-KITAABA WAL-HIKMOTA WAYUZAKKEEHIM INNAKA ANTAL-AZZEZUL-HAKEEM. (Q.2.V:-129) ",
                    "translation": "Our Lord! Send amongst them an Apostle of their own, who shall rehearse Your signs to them and instruct them in Scripture and Wisdom, and sancity them: For You are the Exalted in Night, the Wise"
                },
                {
                    "id": 4,
                    "transliteration": "ROBBANAAAATINAA FID-DUNYAA HASANATAN WAFIL-AKHIRATI HASANATAN WAQINAA ADHAABAN-NAARI",
                    "translation": "Our Lord! Give us (Your bounties) in this world! But they will have no portion in the Hereafter. "
                },
                {
                    "id": 5,
                    "transliteration": "ROBBANAA AFRIG ALAYNAA SOBURAN WATHABBIT AQIDAAMANAA WA ANSURNAA ALAL-QAOMIL-KAFIREENA",
                    "translation": "Our Lord! Pour not constancy on us and make our ste firm: Help us against those that reject faith. "
                },
                {
                    "id": 6,
                    "transliteration": "ROBBANAA LAATU AKHIDHNAA IN NASEENAA AO AKHTO'NAA ROBBANAA WALATAHMIL ALAYNAA ISIRAN KAMO HAMALTAHU ALAA LADHEENA MIN QOBLINAA, ROBBANAA WALATUHAMMILNAA MM LM TOQOTA LANAA BIHI WA AFUANNAA WAGFIR LANAA WARHAMUNAA ANTA MAOLAANAA FANSURNAA ALAL-QOUMIL-KAAFIREENA. (Q.2.V:286) ",
                    "translation": "Our Lord! Condemn us not if we forget or fall into error, our Lord! Lay not on us a burden like that which You did lay on those before us; our Lord\" Lay not on us a burden greater than we have strength to bear. Blot out our sins, and grant us forgiveness. Have mercy on us. You are our Protector; help us against those who stand against faith. "
                },
                {
                    "id": 7,
                    "transliteration": "ROBBANAA LATUZIGQULUUBANAA BAADA IDH ADAYTANAA WAHAB LANAA MIN LADUNKA RAHMATAN INNAKAANTAL-VVAHAABU (Q.3. V:8)",
                    "translation": "Our Lord! (they say), \"Let not our hearts deviate now after You have guided us, but grant us mercy from thine own presence; For You are the Grantor of Bounties without measure. "
                },
                {
                    "id": 8,
                    "transliteration": "ROBBANAA INNAKA JAMEEUN-NAASI LIYAOM LARAYBA FEEHI INNAL-LAHA YUKHLIFUL-MIHAADA.",
                    "translation": "I (Q.3.V:9) Our Lord! You are the one that will gather mankind together against a Day about which there is no doubt; for God never fails in His promise. "
                },
                {
                    "id": 9,
                    "transliteration": "ROBBANAA INNANAA AANANNAA FAGFIRLANAA DHUNUUBANAAWAQINAAADHABAN-NAARI. (Q.3.V:16) ",
                    "translation": "Our Lord! We have indeed believed: forgive us, then our sins and save us from the agony of the Fire. "
                },
                {
                    "id": 10,
                    "transliteration": "ROBBANAAAAMANNAA BIMAAANZALTAWATTABA'NAA ROSUULA FAKTUBUNAA MASH-SHAAHIDEENA. (0.3.V:53) ",
                    "translation": "Our Lord! We believe in what You have revealed, and we follow the Apostle; then write us down among those who bear witness."
                },
                {
                    "id": 11,
                    "transliteration": "ROBBANAA GFIR DHUNUUBANA WA ISRAAFANA FY AMRINAA WATHABBIT AQIDAAMANAA WANSURNAA ALAL-QAOMIL-KAAFIREENA(Q.3.V:147)",
                    "translation": "Our Lord! Forgive us our sins and anything we may have done that transgressed our duty: Establish our feet firmly, and help us against those that resist faith."
                },
                {
                    "id": 12,
                    "transliteration": "ROBBANAA MAA KHALAQTA HAADHA BAATILAN SUBHAANAKA FAQINNAA ADHAABAN-NAARI. (Q.3.V:191)",
                    "translation": "Our Lord! Any whom You verily admit to the fire, Truly converest with shame and never will wrong-doers find any helpers!"
                },
                {
                    "id": 13,
                    "transliteration": "ROBBANNAA INNAKA MAN TUDKHILIN-NAARA FAQOD AKHAZAYTAHU WAMAA LIZOOLIMINA MINANSOORIN. (Q.3.V:192) ",
                    "translation": "Our Lord! Any whom You verily admit to the fire, Truly converest with shame and never will wrong-doers find any helpers!"
                },
                {
                    "id": 14,
                    "transliteration": "ROBBANAA INNANAA SAMI'NAA MUNAADIYAN YUNAADY LIL EEMAANI AN'AAMINUU BIROBBIKUN FA'AMANNAA ROBBANA FAGFIR DHUNUBANAA WA  KAFFIR ANNAA SAYYIAATINAA WATA WATAWAFFANAA MAAL-ABURAARI. (Q.3.V:193) ",
                    "translation": ""
                },
                {
                    "id": 15,
                    "translation": "Our Lord! Verily, we have heard the call of one calling (us) to faith, 'Believe in you in the Lora, and we hav believed, Our Lord! Forgive us our sins, blot out from us oure inquities, and take to Yourself our souls in the company of the righteous.",
                    "transliteration": "ROBBANAA WA AATI AA MAA WA'ADTANAA ALA RUSULIKA WALAA TUKHZINAA YAOMAL-QIYAAMATI INNAKALAATUKHLIFUL-Ml'AADA(Q.3.V:194)"
                },
                {
                    "id": 16,
                    "transliteration": "ROBBANAA ANZIL ALAYNAA MAAIDATAN MINAS-SAMAAHI TAKUUNU LANAA IDAN LIAWWALINAA WA AAKHIRINAA WA AAYATAN MINKA WARZUQNAA WA ANTAKHAYRUR-ROZIQEENA. (Q.5.V:114) ",
                    "translation": "O ALLAH, Our Lord! SEND us from heaven a table set (with viands), that there may be for us for the first and the last of us- a Solumn festival and a Sign from You; and provide for our sustenance, for You are The Best Sustainer (of our needs)."
                },
                {
                    "id": 17,
                    "transliteration": " ROBBANAA ZOLAMUNAA ANFUSANAA WA INLLAM TAGFIR LANAA WATAR HAMUNAA LANA KUNNANNAA MINAL-KHAASIREENA, ",
                    "translation": "Our Lord! We have wronged our own souls; if You forgive us not and bestow not upon us Your Mercy, we shall certainly be lost. "
                },
                {
                    "id": 18,
                    "transliteration": "ROBBANAA LAA TAJ'ALNAA MA'L-QAOMIZ-ZOOLIMEENA. (Q.7.V:47)",
                    "translation": "Our Lord! Send us not to the company of the wrong-doers. "
                },
                {
                    "id": 19,
                    "transliteration": "ROBBANAA'IFTAH BAYNANAA WA BAYNA QAOM I NAA BIL-HAQQI WAANTAKHAYRUL-FAATIHEENA. (Q.7.V:89)",
                    "translation": "Our Lord! Decide You between us and our people in truth for You are the best to decide."
                },
                {
                    "id": 20,
                    "transliteration": "ROBBANAA'FRIQ ALAYNAA SOBRAN WATAWATTANAA MUSLIMENA. (Q.7.V:126) ",
                    "translation": "Our Lord! Pour our on us patience and constancy, and take our souls unto You as Muslims (who bow to You Will)."
                },
                {
                    "id": 21,
                    "transliteration": "ROBBANAAWATAQOBBALI DU'AAHEE (Q.14.V:40) ",
                    "translation": "Our Lord! And accept You my prayer. "
                },
                {
                    "id": 22,
                    "transliteration": "ROBBANAA LA TAJ'ALINAA FTNATAN LIL-QAOMI ZOOLIMENA. (Q.10. V:85)",
                    "translation": "OUR Lord! Make us not a trial for those who practice oppression."
                },
                {
                    "id": 23,
                    "transliteration": "ROBBANAA LIYUQEEMUS-SOLAATA FAJ-ALAFU IDATAN MINAN-NAASI TAHWY ILAYHIM WARIZUQHUM MINATHAMARAATI LA' ALLAHUM YASHIKURUUNA. (Q.14.V:37) ",
                    "translation": "Our Lord! That they may establish regular prayer: so fill the heart of some among men with love towards them, and feed them with Fruits: so that they may give thanks."
                },
                {
                    "id": 24,
                    "transliteration": "ROBBANAA AAMONAAN FAGFIR LANAA WARHAMNAA . . WAANTA KHAYRU RAAHIMEENA. (Q23V:109) ",
                    "translation": "Our Lord! We believe; Then do You forgive us, and have mercy upon us: for are the Best of those who show mercy!"
                },
                {
                    "id": 25,
                    "transliteration": "ROBBANAA ALAYKA TAWAKKALINAA WA ILAYKA ANABUNAAWA ILAYKAL-MASEERU. (Q.60. V:4",
                    "translation": "Our Lord! In You do we trust; And to You do we turn in repentance; to You is (our) final Goal."
                },
                {
                    "id": 26,
                    "transliteration": "ROBBANAA ATMIM LANNA NUURANAA WAGFIRLANA INNAKAALAAKULLISHAYHIN QODEERAN.(Q.66.V:8)  ",
                    "translation": "Our Lord! Perfect our light for us, And grant us power forgiveness: For You have poer over all thins. "
                },
                {
                    "id": 27,
                    "transliteration": "ROBBANAA AATINAA MIN LADUNKA RAHMATAN WA AYYIHI LANAAMINAMRINAAROSHADAN. (Q.18. V:10) ",
                    "translation": "Our Lord! Bestow on us mercy from Yourself, and dispose of our affair, Foreor us in the right way! "
                },
                {
                    "id": 28,
                    "transliteration": "ROBBANAA HABLANAA MIN AJINAA AZIWA WADHURRIYYAATINAA QURRATA A'YUNIN W LILUNTTAQEENAIMAAMAN. (Q.25.V:74) AJ'ALNAA ",
                    "translation": "Our Lord! Grant unto us wives and offspring who will be righteous. the comfort of our eyes, and give us (the grace) to lead the "
                },
                {
                    "id": 29,
                    "transliteration": "ROBBANAA WASI'TA KULLA SHAYHIN RAHMATAN WA'ILMAN FAGFIR LIL-LADHIEENA TAABUU WAT-(Q.40.V:7) TABA'UU SABEELAKA WAQIHIMADHAABAL-JAHEEM. ",
                    "translation": "Our Lord! You reach is over all things, in Mercy and knowledge, Forgive, then those who turn in Repentance, the Blazing Fire! and follow Your Path; and preserve them from the Penalty of "
                },
                {
                    "id": 30,
                    "transliteration": "ROBBANAA WADKHILIHUM JANNAATI ADNIN LATI WAHADTAHUM WAMAN SOLAHA MIN AABAAHIHIM AZWAAJIHIM WAZURRIYYAA TIHIM INNAK ANTAL AZEEZUL-HAKEEM. (Q.40.V:8)",
                    "translation": "And grant, our Lord! That they enter The Gardens of Eternity, which You have promised to them, and to the righteous among their fathers, their wives and their posterity! ForYou are (He), The Exalted in Might, full of Wisdom"
                },
                {
                    "id": 31,
                    "transliteration": "ROBBANAA-KSHIF ANAAL-°ADHAABA INNAA MUIMINUUNA(Q.44.V:12) ",
                    "translation": "Our Lord! Remove the penalty from us, for we do really believe! "
                },
                {
                    "id": 32,
                    "transliteration": "ROBBANAA-GF1RLANAA WAL-IKHWAANINAA LLADDHEENA §A8AKUUNAA BIL-EEMAANI WALAA TAJ'AL FEEQULUUBINAAA GILLAN LI-LADHEENA AMANUU ROBBANAAINNAKARAHUUFUN ROHEEM",
                    "translation": "Our Lord! Forgive us, and our brethren who came before us into the faith, and leave not, in our hearts, Rancour (or sense of injury) against those who have believed our Lord! You are indeed full of kindness, Most Mercy."
                },
                {
                    "id": 33,
                    "transliteration": "ROBBANAA LAA TAJ'ALINAA FITINATAN LIL-LADHEENA KAFARUU WAGFIR LANAA ROBBANAA INNAKA ANTAL AZEZUL-HAKEEM (Q.60.V:5)",
                    "translation": "Our Lord! Make us not a (test and) trial for the unbelievers, but forgive us, our Lord! For Your are the Exalted in Might, the wise. "
                },
                {
                    "id": 34,
                    "transliteration": "ROBBANAA ASRIF ANNAAA ADHAABA JAHANNAMA INNAADHAABAKAKAANAGARAAMAN. (Q.25.V:65)",
                    "translation": "Our Lord! Avert from us the Wrath of Hell, for its Wrath is indeed an affliction. "
                }
            ]
        },
        {
            "id": 3,
            "name": "DA'AWAAT SUBHAANIYYAT MINAL-QUR'ANIL-KAREE11/1 'SUBHANI PRAYERS IN THE HOLY QUR'AN ",
            "content": [{
                    "id": 1,
                    "transliteration": "FAFUBIHAANAL-LAHI HEENA TU TUSBIHUUNA. MSUUNA WAHEENA (Q.30.V:17)",
                    "translation": "So (give) glorify God, when you rise in the morning.  you reach eventide and when"
                },
                {
                    "id": 2,
                    "transliteration": "FASUBIHAANAL-LADHI BIYADIHI MOLAKUUTU L KULLI  SHAYHIN WA ILAYHIN WA ILAYHIN TUTU (Q.36.V:83)",
                    "translation": "Glory be to Him in whose hands is the do things: And to Him will minion of all you be all brought back. "
                },
                {
                    "id": 3,
                    "transliteration": "SUB'HAANAL-LAHIAMMAAYASIFUUNA. (Q.43.V:13) ",
                    "translation": "Glory be to God! (He is free) from the things the him) they ascribe "
                },
                {
                    "id": 4,
                    "transliteration": " SUB'HAANA  YASIFUUNA. ROBBIKA ROBBIL-IZZATI AMMAA (Q.37.V.180) ",
                    "translation": "Glorified is Your Lord, the Lord of Honour and Power! (He is free) from what they ascribe (To Him) "
                },
                {
                    "id": 5,
                    "transliteration": "SUB'HAANA LADHI SAKHKHARA LAN WAMAAKUNNAALAHU MUQRINEENA. AA AADHAA  (Q.43.V:13)",
                    "translation": "Glory be to Him who has subjected these to our Lord (use), for we could never have accomplished this (y ourselves) WAL-ARDI ROBBIL-b"
                },
                {
                    "id": 6,
                    "transliteration": "SUB'HAANA ROBBIS-SAMOWATI ARSHIAMMAAYADIFUUNA. (Q.43. V.82) SUB'HAANALAAHIAMMAAYUSHIRIKUUNA(Q.52.V:43) ",
                    "translation": "Exalted is God far above things they associate with Him! "
                },
                {
                    "id": 7,
                    "transliteration": "SUB'HAANA ROBBANAA INAAKUNNAA ZOOLIMEENA. (Q.68 V:29)",
                    "translation": "Glory be to our Lord! Verily, we have been doing wrong! "
                },
                {
                    "id": 8,
                    "transliteration": "SUB'HAANA ROBANNA INAAKUNNA ZOOLIMEENA (Q68 V29",
                    "translation": "Glory be to our Lord! Verify,w e have been doing wrong"
                },
                {
                    "id": 9,
                    "transliteration": "SUBIHAANAKA LAA ILMALANAA ILLA MAAALLAMTANAA INNAKAANTAL-ALEEMUL-HAKEEM (Q.2.V:32) ",
                    "translation": "Glory be to You: of knowledge we have none, save what You have taught us: in truth it is You Who art perfect in knowledge and wisdom"
                },
                {
                    "id": 10,
                    "transliteration": "SUBIHAANAKA FAQINNAA ADHAABAN-NAARI (Q.3.V:191)",
                    "translation": "Glory be to You! Give us salvation from the Penalty of the Fire"
                },
                {
                    "id": 11,
                    "transliteration": "SUB'HAANAKAL TUBTU ILAYKA WA ANNA AWWALUL-MU'MINEENA. (Q.7.V:143) ",
                    "translation": "Glory be to You! To You I turn in repentance, and I am the first to believe."
                },
                {
                    "id": 12,
                    "transliteration": "SUB'HAANAKAL-LAHUMMA TAHIYYATYHUM FEEHAA SALAAMUN WA AAKHIRU D'WAAHUM ANIL-HAMDUL-LAHIROBBIL-ALLAMEENA(Q.10.V:10) ",
                    "translation": "Glory be to You. 0 God! And Peace will be their greeting there in! And the close of their cry will be: 'Praise be to God. The Cherisher and Sustainer of the Worlds!"
                },
                {
                    "id": 13,
                    "transliteration": "SUB'HAANAKA INNEE KUNTU MINA ZOOLIMEENA (Q.21.V:87)",
                    "translation": "Glory be to You: I was indeed wrong! "
                },
                {
                    "id": 14,
                    "transliteration": "SUB'HAANAKA MAA KAANA YANBAGEE LANAAAN-(Q.25.V:18) NATAKAHIDHA MIN DUUKNKA MIN AOLIYAAHI ",
                    "translation": "Glory be to You! Not meant was it for us that we should take for protectors others besides You."
                },
                {
                    "id": 15,
                    "transliteration": "SUB'HAANAKA ANTA WALIYYUNAA MIN DUUNIH (Q.34.V:41) ",
                    "translation": "Glory be to You! Our (tie) is with You- as Protector- not with"
                },
                {
                    "id": 16,
                    "transliteration": "SUB'HAANAKA BAL LAHU MAA FEES-SAMAAWAATI WA MAA FEEL-ARIDI KULLUN LAHU QOONITUUNA. (Q.2. V:116) ",
                    "translation": "Glory be to Him — No, to Him belongs all that is in the heaven and on earth: everything renders worship to Him."
                },
                {
                    "id": 17,
                    "transliteration": "SUB'HAANAHU ANYAKUUNA LAHU WALADUN LAHU MAAFIS-SAMOOWAATI WA MAA FIL-ARIDI WAKAFA BIL-LAHIWAKEELAN. (Q.4.V:171) ",
                    "translation": "Glory be to Him: (Far Exalted is He) above having a son. To Him belong all things in heavens and on earth. And enough is God as a Disposer of affairs."
                },
                {
                    "id": 18,
                    "transliteration": "SUB'HAANAHU WATA'AALA HAMMA YASIFUUNA. (Q.6.V:100) ",
                    "translation": "Attribute to Him! Praise and glory be to Him! 9for He is) above What they "
                },
                {
                    "id": 19,
                    "transliteration": ". SUB'HAANAHUAMMAAYUSHIRIKUUNA (Q.9.V:31)",
                    "translation": "Praise and glory be to Him: (Far is He) from having partners they associate (with Him). "
                },
                {
                    "id": 20,
                    "transliteration": "SUB'HAANAHU HUWAL-GANIYYU LAHU MAA FES-SAMAAWAATI WAMAA F I L-ARI D I. (Q.10.V:68)",
                    "translation": "Glory be to Him! He is Self-Sufficient! His are all things in heavens and earth! "
                },
                {
                    "id": 21,
                    "transliteration": "SUB'HAANAHU WA TA'AALA HAMMA YAQUULUUNA ULUWWAN KABEERAN. (Q.17.V:43) ",
                    "translation": "Glory be to Him! He is High above all that they say! Exalted and Great (beyond measure)!"
                },
                {
                    "id": 22,
                    "transliteration": "SUB'HAANAHU BAL IBAADUN MUKRAMUUNA (Q.21.V:26)",
                    "translation": "Glory be to Him! They are (but) servants raised to honour. "
                },
                {
                    "id": 23,
                    "transliteration": "SUB'HAANAHU HUWAL-LAHUL-WAAHIDU-QOHAARU. (Q.39.V:4) ",
                    "translation": "Glory be to Him! (He is above such things) He is God. The One, The Irresistible."
                },
                {
                    "id": 24,
                    "transliteration": "SUB'HAANAL-LATHEEASRAA BIABDIHI (Q.17.V:1)",
                    "translation": "Glory be to (God) Who did take His servant for a journey. "
                },
                {
                    "id": 25,
                    "transliteration": "SUB'HAANAHU IDHAA QODOO AMRAN FA INNAMAA YAQUULU LAHU KUN FAYAKUUNU. (Q.19.V:35) ",
                    "translation": "Glory be to Him! When He determines a mafter, He only says to it, \"Be\", and it is. "
                }
            ]
        },
        {
            "id": 4,
            "name": "KHUTUBATUSH-SHEIKH SUB'H SUB H AANAL-ABADIL-ABADI: \n SUPPLICATION OF THE SHEIKH ",
            "content": [{
                    "id": 1,
                    "transliteration": "SUB'HAANAL-WAHIDIL-AHADI 'AANAL-FARDIS-SOMADI, SUB'HAA RAAFIUS-SAMAAI BIGAYRI AMADIN NA SUB'HAANA MAN BASATOL-ARIDO ALAL-MAAI FAJAMADA, SUB'HAANA QOOSIMAL-ARIZAAQI WA LAM YANSA AHADA, SUB'HAANA MAN TA'AZZAZA BIL-AZOMATI WAL-KIBRITAI, SUB'HAANA MAN TAFARRADA BIL-JALAALI WAL-BAQ0OHI, SUB'HAANA MAN TASOGGARA KULLI SHAYIN Ll'AZOMATIHI, SUB'HAANA MAN QOHHARAL-'IBAADA BIL-MAOTI, SUB'HAANA MAN LAA QUWWATA ILLA QUWWATUHU, WALAA KHAYRAN 1LLA KHAYRUHU WALAAAMUNAN ILLAAMUNUHU, WALAA LUTIFAN ILLA LUTIFUHU, WALAA AONAN ILLA AONUHU, WALA FADLAN ILLA FADLUHU, SUB'HAANA DHIL-MULKI WAL-MALAKUUTI, SUB'HAANA DHIL-IZZATI WAL-JABARUUTI, SUB'HAANAL-HAYY1 LADHI LAA YAMUUTU SUB'HAANA LADHI LAM YATTAKHIDH SOOHIBATAN WALAA WALADAN, SUB'HAANA LADHI LAM YALID WALAM YUULAD WALAM YAKUNL-LAHU KUFU WAN AHADUN ALLHUMMA YAA MANKARAMUHU LM YUHADDU, WAQ0DO'UHU LAA YURADDU, WANI'MUHU LAA TUADDU, WA GAYRUHU LAA YURADDU, WANI'MUHU LAA TUADDU, WA GAYRUHU LAA YUQSODU, LAM YALID WALAM YUULAD WALAM YAKUN LAHU KUFWAN AHADUN, SUB'HAANA RABBIKA ROBBIL-11ZZATI AMMAA YASIFUUN WA SALAA MUN ALA-MUR SALEENA WAL-HAMDU LIL-LAHI ROBBIL-AALAMEENA. ",
                    "translation": ""
                },
                {
                    "id": 2,
                    "transliteration": "",
                    "translation": "Glorified be ALLAH forever and ever, Glorified beALLAH, The Unique, The One Who has no partner nor equal. Glorified be  ALLAH, The Only One, The Eternal. Glorified be ALLAH, Who raised the heavens without pillars. Glorified be ALLAH, Who spread the earth on water, and made it congealed. Glorified be ALLAH, The Sharer of Wealth, Who never deny any servant his share. Glorified be ALLAH, Who is Powerful in His Greatness and Pride. Glorified be ALLAH, Who is Unique in His Unique in His Majesty and Everlasting Existence. Glorified be ALLAH, To whose Greatness, everything submits. Glorified be ALLAH, Who subdues His servants by death. Glorified be ALLAH, Who owns all Sources of Power, Fortune and Protection. Glorified be ALLAH, Who possesses all Sources of Mercy, Help and virtue. Glorified be ALLAH, The Owner of Dominion and Royalty. Glorified be ALLAH, The Owner of Might Honour and Force. Glorified be ALLAH, The Alive, The Immortal. Glorified be ALLAH, Who neither has a spouse nor a son. Glorified be ALLAH, Who beget not, nor was He begotten, and there is none co-equal or comparable unto Him. \n OALLAH Whose Generosity is unlimited. \n O ALLAH Whose Judgement cannot be rejected\n OALLAH, Whose Blessing are uncountable. \n OALLAH Whose help is sought. You beget not nor were You begotten, and there is none co-equal or You  comparable unto Glorified be your Lord, the Lord of Honour and power! He is free from what they attrtibute unto Him. And peace be on the ALLAH, Lord of the world. messengers of ALLAH and all the praise and thanks be to It was stated in 'ALMUKHALAH' which was written by shikh Bahaudeen Mohammed, son of Hussain Alharithi Al-Soffuriy Al-Shafiy, that Imam Abu-Haneefah MayALLAH pleases with him, reported to have said that he saw the Almighty ALLAH in his dncerea more m ninety nine times, and swored that if he can see \n ALLAH o, making the number of times he saw and hundred, he mankind on the day of resurrection. would ask ALLAH, The most Exalted, about what shall save the Fortunately, for Abu Haneefah, he saw ALLAH and asked Him His Name, replied: the said question. Therefore ALLAH, Glorified and Exalted be Whoever says in the morning and evening \"Glorified be ALLAH, The Unique, The One; Glorified be ALLAH The Only One, The Eternal. Glorified be ALLAH, Who raised the heavens without pillars. Glorified be ALLAH Glorified be ALLAH , Who neither has a spouse nor a son. is none like Him. Who begets not nor was he gotten and there Whoever says this prayer shall be saved from entering the hell. "
                }
            ]
        },
        {
            "id": 5,
            "name": "BENEFITS ",
            "content": [{
                    "id": 1,
                    "translation": "This Beautiful Names could be recited for the purpose of protection against evil and healing of ailments. It should be repeated (131 or 329) times, after which the supplicant would say the following prayer. SALAAMUN ALAA NUHIN FIL-ALAAMIN SALAAMUN ALAA IBRAHIM SALAAMUN ALAA MUUSA WA HAROON SALAAMUN ALAA IL-YAASEEN WA SALAAMUN ALAL-MURSALEEN WAL-HAMDU ULAN' ROBIL-ALAMEEN. MEANING:-Peace be upon Nuh (Noah) among the mankind, jinns and all that exists. Peace be upon Ibraheem (Abraham)! Peace be upon Musa (Moses) and Harun (Aaron)! Peace be upon Ilyasin! Peace be on the Messengers! And praise and thanks be to ALLAH Lord of the World! After the completion of the above prayer the supplicant should read the appropriate poetic verse (i.e.v.15) of fat'hul-baary. Likewise, it could be written on a black slate and washed for the sick to drink. He shall be healed In-Shaa ALLAH'. "
                },
                {
                    "id": 2,
                    "translation": "AR-RAZAAQ (The Provider) This Beautiful Name could be recited for the purpose of getting means of living with ease. It should be repeated 308 times by the supplicant who chooses to recite it day and night. At the end of the recitation, the supplicant should read the poetic verses 21, 25, 26, of Fathul-baary 3 or 7 times. The supplicant can consult the learned theologians of further use of AR-RAZAAQ. "
                },
                {
                    "id": 3,
                    "translation": "AL-LATEEF (The Subtle One) This BeautifulName could be recited for the purpose of success and prosperity. It is very beneficial. It should be repeated 129 4444 or 16, 641 times. The number of its recitation depends largely on the choice of the supplicant. After the recitation, the supplicant should read the poetic verses 36 and 27 of Fathul-baary 3, 7, or 11 times. Recite AL-LATEEF and you shall have the mercy of ALLAH. "
                },
                {
                    "id": 4,
                    "translation": "AL-JAAMIU (The Gatherer) This Beautiful Name is very efficacious to boost the supplicant's business. ALLAH shall make the supplicant (by this Name) prosperous in his trade. It could also be used to bring back home the absentee especially the one who has overstayed at overseas. "
                }
            ]
        }
    ]
}