{
    "title": "Jam'yat Luthfullahi Prayers",
    "subhead": "Jilsatu Lutfullahi",
    "author": "Fadhilat Shaykh Muh. Robiu Adebayo Abdul Malik R.T.A Al-Ilory",
    "endnote": "",
    "name": "Bismillahi Rahaman Raheem\n In The Name of Allah, The Compassionate The Merciful.",
    "content": [{
            "id": 1,
            "name": "LAYSA LAHA MIN DUUNIL-LAAHI KAASH I FATUN \n No one but Allaah can disclose it. (Q 53: 58) 153 Ce. ",
            "content": [{
                    "id": 1,
                    "transliteration": "LAJAHTU ILAL-MAWLAL-ALI JALLA SHAHNUHU LIDAFUHI WA JALBI QOD KAFANIYA HISINUHU",
                    "translation": "In the Lord the Most High Whose Affairs are Mighty I seek protection and provision. His fortress is sufficient for me. "
                },
                {
                    "id": 2,
                    "transliteration": "YAQEENI YAQEENI SHARRA BAGIN WA MOKIRIN WA SHUGULI JAMOLU-L-HASHIMIYYI WA HUSINUHU ",
                    "translation": "I am certain, I am certain That the transgressors the evil planners Shall have no success I am obsessed by the beauty and goodness Of the Hashimte Prophet. "
                },
                {
                    "id": 3,
                    "transliteration": "SARA FI URUQI HUBBUHU WA MODIIHUHU DAWAHI WA IIIDADI LIMO HAMMO HUZINUHU ",
                    "translation": "In my neins flows his love, And his eulogy is my preparation For comforting the aggrieved. "
                },
                {
                    "id": 4,
                    "transliteration": "LAHU WA ILAYHI MUSHTAKAYA WA GAYRUHU SARABUN FALA YARWI WAHASBIYA MUZPNUHU ",
                    "translation": "To Him I lodge my complain He is the rain And others are mirage: A mirage gives no water. Sufficient for me are His toment rains. "
                },
                {
                    "id": 5,
                    "transliteration": "HADIMTU BIZKRI-L-MUSTOFA MO YARUMUHU HADUWI BIIMIILLAHI MON JALLA SHAHNUHU ",
                    "translation": "With the eulogy of Al-Mustapha I have destroyed the plan of my foe. By the permission of Allah -Whose affairs are Mighty I have overcome the foe. "
                },
                {
                    "id": 6,
                    "transliteration": "ARIL-ABUDA YA MAWLAL-BARAYA BISUR'ATIN HALAAKAADUWWIFANNUHULAYSAFANNUHU ",
                    "translation": "Show your sevant O Lord of the creation How You have destroyed the foe's plan: Destroy not the foe."
                },
                {
                    "id": 7,
                    "transliteration": "MAHAL-ILMI ANNI FI JANABIKA QOSIRUN ELAYICA INTISABI WAHUWA GAYRUICA KINNUHU ",
                    "translation": "You know how weak I am by Your side Upon You I depend: While the enemy seeks power From Your creatures. "
                },
                {
                    "id": 8,
                    "transliteration": "NAKHAFU WA INNA JARUHU WA ABIDUHU WAMONI KHAZA BIL-MAKHLUQI QOD-TAMMO AMNUHU ",
                    "translation": "Panic we are though, We are Allah's sevants and protege Defenceless is he who seek refuge in a creature "
                },
                {
                    "id": 9,
                    "transliteration": "DARAHTU BIHI YA WAYLAHUM FI NUHURIHIM FAHALIK ADUWWAL-LAHI WAL-YAMUHU AENUHU ",
                    "translation": "By His Power I send Back to the enemies their curse: Destruction shall be for Allah's foes. "
                },
                {
                    "id": 10,
                    "transliteration": "WAQOFTU BIBABIL-HAQQI JALLA JALALUHU WUQUFA DITRAR1 MON ATAL-KULLAMONNUHU ",
                    "translation": "At the doorstep of the Truth, Mighty be His Greatness I stand, in obedience and submission, Seeking His Grace. "
                },
                {
                    "id": 11,
                    "transliteration": "NASORTA UBAYDAN WAQTA DHULLI WA FAQOTIN ALAHEENI LA FIL-L-KHALQI MON BANA AONUHU ",
                    "translation": "O Lord! You give succour To thy servant in depression and wretchedness When no one in the world Comes to his aid."
                },
                {
                    "id": 12,
                    "transliteration": "ADIM KARAMON YA ZAL-ICARIIMI WA ZIDLAHU MONALAMBIHI QOD QORRAFI DAHRI AENUHU ",
                    "translation": "O The Noble God Add to his success that which will be The comfort of his eyes."
                },
                {
                    "id": 13,
                    "transliteration": "LITAKFIL-IDA WALITAKFINI-D-DAHRA SAYIDYYI FA1NNYA ABUDU LLAHI WA-L-KAWNU KAWNUHU",
                    "translation": "O my Lord Be sufficient for me As protection against The foes and odds of time For I am your servants And the entire existence Is Yours. "
                },
                {
                    "id": 14,
                    "transliteration": "LAHU ABADDAN SAYRI WA QOSDI WA WIJHATI WA MO DORRA GAYRUS-SODDI MINIHU WA BAYNUHU ",
                    "translation": "For God's sake forever Shall be my movement, intention and focus No avertion but His Can trouble ( mankind ). "
                },
                {
                    "id": 15,
                    "transliteration": "HUWAL-WAAHIDUL-QOHARU HAQON WA AMRUHU HUWAL-AMRU MINIHU-L-ABDU QOD ZAL'A SHAYNUHU ",
                    "translation": "He is really Unique, the Subduer His command is the real command. By Him the servant's problem Is solved. "
                },
                {
                    "id": 16,
                    "transliteration": "KASHAFTU BIHI KULLAL-KURUBI WA INNANI WA SOHABI KAFANA HISNUHU THUMMO SOWNUHU ",
                    "translation": "By Him My grief is succoured And for me and my companion His Defence and Protection Are Sufficient. "
                },
                {
                    "id": 17,
                    "transliteration": "AJIB YA ILLAHI MON YUJIBU IZADUHI BIKAS-SITRU DAHRAN LIL-UBAYDI WA ZINUHU",
                    "translation": "Answer 0 my Lord! You are the Lord Who answers When He is called. . In You The small servant Does take shelter Every now and again! "
                },
                {
                    "id": 18,
                    "transliteration": "SHAFAHUN LIMO YAI-fRU BIZIKRIKA DAIMON BIZIKRIKA QOLIBAL-ABDI QOD ZAL' A GAYNUHU ",
                    "translation": "Cure O Lord The one who remembers You Of his ailments With Your remembrance His worries subside. "
                },
                {
                    "id": 19,
                    "transliteration": "FASOLLI SOLATAN MINKA YA HAYYU SAMIHI ALAL-MUSTOFA MON AENUHUNUNUAENUHU",
                    "translation": "Send Your Blessings 0 the Alive, Who hears me, Upon the chosen Prophet. (7)"
                },
                {
                    "id": 20,
                    "transliteration": "HADAL-KHALQO TURRAN SOLLIYYANNA WA SALLIMON ALAYHI M AHAL-ASIHAIN WA LIYAHLU SHANUHU ",
                    "translation": "He, the Noble Apostle, Has guided the entire world. O Lord. Send Blessings and Peace On him and his companions And let his honour To go on thriving. "
                }
            ]
        },
        {
            "id": 2,
            "name": "INNAA KAFAYNAAKAL MUSTAHZI'EENA For sufficient are We unto You against those who scoff. (Q 15: 95) 177Ce. ",
            "content": [{
                    "id": 1,
                    "transliteration": "INI' STAJARTUD-DAHRA BIL-MUHAYMINI BIZAL-JAWARI HUZTU KULLA MAHMONI ",
                    "translation": "In God, The Protector I seek refuge. With such refuge I have attained security In its entirety. "
                },
                {
                    "id": 2,
                    "transliteration": "NILTULLAZI QOD RUMTU KHUZTUL-AMALA BIL-MUHMINIL-KA I' FI WA JALLA WA HALA",
                    "translation": "With God The Guardian of faith The All-Sufficient So Great and Mighty I have realised my hope. "
                },
                {
                    "id": 3,
                    "transliteration": "NILTULLAZI FATAL-FUHULA TURRAN AQULU DHKA LIL-ILAHI SHUKURAN",
                    "translation": "I have attained What eluded the giants As a whole. I have so voiced To thank the Lord. "
                },
                {
                    "id": 4,
                    "transliteration": "ADIM ILAHI NIHMOTI WAZIDHA WA TAMMIMONIHA ABADAN WA SUNIHA ",
                    "translation": "Make my blessings, O Lord, Eternal and many folds And secure them. Again and again. "
                },
                {
                    "id": 5,
                    "transliteration": "KAFAL-ILAHU I'AYDA KULLI KAIDIN WA QOD WAQONA SHARRA KULLI HASIDIN ",
                    "translation": "Sufficient is God As over comer of the deceiful He has protected us From mischief of the envious. "
                },
                {
                    "id": 6,
                    "transliteration": "FALALTU SAYFA KULLI SOILLIN ATA MOTA ROJAHATU LIL-ILAHI MUKHBIT A",
                    "translation": "Sword of every fighter I have destroyed When I returned To God As a seeker of (His ) refuge."
                },
                {
                    "id": 7,
                    "transliteration": "NAUDDUHUM KHAMSAM BAQO ALAYNA YAKIFIHUMUL-MAOLA FAHUM QOLAON A",
                    "translation": "In five clusters* The enemies are grouped To suprisely descend on us As they loathe us God shall conquer them. "
                },
                {
                    "id": 8,
                    "transliteration": "AHALIKHUMU WA' SHDUD ALAYHIM WATIATAK AHZA AZIZ WALTUNILHUM NIKMOTAK",
                    "translation": "The Treacherous The Mischevious The Traitor The Sadist The Conspirator  Destroy them And put to them Difficulty Dole to them Nemesis from You. "
                },
                {
                    "id": 9,
                    "transliteration": "KAFAYTA HULIL-HAZMI KULA BAGIN BIHIMU ILAHI FAKFINI ZAL-BAGI",
                    "translation": "You saved Apostles of resolute From mischief makers In the past: My Lord Protect me from He who aims mischief At me. "
                },
                {
                    "id": 10,
                    "transliteration": "ABAO IQOMOTA LIDINIKAL-QOWIIM 'WA-AKHAZU BISHIRKI ZULMOKAL-HAZIM ",
                    "translation": "The deceitful have Rejected Your Right-Guided Religion And have taken The path of infidelity A great sin against You. "
                },
                {
                    "id": 11,
                    "transliteration": "LA TUUTIHIM MOKRAM BUAYDAL-YAOMI WANZIL IQOBAKA BIHAYYIL-QOWMI",
                    "translation": "Give them not The chance to thrive on with deceit Send forth Your penalty On their location."
                },
                {
                    "id": 12,
                    "transliteration": "MONZILU ZULU GADOBAN WA ADLAN WA ATINA YA ROBBI DAHRAN FADLAN",
                    "translation": "Put them in abode of dishonour To show annoyance and justice And grant us 0 our Lord Favour Every now and again. "
                },
                {
                    "id": 13,
                    "transliteration": "SUHQON LLAHUM DAMMIRHUMU JAMIHAN FAQOD BAGAW JANAABIKAL-MUNIIHAN ",
                    "translation": "Away with them Put them all In destruction For they have transgressed Your fortified bound. "
                },
                {
                    "id": 14,
                    "transliteration": "TARUDDU MO'KADU ILA NUHURIIHIM WA KHUZIiiUMU BIZULIMIHIM WA JAORIHIM",
                    "translation": "Return unto them Their guile Seize them with punishment • For their oppressiorf and tyranny. "
                },
                {
                    "id": 15,
                    "transliteration": "HATTIK SUTURAHUM WA DAMMIR MOLAHUM WA MULIKAHUMWANASILAHUM WA MOLAHUM ",
                    "translation": "Tear down their subterfuge Put in disarray Their estate, their offspring And all that belong To them. "
                },
                {
                    "id": 16,
                    "transliteration": "ZALZIL UMURAHUM WA FARRIQ SHAMLAHUM .WA ADIKHILIL-BAGDOAH1NABAYNAHUM",
                    "translation": "Shake their affairs And make their congress Disunited Enter into them, hatred At all time."
                },
                {
                    "id": 17,
                    "transliteration": "AMINU YA ROBBI BIJAIL-MUSTOPHA SOLLA ALAYHI ROBBUNA WA SHARRAFA ",
                    "translation": "Answer my call O Lord I besearch You With the htmour Of the chosen Apostle Peace and Blessings of our Lord Be bestowed on him. "
                },
                {
                    "id": 18,
                    "transliteration": "YA. ROBBI Y 'A ROBBI BIJAHIL-HADI AJIB UBAYDAKA MOTTA YUNADI ",
                    "translation": "O Lord O Lord Answer Your servant Whenever he calls. I beseech You With the honour Of the Guide (To the right path) "
                },
                {
                    "id": 19,
                    "transliteration": "YASTAHSILUL-JABARU QAOMAN RC:MU BIMONI HUMU LADAYKA DHARA QOMU",
                    "translation": "Uproot, O Almighty Compeller, People who seek Destruction for those Who stand for You At all times. "
                },
                {
                    "id": 20,
                    "transliteration": "NIHMOL-WAKIILU WA HUWA HASBIL-LAHU HASBI LIMO ARJUHU AO AKHSHAHU",
                    "translation": "The Best Disposer of Affair Is sufficient for me In all that I Want Or fear. "
                }
            ]
        },
        {
            "id": 3,
            "name": "YUQRA'U FI KULLI AKHIRID-DUHAI \n AT THE END OF EVERY DU'A (3/7Ce).",
            "content": [{
                    "id": 1,
                    "transliteration": "YAH MAN IDHA DOQOL- FADO WATARAKAMOT JUMALU DAWAH ",
                    "translation": "I call Upon You 0 Lord, You provide relief With Your favour"
                },
                {
                    "id": 2,
                    "transliteration": "FARRAJITAHA BIDAQIQOTIN MINI HUSINI LUTIFIKA YAH-ILAHI ",
                    "translation": "When the moment is tense And when calamity moves To its height. "
                }
            ]
        },
        {
            "id": 4,
            "name": "DU'A'UL-ISTIGAATHA. \n DU'A FOR FAVOUR YAA LATEEF - (1,129) ",
            "content": [{
                    "id": 1,
                    "transliteration": "YAH- LATIFAS-SUNIHI YAH-MAN KULLAMA DAHAMAL-AMURU JALLA MA DAHAMON ",
                    "translation": "O The Most Graceful In (His) deads 0 Lord Who correct situations When they go berserk "
                },
                {
                    "id": 2,
                    "transliteration": "YAH- GIYATHAL- MUSTAGITHINA WA YA MON MODOL — HUKIMU IDHA MA HAKAMON.",
                    "translation": "O the Giver of succour To the be wildered I beseech You Whose decision holds."
                },
                {
                    "id": 3,
                    "transliteration": "NAFFISIL — AMRA ALAYNA SURIATAN INNAMAL — AMURU ALAYNA AZ.OMON",
                    "translation": "Relieve us Of our predicament In time For it has become unbearable. "
                },
                {
                    "id": 4,
                    "transliteration": "WAS — TAJIB MINNA DUHA'HAN KARAMON YAH- KARIMU ANTA ROBBUL- KURAMO ",
                    "translation": "Answer our prayer In honour O the Generous One You are the Lord Of the Noble servants. "
                }
            ]
        },
        {
            "id": 5,
            "name": "LI-GALABA'TIL-ADUWINI WAIHLAAKIHIM. AHAMU SAQOKU HALAU YASU - (111) ",
            "content": [{
                    "id": 1,
                    "transliteration": "AUDHU BILLAHI MINI UMUYYIN WAMIN SOMOMIN WAMIN JUZAMIN WABARSIN HAKADH A SHALALIN ",
                    "translation": "I seek refuge In God From blindness, deafness Leprosy and paralysis. "
                },
                {
                    "id": 2,
                    "transliteration": "HABLI BANINAM BANATIN ANTA DHUKARAMIN WAZID SALAMATA FI JISMI BILA MALALIN",
                    "translation": "Give me Sons and daughters You are the Giver of Generousity Give more peace To me Without weariness. "
                },
                {
                    "id": 3,
                    "transliteration": "MAQQIT IDAN BIJUIN ANTA MUNTAQIMUN WABIS- SUDAHI WADAUHIN THUMMA BIDDUMALI ",
                    "translation": "Afflict our foes With hunger, headache and pustule You are the Avenger. "
                },
                {
                    "id": 4,
                    "transliteration": "SALLIM ABEEDAKA MIN JUIN WAMIN SAQOMN WAMIN JUNUUNI WADASIN HAICAZA FASHALIN ",
                    "translation": "Save Your little servant From hunger, ailments, madness, failure And from being trampled upon. "
                },
                {
                    "id": 5,
                    "transliteration": "QOHIR HUSADALANA WAQ,HIDIHUMBIL-WARA1V11 ICHAWWIF'HUMYAH-ROBBANANAQQ1S1HUMBIL-I'LALI ",
                    "translation": "Conquer the envious Sit them down. With swelling Cause fear in them 0 our Lord Reduce them with ailments. "
                },
                {
                    "id": 6,
                    "transliteration": "KUN LI WALIYAN NASIRAN ANTA HAFIZUNA WAHSIN !WAWA TIMANA MANNA WABIL-FADILI ",
                    "translation": "Be for me A friend and Helper You are our Protector Give us good end.. As blessing and favour. "
                },
                {
                    "id": 7,
                    "transliteration": "HAYYUN Q0YYUMUN FAHAYYI KULLA HARAKATINA gAZAKA AR' WAHINA BIL-ILMI WAL-AMALI ",
                    "translation": "O The Alive, The Self-Subsisting Breath life into our action And into our soul So we can practice What we learn. "
                },
                {
                    "id": 8,
                    "transliteration": "LAYSA SHABIHU LIROBBIL-KHALIQI ZU ABADIN WA-ANTA MALIJAUNA QOSDAN WAFIL- AMALI",
                    "translation": "There is no like Unto the Creator of tile world He is Everlasting Cr Lord You are our refuge In purpose and hope. "
                },
                {
                    "id": 9,
                    "transliteration": "ALAYKA TUKLANU FIS-SIRRI WAFIL-ALANI WAFIS —SARRAI WAD-DORRAI WAFT WAJALIN",
                    "translation": "Upon You we depend In secret and open Whether at peace or in troubles. "
                },
                {
                    "id": 10,
                    "transliteration": "YAHL-LAHU YAHL-LAIRJ YAH-ALLAHU YAH-ICHALIQI DOMMIN RIDOICALANA MONNA BILA ICHALALIN.",
                    "translation": "O ALLAH! 0 ALLAH!! 0 ALLAH!!! 0 my Creator Grant us Your Pleesure Devoid of defect. "
                },
                {
                    "id": 11,
                    "transliteration": "SOLLI WASALLIM ALA KHAYRIL-BARIYYATI YAH MONI HUWA RAHMATUL-UZMAN BIZAL-ADILI ",
                    "translation": "Send Your Blessings and Peace On the best of mankind I beseech You Who own the greatest of blessings. "
                }
            ]
        },
        {
            "id": 6,
            "name": "DU'AU MUBAARKUN LITAFRIJI HAMMIN WAL-GAMMIN. \n DU'A FOR RELIEF FROM GREF AND SORROW. ",
            "content": [{
                    "id": 1,
                    "transliteration": "YAH-MON YARA MAFI DOMIRI WA YASIMAUN ANTAL-MUADDU LIKULLI MAN YUTAWAQOUN ",
                    "translation": "O Lord Who sees and hears my conscience You are ready For all expectation "
                },
                {
                    "id": 2,
                    "transliteration": "YAH-MON YUROJJA LISHADAIDI KULLIHA YAH-MONI ILAYHIL-MUSHTAKA WAL-MUFZAUN",
                    "translation": "O Lord I whom lie all hope against all odds O Lord In whom the troubled and the fri-ghtered Seek refuge."
                },
                {
                    "id": 3,
                    "transliteration": "YAH-MONI KHAZAINU RIZIQIHI Fl QAWLI KUN UMUNUN FAINNAL-KHAYRA INDAKA AJIMAUN ",
                    "translation": "O Lord Whose provision stores Are enclaved in the word: 'BE' All forums belong to You. "
                },
                {
                    "id": 4,
                    "transliteration": "MALI SIWA FAQRI ILAYKA WASILATUN FABILIFTIQORI ILAYKA FAQRIYA ADIFAUN",
                    "translation": "I have But poverty as means Of reading You By imploring You for help My poverty is nip in bud. "
                },
                {
                    "id": 5,
                    "transliteration": "MALI SIWA QORIHIN LIBABIKA HILATUN FALAIN RUDIDTU FA-AYYABABINI AQRAUN",
                    "translation": "I have But 'knocking' on YOU,' door As trick If I am rejected Whose door then should I knock at . "
                },
                {
                    "id": 6,
                    "transliteration": "MAN ZALLADHI ADIUN WA-AHTIFU BISIMIHI IN KA- NA FADILUKA AN FAQIRIKA YUMUNAUN ",
                    "translation": "Whose name Should I call If Your fortune Is put away From Your poor servant. "
                },
                {
                    "id": 7,
                    "transliteration": "HASAH LIJUDIKA AN TUQONNITO ASIYAN AL-FADILU AJIZALU WAL-MAWAHIBU AOSAUN ",
                    "translation": "How perfect Is Your Generosity That You did not Shatter the sinner's hope (Your) fortune is well enriching And (Your) Gifts are too exhorbitant. "
                },
                {
                    "id": 8,
                    "transliteration": "WABI DHULLI QOD WAFAYTU BABAKA ALIMAN ANNA TADHALLULA INDA BABAKA YANFAUN ",
                    "translation": "With humility I feel my presence At Your door Knowing that humility At Your door benefits. "
                },
                {
                    "id": 9,
                    "transliteration": "WAJA'ALTU MU'TAMIDINI ALAYKA TAWAKKULAN WABASASTU KAFFIYA SAILANI ATADORAUN",
                    "translation": "I rely wholly on you And stretch my palms Asking and imploring (Your Blessings). "
                },
                {
                    "id": 10,
                    "transliteration": "FABIHAQQI MONI AHBABTAHU WABAHATH-TAHU WA-AJABTA DA'WATA MON BIHI YUTASHAFAUN ",
                    "translation": "I beseech You With whom You Loved And sent (to the world). For You (indeed) ) love the call Of the intercessor. "
                },
                {
                    "id": 11,
                    "transliteration": "IJIAL-LANA MIN KULLI DIQIN MMAKHRAJAN WAL-TUF BINA YA MAN ILAYKAL-MARIAUN",
                    "translation": "Show us A way out of depression And be graceful to us O Lord To whom every thing Shall return. "
                },
                {
                    "id": 12,
                    "transliteration": "THUMMOS-SOLATU ALAN-NABIYYI WA-AHLIHI KHAYRIL-ANAMI WAMAN BIHI YUTASHAFAUN",
                    "translation": "Blessing of ALLAH. Be upon the (Noble) Prophet. And His households He is the best Of mankind And the intercessor. "
                }
            ]
        },
        {
            "id": 7,
            "name": "",
            "content": [{
                    "id": 1,
                    "transliteration": "SALAMUNI ALAYKUM HALATAL-QURIBI WAL-BU'DI SALAMUM BIHI TAZDAADU ROBITOTAL-WUDDI",
                    "translation": "Peace be on You. Whether at far Or at close With peece tie of love Is fastened"
                },
                {
                    "id": 2,
                    "transliteration": "SALAMUN BIHI TAHYAN-NUFUSU WAYANJALI BIHI KULLU KARIBIN MAH SALAMIN BILA HADDIN",
                    "translation": "With Peace Souls Continue to live And grief gets relieved To unlimited extent"
                },
                {
                    "id": 3,
                    "transliteration": "SALAMUMRI-IN LAM TABUQO MINIHU BAQIYYATIN. SIWA NOZORIL-AE NAY NI AO SHAHWATAL-QOLBI",
                    "translation": "Peace be on The leader of the time The Grand khalifah Awwal O our Lord Give him more protection."
                }
            ]
        }
    ]
}