{
    "name": "Nuniyat Ibn Malik",
    "subhead": "Supplication with Ayatil-Kurisiyyi",
    "author": "Fadhilat Shaykh Muh. Robiu Adebayo Abdul Malik R.T.A Al-Ilory",
    "endnote": "It is our hope that these few virtues of The Noble Verse of The Throne are sufficient. There are many virtues of The Verse Ayatul¬Kursiyyi, that are not mentioned in this book. Anyone who wants to know more about the efficacy of Ayatul-Kursiyyi should contact the knowledgeable Islamic Scholars.\n It is prescribed that the aforementioned verses should be written on a daily basis for the pregnant woman to drink in her nineth month of pregnancy. She should be taking the divine mixture daily, right from the beginning of the nineth month until the day of delivery. Insha ALLAH she would deliver peacefully",
    "content": [{
            "id": 1,
            "name": "Chapter One",
            "content": [{
                    "id": 1,
                    "transliteration": "ALLAHU LAI LAHA ILLA HUWAL HAYYUL QAYUUM",
                    "translation": "NONE HAS THE RIGHT TO BE WORSHIPED BUT HE ALLAH THE EVER LIVING, THE ONE WHO SUSTAINS AND PROTECTS ALL THAT EXIST"
                },
                {
                    "id": 2,
                    "transliteration": "LUTFI LATEEFUN WA LUTFUL LAHI YASH-MALUNA FIKULLI HALIN B1 MANNI THUMMA IHSAANI",
                    "translation": "My Bliss is from ALLAH, The Beneficient, Whose mercy encompasses us. With His bounty and benefaction We are endowed."
                },
                {
                    "id": 3,
                    "transliteration": "LIHAHI SIRRUN HASEEMU FI KHAL1QOTIHI TAJREE HALAIL QODAH MIN SIRRI RAHAMAANI",
                    "translation": "In the Creature of ALLAH. There is a marvelous mystery, For man is unconscious OfwhatALLAH, The Beneficient, Decrees for him."
                },
                {
                    "id": 4,
                    "transliteration": "LAUS -SAMAWATU MA FIHA SIWAA'U ALA, BI AMRIHI- LI KAONU DHAKA-L KAONU KAO NAANI",
                    "translation": "To ALLAH belong the seven heavens: Nothing exists therein but He. By His Command the entire existence Came into being; this life and the thereafter Are by His Will. "
                },
                {
                    "id": 5,
                    "transliteration": "LAUS -SAMAWATU MA FIHA SIWAA'U ALA, BI AMRIHI- LI KAONU DHAKA-L KAONU KAO NAANI",
                    "translation": "To ALLAH belong the seven heavens: Nothing exists therein but He. By His Command the entire existence Came into being; this life and the thereafter Are by His Will. "
                },
                {
                    "id": 6,
                    "transliteration": "LAUS -SAMAWATU MA FIHA SIWAA'U ALA, BI AMRIHI- LI KAONU DHAKA-L KAONU KAO NAANI",
                    "translation": "To ALLAH belong the seven heavens: Nothing exists therein but He. By His Command the entire existence Came into being; this life and the thereafter Are by His Will. "
                },
                {
                    "id": 7,
                    "transliteration": "ALLIF ILAHI QULUBA-L-MUSLIMEE NA LANA LAELAN NAHRAN ALA TAFSEERI QUR' AN",
                    "translation": "O my Lord! Pull towards the understanding of the Qur'an The hearts of the Muslims Day and Night."
                },
                {
                    "id": 8,
                    "transliteration": "HUWA-L HAFEESU LANA, HUWA-ROQEEBU 1.ANA, HUWA-L MUJEEBUN LIDAHINHI BISUR' ANI",
                    "translation": "He is ALLAH, Our Protector and Watcher. He answers His caller in time."
                },
                {
                    "id": 9,
                    "transliteration": "LA SHAEA YAHDILUHU, LA SHAEA YUSH-BIHUHU WA LA YUMA TH- THILUHU QOD JALLA FISHAANI",
                    "translation": "To Him nothing is equal. To Him nothing is comparable. Unto him nothing can be likened. He is so exalted for all affairs"
                },
                {
                    "id": 10,
                    "transliteration": "AQHIR HIDAANA WA SHATIT SHAMLA HASIDINA WA NAJJINA MIN SHURURI LI-NSI WALJAANI ",
                    "translation": "O Lord! Conquer our enemies, Put asunder their association And Save us from the evils of men and demons. "
                },
                {
                    "id": 11,
                    "transliteration": "ALLAHU YUKRIMUNA, ALLAHU YURSHIDUNA, ALLAHU YARZUKUNA FI KULLI AZMAANI ALLAH",
                    "translation": "Shall honour us, ALLAH shall guide us and ALLAH shall provide for us For ever and ever. "
                },
                {
                    "id": 12,
                    "transliteration": "LA MITHLA RABBI ILAAHI FI JALALATIHI WALA YUSHARIKUHU FI MULKIHI THAANI",
                    "translation": "Nothing is comparable To my Lord,ALLAH, In His Majesty: Nothing can be Associated with Him. "
                },
                {
                    "id": 13,
                    "transliteration": "ALLAHU ALLAHU YA ALLAHU FARHAMNA BI RAHAMATIN MINKA YA RAHMANA AKWAANI ",
                    "translation": "ALLAH! ALLAH! O ALLAH! Give us Your Blessings. O I call on You. The Most Compassionate. For the entire creation!"
                },
                {
                    "id": 14,
                    "transliteration": "HUWA-L GAFUURU WA WAHHABUN LI RAHAMATIHI YUUTI-L HALAALA BILA TA'ABIN WA WUJIDAANI ",
                    "translation": "He is the All-Forgiving And the All-Giver Who endows His servants With the lawful things Without trouble nor grief "
                },
                {
                    "id": 15,
                    "transliteration": "ALHIM UBAIDAKA ILMAN YASTAFEEDU BIHI JAMEEHU KHALIQIKA FI SIRRIN WA IHLAANI ",
                    "translation": "O Lord! Teach Your humble servant Much knowledge from which Your Creation can benefit Secretly and openly"
                },
                {
                    "id": 16,
                    "transliteration": "LA ANTA HAQQUN BINASRI-L MUUMENEENA AJIB KAMA WA' ADTA LANA WA' ADAN BI QUR' AANI ",
                    "translation": "Certainly, You are the true Helper of the believers.. Respond to our calls As You promised In the Qur'an. "
                },
                {
                    "id": 17,
                    "transliteration": "ULI MUMENEENA MINAL MAOLA MUSAAHADATUN BINASRIHI LAUMU WANNASRU NASRAANI ",
                    "translation": "The believers derive Their help from their Lord, Both on earth And in the hereafter."
                },
                {
                    "id": 18,
                    "transliteration": "ALLAHU ALLAHU SULTANUN LIASMAHIHI ALLAHU AASOMU MAN YAHDI LI GUFRANI",
                    "translation": "\"ALLAH!\", \"ALLAH!\" Is the most Awesome of His Names ALLAH Guides us to the path of Forgiveness. "
                },
                {
                    "id": 19,
                    "transliteration": "UWAN NABIYYU-L KAREEMU-L KHATIMU RRUSULI WA AL NABIYYUN BUAEDA-L MUSTAPHA AANI",
                    "translation": "(Muhammed) is the most noble prophet The last of the Apostles he is: No messenger shall come After the most chosen one! '"
                },
                {
                    "id": 20,
                    "transliteration": "WA-UWAR RASUULU WAA RABBU-L KHALIQI KHAYYARAU BI JUNDI AYYADAU FI KULLI BULDAANI",
                    "translation": "He is the messenger that is most cherished By the Lord of Creation! He helped him with \"hosts\" Wherever he dwelled!"
                },
                {
                    "id": 21,
                    "transliteration": "AD'UUKA ROBBI ANIL-NII MIN SHAFAATIHI ANJU BIHA ROBBI MIN HAOLIN WA HAERAANI ",
                    "translation": "O my Lord! Grant me the intercession of Muhammed So that I may be free from all fears and troubles Of the resurrection day. "
                },
                {
                    "id": 22,
                    "transliteration": "LA WAHIDUN MIN JAMIIHI-L KHALQI DHU ABADIN WALA BAQOH-UN LAUN MIN DUNI RAHAMONI ",
                    "translation": "None of His Creatures shall forever live: None shall remain existing But He, The Most Compassionate. "
                },
                {
                    "id": 23,
                    "transliteration": "HAYYUN WA KULLUL WARA YAHAYA BI HIKMATIHI LAOLAHU MA TAHBA MIN HAYYIN WA HUMRAINI ",
                    "translation": "He is the Ever-living. The entire World exists by His Wisdom. But for His sake, Nothing would have been. "
                },
                {
                    "id": 24,
                    "transliteration": "YASIR MAEESHATANA, BALLIG MATOLIBANA SAHHIL MAQOSIDANA NAELA BIRIDWAANI ",
                    "translation": "O Lord! Ease for us our livelihood, Grant us our requests, And fulfill our wishes With Your Pleasure. "
                },
                {
                    "id": 25,
                    "transliteration": "YAA RABBANA KHALIQO-L AKWAANI AJMAEHA ULTUF BINA ANTA DHU LUTFIN WA GUFRAANI ",
                    "translation": "O our God, The creator of the whole creation! Give us Your Favour, For You are The owner of Grace and Forgiveness! "
                },
                {
                    "id": 26,
                    "transliteration": "AL-HABDU YAAJISU ANI HAOLI WAQUWATIHI ILLA BIHAOLIKA FI SIRRIN WA IHLAANI",
                    "translation": "The servant is unable and powerless: By Your power, his will is fulfilled In the hidden and open! "
                },
                {
                    "id": 27,
                    "transliteration": "LILAHI FIL-MUSTAPHA ZIRRUN BI BIHSATIHI MAN KAANA RAHMOTUHU-L USMAA BI AKWAANI",
                    "translation": "There is a divine mystery In the messengerhood Of the Blessed Prophet: He is the Prophet whose Bliss abounds the worlds."
                },
                {
                    "id": 28,
                    "transliteration": "QOYYUMIYYATUKA FIINA MUTLAQAN ABADAN LA ANTA SIRRUN SARA FI KULI JISMAANI ",
                    "translation": "Your protection for us is eternal. You are the Real Mystery Of all the existence!"
                },
                {
                    "id": 29,
                    "transliteration": "YA ROBBANAANTA QOYYUUMUN FA-QOWWIMNA ALAEKA MAAMULUNA TURAN BI TUKLAANI",
                    "translation": "O our God! You are the Sustainer And protector of the creation! Make us steadfast on Your path: Upon You we rely in all endeavour."
                },
                {
                    "id": 30,
                    "transliteration": "YA AYYU AYYI LANA-L ARWAHA YA-ROBBANA LA ANTA QOYYUMUNA UNSURNA BI IRFAANI ",
                    "translation": "O The Ever-living! Bring our soul to life. 0 our God! You are our sustainer and protector! Give us Your divine knowledge. "
                },
                {
                    "id": 31,
                    "transliteration": "WA ANZIL LANA RAHAMOTAN IRHAM MASHAYIKHANA USTUR MA' AYIBANA ROBBI BI-IHSAANI ",
                    "translation": "Upon us Bestow your mercy, Bless our' Sheikhs' And replace our misdeeds With our noble acts! "
                },
                {
                    "id": 32,
                    "transliteration": "MINKA ILAEKA JAMIHU-1 KHAIQI KHALIQANA FAKHTIM AWAAQIBANA YUSRAN BI-HEEMAN ",
                    "translation": "All the world come from you All the world shall return to you! Let our end be blessed With much faith in you."
                }
            ]
        },
        {
            "id": 2,
            "name": "LA TAAKHUtHUHU SINATUN WALLA NAOMUN \n NEITHER SLUMBER, NOR SLEEP OVERTAKES HIM",
            "content": [{
                    "id": 1,
                    "transliteration": "LILAHI AQQUN WALA MIN AQQIHI ABADAN NAOMU WA LA SINATUN AQQAN BI SULTAANI",
                    "translation": "ALLAH has the absolute right to be worshiped! He, in essence, does not sleep, Nor slumber overtakes Him! He is The Majesty! "
                },
                {
                    "id": 2,
                    "transliteration": "ALLAHU KHALIQUNA, ALLAHU ROSIQUNA ALLAHU HAFISUNA MIN SHARI SHAETONI",
                    "translation": "ALLAH is our Creator, ALLAH is our Provider, And ALLAH is our Protector, Against the evils of The devil! "
                },
                {
                    "id": 3,
                    "transliteration": "TABBAN LI HASIDINA, BUUDAN LI HAQIDINA WALA YAKUUNA BI AMNIL KULLA AZMAANI ",
                    "translation": "Woe unto our envious ones And away with the spiteful foes: May they have no respite All the time! "
                },
                {
                    "id": 4,
                    "transliteration": "AL HAQQU HUJJATUNA, ALLAHU MATLABUNA AL-FAHMU MARGABUNA PI HUICMI FURQANI.",
                    "translation": "The Truth is our proof ALLAHis our desire! Our goal is to imbibe The wisdom of the Qur'an. "
                },
                {
                    "id": 5,
                    "transliteration": "KHUDHAN IDAANA, WA NAKKID MAN YUSAHIDUHUM KHARRIB BUYUTAUMU KULLAN BIKHIZLAANI r",
                    "translation": "O Lord! Arrest our enemies: Destroy their helpers And demolish their abode With much disgrace. "
                },
                {
                    "id": 6,
                    "transliteration": "DHALIL MUKHASIMANA, BADID JAMAATAHUM KHAYYIB RAJAAHUMU TURAN BIHURMANI. ",
                    "translation": "0 Lord! Humiliate our adversary: Divide their union And deny them their hopes!"
                },
                {
                    "id": 7,
                    "transliteration": "AWWIK MAKAYIDAHUM, AWWIL QULUBAHUMU ANIL HUMU KHASRATAN Fl QORI NIIRAANI. ",
                    "translation": "0 Lord! Abort their plot, Frighten their hearts And destroy them at the bottom of the hell! "
                },
                {
                    "id": 8,
                    "transliteration": "SALLIM ILAAHI MINA NIIRANI ZUMRA TANA BIHAQQI MAN QAD NAJA MIN MAI TUUFAANI. ",
                    "translation": "Save, 0 my Lord, our society From the penalty of fire. We beseech You with Your servant Whom You saved from the flood of \"Tuufan\". "
                },
                {
                    "id": 9,
                    "transliteration": "NARUUMU MINKA DWAMAL KHAERI RAHIMANA LIKULLI AT BA NA A FI SIRRI RAHMONI",
                    "translation": "O The Merciful! We seek from You Everlasting bliss for all our followers On the course of The Most Compassionate "
                },
                {
                    "id": 10,
                    "transliteration": "TUBNA ILAEKA WA MINKA-L AFWA GAAFIRANA FAGFIR LANA MA MADOH MIN KULLI ISYANI",
                    "translation": "To you we repent: From You comes forgiveness; Forgive us our trespasses 0 The All-Forgiving!"
                },
                {
                    "id": 11,
                    "transliteration": "WAKEELUNA ANTA, YA NIHIMA-L WAEELNIU LANA MUUTI-L ATOHI BIMIQDARI WAMEEKZA ",
                    "translation": "You are The Disposer of our affairs. What a Disposer You are! You are the giver of gifts By weight and balance! "
                },
                {
                    "id": 12,
                    "transliteration": "LA ANTA KUNTA MUJEEBAN KULLA DAAWATINA AJIB LANA ROBBANA, ZIDNA BIIMKANI",
                    "translation": "You are The Lord Who responds To all invocations! Heed to our calls and empower us. To propagate Your Religion. "
                },
                {
                    "id": 13,
                    "transliteration": "ALLAHU ALLAHU SULTANU LI ASMAHIH1. LI ROBBINA HUSNAH MIN SIRRI WUJIDAANI \"ALLAH!\",\"ALLAH!\" ",
                    "translation": "Is the Most Awesome of His Names. To our Lord belongs the beauty Of the inner consciousness. "
                },
                {
                    "id": 14,
                    "transliteration": "NURIDU MINKAL QIRAH FI KULLI MASH-HADINA QIRAH KA LIL AOLIYAH FI KULLI AOTOHNI ",
                    "translation": "O Lord! We desire Your reception: Receive us wherever we dwell As You receive Your friends in all nations."
                },
                {
                    "id": 15,
                    "transliteration": "WALIYUNAL LAHU, LASHAEUN YUQO RRIBUHU ALLAHU AHASOMU RABBAN KANA YARHANI",
                    "translation": "Our Master is ALLAH! Nothing is nearer to Him In position: So great a Lord is ALLAH Who shepherds me."
                },
                {
                    "id": 16,
                    "transliteration": "MINKA SALAMU WAMINKAL AMNU SAYYIDANA ZIONA SALAAMAN, WA-AMNA ANTA DHU SHAANI",
                    "translation": "From You come all peace, By You is all protection, 0 our Master! Give us more peace and protection, For You are the God Of all affairs! "
                }
            ]
        },
        {
            "id": 3,
            "name": "LAHU MON Fl SAMAWAATI WA-MON FIL ARDI \n TO HIM BELONGS WHATEVER IS, IN THE HEAVENS AND ON EARTH. ",
            "content": [{
                    "id": 1,
                    "transliteration": "LILAHI TADBEERU MA FI-L KADNI AJMAHIHI ATTA TUYURIN KADHA FIL BAHRI HEETANI",
                    "translation": "To ALLAH belongs the control Of the entire existence: He holds the birds amidst the sky As well as the fish in the sea!"
                },
                {
                    "id": 2,
                    "transliteration": "HUWA-L ALEEMU TAHALA LLAHU QUDRATUHU WA YAF' ALAN MA YASHA FI KULLI AHYAANI ",
                    "translation": "He is the All-knowing. So great is He! Very mighty is His power: He does what He likes All the time! "
                },
                {
                    "id": 3,
                    "transliteration": "MA KANA SHAYHUN BIDUNYANA BILA SABABIN WALAM YAKUN KHALQUHU ILLA BI BURHANI ",
                    "translation": "Nothing exists Without a purpose: The entire creation exists To worship ALLAH!"
                },
                {
                    "id": 4,
                    "transliteration": "ALLAHU YASMAHUNA, ALLAHU YUBSRUNA ALLAH YUB'EEDUNA, AN KULLI TUGYAANI",
                    "translation": "ALLAH hear us: ALLAH sees us-0 ALLAH! Make us distant From all transgression"
                },
                {
                    "id": 5,
                    "transliteration": "FI KULLI FARDIN WA JAMHI LASWAU TARAA WAH WA-L KHABIRU BINA QOLBI NSAANI ",
                    "translation": "ALLAH is manifest In the singles and in the multiples He is the All-Aware Of all intentions"
                },
                {
                    "id": 6,
                    "transliteration": "YA MAN YUJEEBU U' AHL MUDTORRI FASTAJIBAN DU' AHA ABDKA FI HADRIN WAJAOLAANI",
                    "translation": "O ALLAH Who responds to the distressed! Answer the prayers of your servants Whether at home: or abroad"
                },
                {
                    "id": 7,
                    "transliteration": "ALLAHU YUALL1MUN, ALLAHU YUF'HIMUNA ALLAHU YUJANNIBUNA MIN SHARRI SULTAANI ",
                    "translation": "O ALLAH! Grant us knowledge. 0 ALLAH! Give us understanding 0 ALLAH! Make us distant From all dubious \"authorities.\" "
                },
                {
                    "id": 8,
                    "transliteration": "LA KANA MA QOD ARADA L-HASIDUNA BINA WAKAEDUIHUM KASARABI INDA ATSHANI",
                    "translation": "The aims of the envious ones Shall never be achieved: Their plot is like the appearance of mirage To the sight of the thirsty!"
                },
                {
                    "id": 9,
                    "transliteration": "SALLIM UBAEDAKA MINIUM YA SALAMU WALA TAJ''AL UBAEDAKA FI KAEDIN WA BUHTAANI ",
                    "translation": "0 ALLAH! Deliver Your servants From the envious ones. O God of Peace! Don't Submit your humble servants To the evils of envy and mischief"
                },
                {
                    "id": 10,
                    "transliteration": "SURURUNA BIKA YA ALLARD KHALIQONA ADIM HAQIQATAU FI KULLI AZMAANI",
                    "translation": "Our Joy lies with You, O our Creator! Prolong our Joy Through the passage of time"
                },
                {
                    "id": 11,
                    "transliteration": "MALLIK LANA KULLA MULKIN ANTA MALIKUHUM MATIH MAEESHATANA MA AN BI IMAANI",
                    "translation": "Give us more reign, O our King! Ease our life burden With much faith in You."
                },
                {
                    "id": 12,
                    "transliteration": "ALLAHU, ALLAHU SULTANU-L ASAAMIYYI WA GAERUHU FARHUHU KHUDHU BI ITQAANI",
                    "translation": "\"ALLAH!\" \"ALLAH!\" Is the Greatest of all Names, Behold! Other names are but His Servants."
                },
                {
                    "id": 13,
                    "transliteration": "WAHAABU ABLI RASHADAN ANTA KHALIQUNA WA ANTA MUNQIDHUNA MI KULLI NUQSONI",
                    "translation": "O The All-Giver! Give us guidance, For You are our Creator and saviour: Save us from all faults. "
                },
                {
                    "id": 14,
                    "transliteration": "ALLAHU ALLAHU, SULTAANU L-ASAAMIYYI WAHU WASMU DHATIN LIROBBIN LAESA BIL FAANI ",
                    "translation": "'ALLAH’! 'ALLAH!’ Is the King of all Names! The Name (ALLAH) belongs wholly. To Him, The Almighty, Who shall never perish. None shall bear the Name but He. "
                },
                {
                    "id": 15,
                    "transliteration": "TIS 'UN WA TIS'HUNA ISMA ZOHEERAN WA DHOHAN WA WAHIDUN INDA AHALI LAHI BI KITMAANI ",
                    "translation": "Of all His Names, Ninety-Nine are made known: \" The last one is reserved For His closer and dearer servants. "
                },
                {
                    "id": 16,
                    "transliteration": "WAL-LAHU AWWALUNA, WA-LLAHU AKHIRU WALLAHU ZOHIRUNA, FI BATNIHI DAANI. ",
                    "translation": "ALLAH is The First: ALLAH is The Last. ALLAH is The Open: ALLAH is the Hidden. He is The Nearest to His servants!"
                },
                {
                    "id": 17,
                    "transliteration": "MA GAERUHU MIN ILAHIN MUTLAQAN ABADAN QAD DOLLA MAN YADDAHI NASRAN BI AOTHANI",
                    "translation": "There is no any god Besides Him. Lost is he Who implores idols for help. "
                },
                {
                    "id": 18,
                    "transliteration": "ALLAHU, ALLAHU SULTANUN L-ASAMIYYI WAHUWA ISMU DHATI LIROBBI MALAHU THAANI",
                    "translation": "\"ALLAH!\" \"ALLAH!\" Is the King of all Names! The Name \"ALLAH\" Belongs wholly to Him, The Almighty, Who has no associates "
                },
                {
                    "id": 19,
                    "transliteration": "FA'WA WAHEEDUN WA QOHAARUN BIQUDATIHI WA AZZA SULTONUHU HAKON BI WAHDAANI",
                    "translation": "He is The Only One, The Subduer, And The All-Able: His Authority is enormous And His Unity is real! "
                },
                {
                    "id": 20,
                    "transliteration": "YASSIR LANA ROBBANA, BALLIG MAKOSIDANA MATTIH LANA AESHANA FI KULLI ARKAANI",
                    "translation": "O our God! Ease for us All affairs. Fulfil our hopes And Lighten for us Our life burden Wherever we dwell. "
                },
                {
                    "id": 21,
                    "transliteration": "ALLAHU, ALLAHU, SULTANUN L-ASAMIYYI SIRRUN KHAFIYYUN FAKHUS AADHA BI DEEWAANI ",
                    "translation": "“ALLAH! \".\"ALLAH! \" Is the King of all Names! Its meaning is beyond Human perception and comprehension! "
                },
                {
                    "id": 22,
                    "transliteration": "LILAHI HARAKATUNA, LILAHI SAKANATUNA LILAHI ARWAHUNA, BAL KULLU JISMAANI",
                    "translation": "ALLAH manipulates our activities: ALLAH controls our silence; ALLAH owns our souls And all our bodies! "
                },
                {
                    "id": 23,
                    "transliteration": "ALLAHU, ALLAHU, SULTAANU L-ASAMIYYI ISMUN SARA SIRRUHU FI KULLI SARAYANI",
                    "translation": "“ALLAH.\" “ALLAH!\" Is the King of all Names! It is a Name whose meaning Is inherent in every movement! "
                },
                {
                    "id": 24,
                    "transliteration": "ROBBUN RAUFUN RAHEEMUL KHALQI FARHAMNA HAQEEQ AMANIYANA MIN GAERI HIRMANI ",
                    "translation": "O Lord, The Kind, The Merciful! Bestow on us Your mercy: Materialize our wishes; Don't deny us Your favour. "
                },
                {
                    "id": 25,
                    "transliteration": "DOMMIN SA'ADATANA, DONiMIN GINAAKALANA DOMMIN SALAMATANA DIMNAN LI SHUKRAANI",
                    "translation": "O Lord! Give us bliss, Grant us wealth And Provide us tranquility That we may thank You."
                }
            ]
        },
        {
            "id": 4,
            "name": "MON THALATHI YASHFAHU INDAHU ILLA BIITHNIHI \n WHO IS HE THAT CAN INTERCEDE WITH HIM, EXCEPT WITH HIS PERMISSION ",
            "content": [{
                    "id": 1,
                    "transliteration": "MALIK LANA KULLA MA FIHA SAHADATANA MATTI LI ASHYAKHINA RUHAN BI RAEHANI ",
                    "translation": "Give us the means Of bliss, And give our \"Sheikhs\" Rest and provision. "
                },
                {
                    "id": 2,
                    "transliteration": "NARJU SALAMATAKAL HUL'YA LIZUMRATINA LAELAN, NAHARAN KADHA FI KULLI BULDAANI",
                    "translation": "We seek from You, Your enormous tranquility For our organizations. Give us peace in the day and at night Wherever we are. "
                },
                {
                    "id": 3,
                    "transliteration": "DHALIL IDAANA, WAMAN YARJU MATAEEBANA BIGAERI DHANBI WALA ISIMI WA UDWAANI",
                    "translation": "Humiliate our enemies, And those who wish us difficulty, For we have committed No sin nor wrongdoing Nor enormity against them!"
                },
                {
                    "id": 4,
                    "transliteration": "ALLAHU ALLAHU SULTAANU L-ASMAHIH1 QOD, FAAZA MAN YAARIFU L-ASMA BIHIRFANI",
                    "translation": "\"ALLAH!\" \"ALLAH!\" Is The Most Awesome of His Names! Blessed is he who really knows His Names."
                },
                {
                    "id": 5,
                    "transliteration": "ALLAHU, ALLAHU SULTAANU L-ASMAHIHI QOD FAAZA DAHIN BIHIL YAOMA BIMIRJAANI \"ALLAH!\" \"ALLAH!\"",
                    "translation": "Is The Most Awesome of His Names! Blessed is he who calls his Names, For he shall be anointed with coral."
                },
                {
                    "id": 6,
                    "transliteration": "LILAHI KULLU MULUKIN MA' A RAHIYATIHIM WA KU To HARAKATIHIM TURRAN BI UJDANNI ",
                    "translation": "To ALLAH Submit All kings and their subjects, For their action and movements Are caused to exist by ALLAH!"
                },
                {
                    "id": 7,
                    "transliteration": "LILAHI FI LAHI, NARJU MINIHU RAHAMATAU MIN BAHRI RAHMATIM WALBAHARI BAHRAANI ",
                    "translation": "For ALLAH'S sake And for th propagation of His Religion We pray for His Mercy, For He owns The ocean of mercy! "
                },
                {
                    "id": 8,
                    "transliteration": "DHUT TAOLI ROFU KUMUKHUDHU MANAIJAU WALATAKUN ASMAHIBBIN BIKUFURAANI",
                    "translation": "O mankind! Your Lord\" Is the Owner of Wealth. Be steadfast on His Path: Be nor a sinner, 0 friend, nor a disbeliever. "
                },
                {
                    "id": 9,
                    "transliteration": "YADHA-L JALAALL, WADHAL IKIRAMI LAESALANA SIWAAKA AMNUN BINA FAAMAN BI-TIBYAANNI ",
                    "translation": "O The Owner of Majesty! O The Owner ofHonour! We have no any lord besides You. Grant us knowledge and understanding."
                },
                {
                    "id": 10,
                    "transliteration": "YASSIR LANA KULLA MARGUBIN AYA SAMIAL ASWATI FAOQA SAMA, WAL-ARDI DHA SHAANI",
                    "translation": "Give us all our desires, O the All-Hearing of voices In the heaven And on the earth! O Lord of all affairs! "
                },
                {
                    "id": 11,
                    "transliteration": "SHIFAUNA FIKA YADHAL MANNY WA-L-KARAMI SHAFFIH NABIYYAKA FIINA, KUN BIGUFRAANI",
                    "translation": "We get our cure from You, 0 Lord of Bliss and Honour! Accept the Prophet's intercession For us With much forgiveness."
                },
                {
                    "id": 12,
                    "transliteration": "FANSUR MASHAYIKHANA FANSUR JAMAA’ATANA FAZID SALAMATANA BI SHEIKH TEEJANI",
                    "translation": "Help our Sheikhs, Assist our congregation. And increase our tranquility. We beseech You with Sheikh Teejani."
                },
                {
                    "id": 13,
                    "transliteration": "ALLIM IBADAKA RABBI MA YUFIDUHUMU FI DAARIHIM ADIHI AO YAOMI HUSBAANI ",
                    "translation": "O Lord!. Teach Your servants. What can benefit them in their abode on earth. And on the day of reckoning"
                },
                {
                    "id": 14,
                    "transliteration": "UDNA ILAEKA ILAAHA ANTA MAQSODUNA WA MA SIWAKA LI ADHAL KAONI RABBANI",
                    "translation": "We've returned to You. O our Lord!. You are our desire, For there is no Lord but You!"
                },
                {
                    "id": 15,
                    "transliteration": "NAAM WADHALIKA SIRRUN LAESAN YUNKIRUHU SIWA JAHOOLIN WA DHI JADALIN BIGAFLAANI",
                    "translation": "Yes, Your unity, Is crystally clear; No man can deny It. Except the ignorant infidel, And the heedless contender!"
                },
                {
                    "id": 16,
                    "transliteration": "DAWIM SALAMATANA AMNAN LIDAOLATINA QOWIM LANA HUJATA-N FI-HUKMIQUR'AANI",
                    "translation": "Give us everlasting peace, Protect our nation. And empower our proof. That emanates from the Qur'an."
                },
                {
                    "id": 17,
                    "transliteration": "HUWA-L FAHALU KAMA SHAHA FA LAESA LANA. HAOLUN WA-LA ILATUN FI HUKMIRAHAMAANI",
                    "translation": "ALLAAH is the doer of what He wills: We lack power and say. In the judgement of The Most Compassionate!"
                },
                {
                    "id": 18,
                    "transliteration": "ALLAHU ALLAHU SULTAANU LIASMAHIHI MAN KANA YAARIFUHU SIDKAN BI IHISAANI,",
                    "translation": "\"ALLAH!\"\"ALLAH\"\" Is The Most Awesome of His Names! He who knows Him. Knows the truth."
                },
                {
                    "id": 19,
                    "transliteration": "LA YAN BAGI LIL WARA ANYATLUBU GAERAHU. LIAMRI DUNYA WA UKHRA TILKA DARAANI",
                    "translation": "It is not for the whole world. To implore the helps of other things. Than that of ALLAH. For the attainment Of worldly and heavenly affairs!"
                },
                {
                    "id": 20,
                    "transliteration": "LIANNA MAN QOSADA-R- RAHAMONA F FI AMRIHI YAS'ULLAU AMRU'U MINN GAERI URDAANI",
                    "translation": "Surely, Things. Are easily attainable. For the person. Who relies, in his affairs, on ALLAH."
                },
                {
                    "id": 21,
                    "transliteration": "ALLAHU ALLAHU SULTAANUN LIA I SMAAHIHIHAM RA AANI WAL ABDU YAD'UHUHU YA ROBB WA ",
                    "translation": "\"ALLAH!\" \"ALLAH!\". Is The Most Awesome of His Names!. His servant calls on Rim Saying: \"0 my Lord! O my Benefactor!\""
                },
                {
                    "id": 22,
                    "transliteration": "BIHIL-WUJUDU, WALA FOSLUN WAMUNFASILUN WALA MUWASILU LA WASLUN BIWUJDAANI",
                    "translation": "He created the existence. When there was no separation nor separator. And No connection Nor connector!"
                },
                {
                    "id": 23,
                    "transliteration": "ALLAHU ALLAHU SULTAANUN-L ASMAHIHI WA MAN DA-A GAERAU YAF NAA BI KUFRANNI",
                    "translation": "\"ALLAH!\" \"ALLAH!\". Is The Most Awesome of His Names!. Whoever calls on other thing. Than ALLAH, Shall perish a disbeliever."
                },
                {
                    "id": 24,
                    "transliteration": "DHALIKA ISMUN ASIMUN BAENA ASMAHIHI WALLAHU AKBAR AN TASGEERI AOZAANI",
                    "translation": "That name 'ALLAH'. Is the Greatest of His Names! 'ALLAH' is the Greatest. His Greatness. Is beyong poetical expression"
                },
                {
                    "id": 25,
                    "transliteration": "NAWIR QULUBAN LANA WAK-SHEEF GUYUMAN LANA TOHIR SARA'HIRANA MIN KULLI ADRAANI",
                    "translation": "O Lord! Light up our hearts. Free our hearts from sadness. And Purify our secrets from all faithf "
                },
                {
                    "id": 26,
                    "transliteration": "HADIL HIBAADI IH'DINA DAOMAN TORIQA UDAA TAMIM LANA NURANA MIN GAERI NUQSOONI",
                    "translation": "O Lord! Who guide His Servants! Guide us to the right course. And complete for us our light"
                }
            ]
        },
        {
            "id": 5,
            "name": "YAHLAM MOOBAYNA AEDIHIM WAMO-KHALFAHU \n HE KNOWS WHAT HAPPENS TO THEM (HIS CREATURES) IN THIS WORLD, AND WHAT WILL HAPPEN TO THEM IN THE HEREAFTER.",
            "content": [{
                    "id": 1,
                    "transliteration": "YA MANI ILAEHI RAJAUL-ALAMINA AJIB. YA MAN LAHU RAHMATUN SHUK'RAN BI ARKAANI",
                    "translation": "0 Lord. In whom the world. Rest their hopes! Respond to our call. O Lord. To whom belongs bliss!. We thank You for Your Mercy."
                },
                {
                    "id": 2,
                    "transliteration": "A’ONUN MINAL-LAM RABBIL-KFIALQI YASHMULUNA. ANTA-L MUEENUN-L ABDIN SHAH'NUHU WAANI",
                    "translation": "We are encompassed By the help of ALLAH, The Lord of the World. O Lord! help us. For You. are the Helper Of your weak servant."
                },
                {
                    "id": 3,
                    "transliteration": "LA TAJ'ALAN FITNATAN FIIMA TUWARRITHUNA BARIK RAIYYATANA FI KULLI BULDANI",
                    "translation": "Make not what you've alloted to us A source of trail, And bless our followers, Wherever they dwell"
                },
                {
                    "id": 4,
                    "transliteration": "MUHYI, MUMEETU' JAMEEHI-L-KHALQI ANTA TARA JAMEE'A MA FI DOMEERI-L-KHALQI YA DAANI",
                    "translation": "O The Giver of Life! O The Taker of Souls! O The Closest of His Servants! You see what the hearts of makind contain "
                },
                {
                    "id": 5,
                    "transliteration": "MAL KAONU ILLA KATHALJI ANTA MAHU LAHA KA DHAKA SIRRU ILAHI-L KHALQI DHI SHAANI",
                    "translation": "The entire existence, Is but like an Ice, Which can never melt, But by Your command. So the Power of God Overcomes all affairs"
                },
                {
                    "id": 6,
                    "transliteration": "ALLAHU ALLAHU SULTAANU LI ASMAHIHI WALLHU YA'ALAMU MAFI FATNI INSAANI “ALLAH!\" \"ALLAH!\"",
                    "translation": "Is The Most Awesome of His Names! ALLAH knows About the hidden Aspects of man!"
                },
                {
                    "id": 7,
                    "transliteration": "BAARRIK LI ABNAENA, BAARRIK JAMAAHAATANA BAARRIK LI ATBAENA FI KULLI DAORAANI",
                    "translation": "O Lord! Bless our offspring, Bless our Association, And bless our followers, Wherever they are"
                },
                {
                    "id": 8,
                    "transliteration": "YA ALLAHU, YA ALLAHU, YA DHAL FADLI YA ROBBANA YA MAN LAHU MINNATUN FI KULLI AKWAANI ",
                    "translation": "O ALLAH! 0 ALLAH! O The Owner of Excellence! O Our lord!  Grace is Yours Forever!"
                },
                {
                    "id": 9,
                    "transliteration": "NARJU SALAAMAN ILAAHI DAIMAN ABADA'N AONA'N WA AMNA'N WA USNAN'N DUNA KHIZ",
                    "translation": "O Lord! We seek from You Eternal Peace. Help and protect us. Give us what is good And don't forsake us"
                },
                {
                    "id": 10,
                    "transliteration": "ALLAHU ALLAHU SULTAANU LI ASMAHIHI ISMUN NURAQQI BIHI MIN KULLI MAEDAANI",
                    "translation": "Allah! Allah!. Is the Most Awesome of His Names! With the Name we excel Wherever we are"
                },
                {
                    "id": 11,
                    "transliteration": "YA ALLAHU YA ALLAHU YA ALLAHU YA ROBANNA TABARAKA LLAHU DHUU AMRIN WA SUBHAANI",
                    "translation": "O Allah! O Allah! O Allah! O Our Lord! Blessed is Allah, The Owner of Command, Glorified be Allah "
                },
                {
                    "id": 12,
                    "transliteration": "DALEELU IHMAANINA BILLAHI IKHLASUNA DALEELU MUNKIRI DEENIL LAI SHAETAANI.",
                    "translation": "The proof of our faith in ALLAH Is our sincerity to Him: The proof of the disbeliever Is the devil"
                },
                {
                    "id": 13,
                    "transliteration": "YAA ALLAHU YA ALLAHU MUNJALIMU'MI NEENA AYAA MAN LA LANA GAERU'U NAD'U BIKHUL SAANI",
                    "translation": "O ALLAH! 0 ALLAH! O The Saviour of the believers! We call on You, For there is no other Lord Upon whom We can call sincerely but You."
                },
                {
                    "id": 14,
                    "transliteration": "HUWAL WALIYYUN JAMEE'UL KHALQI YAT'LUBU'U ANTAL KAREEMU WADHU TAOLIN WA IHSAANI.",
                    "translation": "He is ALLAH, The Friend of the believers. All the Creation look unto Him. O Lord! You are The Most Honourable. You are The Owner of Excellence and Perfection"
                },
                {
                    "id": 15,
                    "transliteration": "MALI SIWAA KA, WALA HAOLUN WA LA QUWWATUN AD'UUKA, FAM'NUN ALA KULLIN BI QUR'BAANI",
                    "translation": "I have no God but You, Neither do I have plot nor power but You, I impplore You, For Your blessings: Make us Closer to You"
                },
                {
                    "id": 16,
                    "transliteration": "WA INNA RABBU YAK'FEENA SHURURAIDA WAL LAHU YAHFASUNA MIN SHARIN AZMAANI",
                    "translation": "Surely, He is the Lord, Who protect us From the evils of Foes. O Allah! Protect us from the evils of the times"
                },
                {
                    "id": 17,
                    "transliteration": "MATTI AYAT'AN LANA, TOYYIB MAEESHA TANA KATTHIR JAMA'ATANA FI KULLI AHAYANI",
                    "translation": "Make our life Enjouable, Let our livelihood Be an happy one, And double our congregation All the time"
                },
                {
                    "id": 18,
                    "transliteration": "ALLAHU ALLAHU SULTAANUN-L ASMAHIHI WAHIN DAAOTA BI-HI FUZTA BI JINNANI “ALLAH!\" \"ALLAH!\"",
                    "translation": "Is The Most Awesome of His Names! Successful you shall be If you call on Him By His Names"
                },
                {
                    "id": 19,
                    "transliteration": "KHADDHIL MOKHASIMONA KHAYYIB MAQASIDAHUM WAJ'AL MAEESHATA'UM DON'KAAN BIKHUSRAANI",
                    "translation": "O Lord! Humiliate our enemies, Dash their hopes, Make their livelihood difficult And destroy them."
                },
                {
                    "id": 20,
                    "transliteration": "LI ANNAUM KHADALAN MALLAU YAR FA'UHU WALLAU YUFTINU'UM KULLAN BI HIRMAANI",
                    "translation": "As they forsake What ALLAH promotes, May ALLAH trouble them: May he deny them Their wants."
                },
                {
                    "id": 21,
                    "transliteration": "FALLAU YALIANAUN WALLAU YUHZINUM ALLAHU YUBGIDU'UM TURRAN BI UDWAANI",
                    "translation": "May ALLAH curse (at) them: May ALLAH grieve them; May ALLAH despise them."
                },
                {
                    "id": 22,
                    "transliteration": "HUWAR RAQEEBUL MUJEEBUL WASIUL, ADILU HAS SIN KHAWATIAMINA RABBI BIRIDWAANI",
                    "translation": "He is The Guardian and The Responsive. He is the All-Sufficient and The Just. O God! Give us good end and pleasure."
                },
                {
                    "id": 23,
                    "transliteration": "MINKA ILAEKA, JAMEUL KAINAATI AJIB NIDAA ABDIKA FI AMNI WA KHAFAQAANI",
                    "translation": "From You. Come all creatures. And to You. They shall return. Respond to the call. Of Your servants. At the time of peace. And during palpitation."
                }
            ]
        },
        {
            "id": 6,
            "name": "WALA YU HI TUNA B! SHEIN MINHIUMIHIILLA B! MOSHAA \n AND THEY NEVER COMPASS ANYTHING OF HIS KNOWLEDGE EXCEPT THAT WHICH HE WILLS",
            "content": [{
                    "id": 1,
                    "transliteration": "WASSIH LANAL ILMA YA DHA-L FADLI WALIKARAMI. WAYA HAKEEMAN WA DUUDA'N LUTFU'U DAANI",
                    "translation": "Give us much knowledge, O The Owner of Favour And Honour! O The All-Wise! O The All-Loving! Your Grace abounds everywhere."
                },
                {
                    "id": 2,
                    "transliteration": "LA ANTA YA WAJIDAL MAOJUDI YA AHADUN FA AMINNA RABBANA FAMNUN BI GUFRAANI",
                    "translation": "O The One! You are The Creator Of the creation. Save, protect and forgive us."
                },
                {
                    "id": 3,
                    "transliteration": "ALLAHU ALLAHU SULTAANUN LI ASMAHIHI WAUWA ISMU DHATI WA DHATU-L-ISMI RABBAANI ",
                    "translation": "“ALLAH!\" \"ALLAH!\" Is The Most Awesome of His Names! ALLAH is His Real Name: The essence of His Name is divine."
                },
                {
                    "id": 4,
                    "transliteration": "YA MUHSINAN LIMUSIHIN, MUSRIFIN FARIHIN WA KUN LAHU RAAHIMON RABBI BI KUFRAANI",
                    "translation": "O Lord Who forgives and favours The extravagant sinner. (When he seeks forgiveness!) Be merciful to us. And forgive our trespass"
                },
                {
                    "id": 5,
                    "transliteration": "HAYYUN ILAHII WA QOYUMUN WA LA SINNATUN LAU WA LAESA LAU NAOMUN BI AJFAANI",
                    "translation": "O my Lord, The Ever living, The Sustainer and Protector Whom neither slumber Nor sleep overtakes!"
                },
                {
                    "id": 6,
                    "transliteration": "YA RABBI YA KHALIQI ZIDNA SALAMATANA ZIDNA WIDAADAN ALA ILMIN WA IRFAANI",
                    "translation": "O Lord, My Creator! Add more to our peace And make us dearer to You In the course of knowledge And wisdom."
                },
                {
                    "id": 7,
                    "transliteration": "TOYYIB MAEESHATANA, SAHHIL MATOLIBANA TOHHIR QULUBA LANA MI KULLI ARKAANI",
                    "translation": "Ease our livelihood. Give us our desires And purify our hearts From all spiritual filth."
                },
                {
                    "id": 8,
                    "transliteration": "WAHWA MUQEETU JAMBEU L1KHALKI YAS' ALU'U WAHWA RRAHEEMU WA TAWWABUN BI RIDWAANI",
                    "translation": "Our God Is The Maintainer. All His Creatures Seek for His Favour. He is The Ever Merciful And The All-Forgiving."
                },
                {
                    "id": 9,
                    "transliteration": "NARAKA FI KULLI SHAY'IN ZID MA'ARIIFANA WA MA SIWAKA LANA FI KULLI AHYAANI",
                    "translation": "O Lord! We feel Your presence In all matters Increase our divine knowledge Or you, For we have Glorified You."
                },
                {
                    "id": 10,
                    "transliteration": "BUSHRA LANA MA'SHARAL ISLAM! QOTI BATA'N ALA KTIBAHE NABIYYI KHAERI ADNAANI",
                    "translation": "O the Muslim community Happiness is ours For being the followers Of The Great Prophet, The best of the. ADNAN. "
                },
                {
                    "id": 11,
                    "transliteration": "SHAMSU-L-HUDA-L-MUSTAPHA-L-MUKHTARU SAYYIDINA NUURUNL FITYATINA, NUURUN LISHIKHANI",
                    "translation": "Mustapha, the chosen one Is the light of the right path: He guided the youth and old (To the orthodox way):"
                },
                {
                    "id": 12,
                    "transliteration": "ALLAHU ALLAHU SULTAANUN LI ASMAIHI WAL-INSU YAD'U BIHI DAOMA'N KADHAL JAANI",
                    "translation": "ALLAH! ALLAH! Is The Most Awesome of His Names! By that Name (ALLAH) The mankind and the jinns call on Him. "
                },
                {
                    "id": 13,
                    "transliteration": "MU'TII BILA SABABIN, MUGNI BILA TAABIN NARJU ZIYADATA RIZQIN GAERI HUSBAANI",
                    "translation": "O Lord! Who give by His will! O Lord! Who enrich without fatigue! Give us much means of living."
                },
                {
                    "id": 14,
                    "transliteration": "NARJU LI QOKA BI AMNIN ANTA KHALIKUNA ILAA RAJA'IKA NAR'NUL YAOMA AENANI",
                    "translation": "O our Lord! We hope to meet You in peace You are our Creator, We rest our hope in You Our life throughout."
                },
                {
                    "id": 15,
                    "transliteration": "HUBAEDUKAL MURTAJA AFWA'N BINAELIL MUNA MUHAMMADUN RRABIU'UN YADIU BIRDWAANI",
                    "translation": "Your humble servant, Mohammad- Robiu, Seeks Your pardon And beseeched you to give Him his desire."
                },
                {
                    "id": 16,
                    "transliteration": "LAKAL HIDAYAATUN TUH DI MAN TASHA WATTAQOH NARJU-R-RASHADA KADHA ILMIN BI-TILWAANI",
                    "translation": "To you belongs guidance. You guide whom you wish. We seek your guidance And comprehensive knowledge."
                },
                {
                    "id": 17,
                    "transliteration": "MUNIRU KULLI DUJAA MUDEFU KULLI DUAA NAWWIR SARAIRANA DAOMAN BIQUR' AANI",
                    "translation": "O Lord Who illuminate (the) darkness! O Lord Who brightens the forenoon! Illuminate our hearts with The Quran."
                },
                {
                    "id": 18,
                    "transliteration": "HADIL IBADI B1NUURIL HAQQI YA ROBBANA NARJUL IDAAYATA FAN'SURNA BIFURQAANII",
                    "translation": "O our Lord Who guides His servants By His Light! We seek guidance from You Help us by the criterion Of right and wrong."
                },
                {
                    "id": 19,
                    "transliteration": "ALLAHU ALLAHU SULTANANUN-LI ASMAHIHI WA DHAKA SIRRUN KHAFIYYUN KHUDH BIKTITMAANI",
                    "translation": "ALLAH! ALLAH! Is The Most Awesome of His Names! ALLAH is a Mysterious Name; It is unexplainable; Hold Unto it."
                },
                {
                    "id": 20,
                    "transliteration": "LA QABLAHU HAYYUN QATTUN AY WA LABADAU TANZIHU HU AN SHAREEKIN KAANA YARHAANI",
                    "translation": "There was no an Ever Living God Before Him, And there shall be none Besides Him: He has no associate whatsoever. He is my Shepherd."
                },
                {
                    "id": 21,
                    "transliteration": "LAOLA IBAADATUHU LAOLA INAAYATUHU LAQOD SALAKNA TOREEQA NAHWA NIYRAANI",
                    "translation": "But for His worship, We would have chosen the path of hell. But for His concern, We would have gone astray."
                },
                {
                    "id": 22,
                    "transliteration": "ALLAH, ALLAH, SULTAANUN LIASMAHIHI SIRRUNL ADRATI HA'HIN SIRRUHU DAANI",
                    "translation": "ALLAH! ALLAH! Is The Most Awesome of His Names! The mystery of His essence Lies in His presence Everywhere: He is The Closest to His creatures."
                },
                {
                    "id": 23,
                    "transliteration": "BIJAHI MAN LA-LAHU DHANBUN WALA KHATOUN DAWIM LISAANI ALA DHIKRI WA-SUBHAANI",
                    "translation": "I beseech You With Your servant Who never sinned Nor did wrong, Retain my tongue For Your remembrance And glorification"
                },
                {
                    "id": 24,
                    "transliteration": "MAL-LAHU SHAH'A ILAAHI L'AQQU KAANA BIHI WALA KAMISL ILAAHI JAL'LA FI SHAANI",
                    "translation": "WhatALLAH, my Lord, desires takes place. There is nothing like Him: He is The Majesty; He takes charge of all affairs."
                },
                {
                    "id": 25,
                    "transliteration": "ALLAHU, ALLAHU SULTAANUN LIASMAHIHI LASIRRU HADRATI KHAMSIN INDA SHAEKHANI",
                    "translation": "ALLAH! ALLAH! Is The Most Awesome of His Names! He owns the five stages of presence, As revealed by the Sheikhs"
                },
                {
                    "id": 26,
                    "transliteration": "SHUKRA'N LIKHALIQINA, MAJ'DAN LI ROSIQINA SHUICRA'N LIRAHIMINA SHUKRAN LI RAHAMAANI",
                    "translation": "We thank our Creator: We exalt our Provider; We praise our Merciful-God; We give thanks to The Most Compassionate."
                },
                {
                    "id": 27,
                    "transliteration": "ALLAHU NADHKURHU, ALLAHU NAHABUDUHU ALLAHU NASHKURUHU FI KULLI ARKAANI",
                    "translation": "It is ALLAH Whom we remember! It is ALLAH Whom we worship! It is ALLAH Whom we praise At every stage of our life!"
                },
                {
                    "id": 28,
                    "transliteration": "ALLAHU ALLAHU SULTAANUN LIASMAHIHI WA SIRRHUINDA AHLILAHI SARA YAANI",
                    "translation": "ALLAH! ALLAH! Is The Most Awesome of His Names! So Mysterous and Great is the Name To the chosen servants of ALLAH!"
                }
            ]
        },
        {
            "id": 7,
            "name": "WASIA KURSIYYU' SAMAWAATI WAL-ARDA \n HIS KUR'SIY EXTENDS OVER THE HEAVENS AND THE EARTH",
            "content": [{
                    "id": 1,
                    "transliteration": "WASSHI LANA ROBBANA RIZQAN WA HAFIYATAN FAG'FIR LANA MA MADAA MIN KULLI ISYAANI",
                    "translation": "Lord ! Grant us sufficient Means of living and health. O Lord! Forgive us our trespass."
                },
                {
                    "id": 2,
                    "transliteration": "SALLIM HUBAEDAKA MIN SUUHIN WA MIN NAKADIN WA MIN SHURURUL IDA AO SHAARRI GADBAANI",
                    "translation": "O Lord! Rescue your humble servant  From evils and misfortunes. O Lord! Rescue me from evils of the foes And evils of the enraged."
                },
                {
                    "id": 3,
                    "transliteration": "ALA HABEEBIKA SALLIM SARMADAN ABADAN MUHAMMADIN SAYYIDI MA DAMA QAMARAANI",
                    "translation": "Upon Your friend Bestow Your Eternal Blessings. Bless Muhammad, my leader, As far as the sun. And the moon rise and appear!"
                },
                {
                    "id": 4,
                    "transliteration": "KATHIR JAMA'ATANA, BAARRIK TALAMI-DHANA AYYID RAHEE-YATANA AMNAN BI IMAANI",
                    "translation": "Multiply our congregation, Bless our students And help our flocks in faith."
                },
                {
                    "id": 5,
                    "transliteration": "ROBBI IRHAMNII WA AABAII WA TUBBAEENA YAMAN AJABTA ABAL ABBASIT TEEJAANI",
                    "translation": "My God! Bless me, my progenitors and my progeny. Answer my prayers, O Lord Who answered the prayer of Abul Abbass Teejani!"
                },
                {
                    "id": 6,
                    "transliteration": "SA' ALTUKAL LAHA LIL ASHYAKHI QATIBATAN ANIL HUMUN MINKA GUFRAANA BI RIDWAANI",
                    "translation": "O ALLAH! I beseech You To bestow Your mercy On our Sheikhs: Forgive and please them."
                },
                {
                    "id": 7,
                    "transliteration": "YASSIR MURADAHUMUN WAR'SHUD MAQASIOAUM FAZIO SALAMATAHUN FI KULLI ARKAANI",
                    "translation": "Give them their desires, Guide their wishes And give them much peace Wherever they are."
                },
                {
                    "id": 8,
                    "transliteration": "YUSRAAKA NARJU ILA'L-ARSHI YAL HAQUNA WA AENU LUTFIKA FIL AHDAATHI TAR' AANI",
                    "translation": "O Lord of The Throne! Make things easy for us, And Keep Your Merciful Eye on us Every moment."
                },
                {
                    "id": 9,
                    "transliteration": "AYYIH LANA AMRANA WARSHUD MAQO SIOANA DOHEEF HUJURI BITATH'QEELIL MIYZAANI",
                    "translation": "Facilitate for us Our affairs And guide our desires. Give us plenty of reward And measure our noble acts weighty!"
                },
                {
                    "id": 10,
                    "transliteration": "ALLAHUALLAHU SULTAANUN IL ASMAIHIN WA'WASMU SIRRI LIDHI AMRIN WA SULTAANI",
                    "translation": "ALLAH! ALLAH! Is The Most Awesome of His Names! It is a Mysterous Name belonging Wholly to The Owner of all affairs And authorities!"
                },
                {
                    "id": 11,
                    "transliteration": "LAHASTU KULLA SIFAATIN TAHTA ASRARIHI ALLAU ALLAU ALLAHUSMU FURDAANI",
                    "translation": "I see all beautiful attributes Beneath His mystery. The Name: 'ALLAH' Wholly belongs to the Creator!"
                },
                {
                    "id": 12,
                    "transliteration": "SAMMAUMUL LAHU QAUMON FI MAARIFIHIM MIN FAEDI ANIWARIHI FIKULLI ALWAANI",
                    "translation": "ALLAH named His devoted servants 'people' Because they seek His divine knowledge Through His Light which appears In different colours!"
                },
                {
                    "id": 13,
                    "transliteration": "SA ALTUKAL LAHU BIL ASMAI QOOTIBATAN WA BIS-SIFATI-L-ULA KUN LI BISUR' AANI",
                    "translation": "O ALLAH! I beseech You By all Your Beautiful Names And Your Greatest Attributes To hearken to my call in time!"
                },
                {
                    "id": 14,
                    "transliteration": "MATIIHQULUBAN LANA YA ROBBI WAR-SHUDUNAA BINOORIKAL AOLIYA FI KULLI AKWAANI.",
                    "translation": "Give our hearts enjoyment And guide us through your beloved servants Upon whom you've shed Your Light."
                },
                {
                    "id": 15,
                    "transliteration": "ALLAHU ALLAHU SULTAANU LIASMAMH1 LITABI EL HAQQI INDAL LAHI KHAERAANI",
                    "translation": "ALLAH! ALLAH! Is the Most Awesome of His Names! For the followers of the truth There shall be two rewards: The worldly and the heavenly ones!"
                },
                {
                    "id": 16,
                    "transliteration": "WA SARI'UU Fl SABILI LAHI WAJ'TA' ADUU BIMALIKUN, WA BI NAFSIN SHUKRA MAN-NAANI",
                    "translation": "O Servants of ALLAH.' Hasten to the course of ALLAH And make effort to propagate His religion with your money And your life. Give thanks to Him For he is The Generous"
                },
                {
                    "id": 17,
                    "transliteration": "INMA WALIYYUN ATAA BUSHRA LIDARIKUMU WUJUDU'UM RAHMATUN USMAH BI GUFURAANI",
                    "translation": "Whenever a devoted servant of ALLAH Visit your abode, Behold, his presence Is a sign Of God's Blessing and Forgiveness."
                },
                {
                    "id": 18,
                    "transliteration": "TAWASALUU BIHIMU NILTUM MOQOSIDAKUM WA LLAHU KHAYYARAHUM HUBBAN BIHIRFANI",
                    "translation": "Hold fast to the (Walis) friends of God. As means of communication to Him. You shall get your desires, For ALLAH has chosen them His 'Walis' because they know and love Him ."
                },
                {
                    "id": 19,
                    "transliteration": "WADH'KUR THALATHA DU'HOORIN LIL WARA ABADA'N MADIN WA HAADIRIN AATI'IM GADAN DAANI.",
                    "translation": "Remember, The world has three sessions: The past, the present and the future."
                },
                {
                    "id": 20,
                    "transliteration": "AR JUUKA YA RABBANA ILMAN YU SAEEDUNA WA MA LANA QUWWATUN SURNA BI WUJDAANI",
                    "translation": "O our God! We seek from You Much beneficial knowledge To propagate Your course. We are powerless: Empower us And give us inner consciousness."
                },
                {
                    "id": 21,
                    "transliteration": "LAOLA INAYATU RABBI KUNTU AQ'UDU FI KAESISH SHAYATEENI FI LA' AWIN WATUG'YAANI",
                    "translation": "But for my Lord's guidance, I would have been in the purse of the devils: I would have diverted to the lively amusement, And I would have transgressed All bounds!"
                },
                {
                    "id": 22,
                    "transliteration": "ALLAHU ADHKURUHU ALLAHU AA'BUDUHU ALLAHU AD'UHU FI WAQFI WA SARYAANI.",
                    "translation": "It is ALLAH whom I remember, It is ALLAH whom I worship, And it is ALLAH whom I call Whether standing or moving!"
                },
                {
                    "id": 23,
                    "transliteration": "ROBBI QAREEBUN MUJEEBUN, JITU MUBTAELA'N ARJU LIFUTUHA WAKASSHIF KULLA AHZAANI.",
                    "translation": "My God! You are The Watchful and The Responsive. I have come to You, Supplicating and asking For victory (Over all troubles). O God! remove all my grief."
                },
                {
                    "id": 24,
                    "transliteration": "DOMIN LANA RABBANA FAD'LAN WA MANFA' ATAN WA KUN NASIRA'N LANA MIN GAERI FUQDAANI",
                    "translation": "Give us your Grace And Pleasures. Be our helper and Don't forsake us."
                },
                {
                    "id": 25,
                    "transliteration": "WA QAD SOBARNA BI HUKMIL LAHI KHALIQINA WALLAU YANSURU MAN YAD'U BI IHQAANI.",
                    "translation": "With perseverance. We accept the decrees Of ALLAH, our Creator. ALLAH helps Those who call On Him faithfully."
                }
            ]
        },
        {
            "id": 8,
            "name": "WALA YAHUDUHU IFTHUHUMA WAHUWA-L-HAUYYU L-HAZEEM. \n AND HE FEELS NO FATIGUE IN GUARDING AND PRESERING THEM.AND HE IS THE MOST HIGH, THE MOST GREAT.",
            "content": [{
                    "id": 1,
                    "transliteration": "WALIYYUNA ANTA YA NIHMA-L WALIYYULANA MANLA WALIYYA LAU HAQQAAN WALA THAANI",
                    "translation": "You are our Master. What a perfect master You are! O Lord! You seldom have a master nor a vice!"
                },
                {
                    "id": 2,
                    "transliteration": "LAKA-LULA RABBANA-R-RAHAMONA MALIKANA FAHFAS JAMAATANA MIN SHARI SHAETAANI",
                    "translation": "To You belongs greatness, O our God, The Most Compassionate! O our Owner! Protect our congregation From evils of the devil."
                },
                {
                    "id": 3,
                    "transliteration": "UDIU ILA AKUMU KHAOFAN WABITOMAHI. YUJEEBU ROBBI MON YADHUU BISURHAANI",
                    "translation": "Pray to Your Lord By way of fear and hope! My God is always hearken To His callers. "
                },
                {
                    "id": 4,
                    "transliteration": "YADRI BISIRRIKA MITHLAL JAARI MUTTADIHAN WA KULLU SIRRIN LADA RABBI KA IHLAANI",
                    "translation": "ALLAH knows your secret As he knows the apparent aspects of you: To my God, the hidden and the open Are the same!"
                },
                {
                    "id": 5,
                    "transliteration": "ALLAHU JALLA TAALA MALAU KUFUWUN FALA LAU WALADUN HAQQAN WA ABAWAANI",
                    "translation": "ALLAH is Awesome in His Essence, For there is no like unto Him And He neither has progeny nor progenitors."
                },
                {
                    "id": 6,
                    "transliteration": "DA MATA QADDAMA MIN LAWIN WA MIN LAHIBIN WAKUN MUJIDDAN BIDEENIN KULLA AZMAANI",
                    "translation": "Abandon all sorts of amusement and play: Be devoted to Islam All your life."
                },
                {
                    "id": 7,
                    "transliteration": "ABLI RASHADAN BI AQWAALI KADHA AMALIN LIANNA RUSHDAKA YUNH KULLA KASLAANI",
                    "translation": "O Lord, Guide me in my speeches and action, For the idle can only be save By Your guidance."
                },
                {
                    "id": 8,
                    "transliteration": "HAMDAN LIKHALIQINA SHUKRAN LIRAZIKINA SAHEL LANA QASDANA LUTFAN BISULTAANI",
                    "translation": "Praise be to our Creator Thanks be to our Provider 0 God! Give us our desires In multitude"
                },
                {
                    "id": 9,
                    "transliteration": "FAMA WANAETU KADHA MA ZILTU MUJTAIDAN LAELAN NAHARAN LI IRSHADIN BIQUR'ANI",
                    "translation": "I shall never relent in my effort To guide your servants By The Qur'an, Night and day"
                },
                {
                    "id": 10,
                    "transliteration": "SUHURUNA BIRIDOLLAHI WALAESA LANA KHAOFUN WALAHUSNUN FI YAOMI HASBAANI",
                    "translation": "Our popularity is by the mercy of ALLAH We pray that we'll be absolved of fear And grief on the day of reckoning!"
                },
                {
                    "id": 11,
                    "transliteration": "HUWA LIWAHEEDUL LATHI NARJU SHAFA ATAU YAOMAL LIQO LLAHI FI KHAOFIN WASUKRANI",
                    "translation": "ALLAH is the only one whose pardon We are seeking on the resurrection day When mankind shall be in state of grief And intoxication!"
                },
                {
                    "id": 12,
                    "transliteration": "MOHAMMADUN KHAERU KHALQILLAI QATIBATAN MUHAMMADUN SAYYIDU FIKULLI AKIWANI",
                    "translation": "Mohammad is the best Of the entire mankind: Mohammad is the leader of all time!"
                },
                {
                    "id": 13,
                    "transliteration": "AKHI TAMASSAQ BI KHAERI RUSLIN QATIBATAN FA ADYUU KANA YURWI KULLA ATSHAANI",
                    "translation": "My brother! Hold fast to the best of ALLAH'S messengers Whose guidance for mankind Is like water for the thirsty!"
                },
                {
                    "id": 14,
                    "transliteration": "WALLAU YA'SIMUNA MIN SHARRI KULLI IDA WAMIN ADHA KULLI HUSSAADI WA KHAWWAANI",
                    "translation": "May Allah protect us from evils of the enemies And from harm of the envious and betrayers."
                },
                {
                    "id": 15,
                    "transliteration": "HUWAL HAFEESU LANA WAUWAR RAQEEBU BINA HUWAL MUJEEBU BINA FAMNUNI BI IHSAANI",
                    "translation": "ALLAH is our Protector and Guardian. He has the answer to our prayers. We beseech Him to grant us good things."
                },
                {
                    "id": 16,
                    "transliteration": "WASLIH BILADA LANA, WARISHUD HUKUMA TANA WAKTIDR JAMAATANA MANNA BIRIDWAANI",
                    "translation": "O Lord! Redeem our country (from plagues), Guide our governments, Multiply our congregation And grant us pleasures."
                },
                {
                    "id": 17,
                    "transliteration": "ADI UKA ROBBI BI ASMOIN DUEETA B1AA ALLAHU ALLAHU DHA ISMUN LISULTANI",
                    "translation": "O my God! I call on You By your Beautiful Names. I beseech You with The Name ALLAH For it is a powerful Name!"
                },
                {
                    "id": 18,
                    "transliteration": "LIMLA WAQAD QULTA ID'ULLAHA B1L USNAA MIN BAENI SIR1U WA JA'HRI AM11U QUR' AANI",
                    "translation": "Why shouldn't I keep calling on You, For You say: Call on Me By My Beautiful Names. The Qur'an commands us to pray In silence and in public"
                },
                {
                    "id": 19,
                    "transliteration": "ALAEKA RABBI TAWAKKALNA ALA AMRIN A WA LAESA GAERUKA FI USRIN BITUKLAANI",
                    "translation": "Upon You we rely for our affairs: There is no God Upon whom we can rely during hardships But You."
                },
                {
                    "id": 20,
                    "transliteration": "LA ANTA AKBARU MIN DUNIYA WA DORRATIA ANTAL ASIMUL KAREEMU-LMANNI DAYYANNI",
                    "translation": "For you are greater than the world And its vanities: You are The Great; You are The Generous; You are The Judge."
                },
                {
                    "id": 21,
                    "transliteration": "YAS SIR ULUMA LANA YAS SIR FUUMA LANA YAS SIR MAQASIDANA MINKA BI IMKAANI",
                    "translation": "Make knowledge easier for us to absorb, Give us understanding of what we learn And make our goals attainable."
                },
                {
                    "id": 22,
                    "transliteration": "YARABBANA ANTA MAOLAANA WA KHALIQUNA FA QAWWI HUJJATANA SIRRAN BIBURHAANI",
                    "translation": "O our Lord! You are our Master and Creator. Empower our proof (of the truth)"
                },
                {
                    "id": 23,
                    "transliteration": "ALLAHU SOLLI WA SALLIM SARMADAAN ABADAB ALA NABIYYIN KAREEMIN NURIRRABBAANI",
                    "translation": "O ALLAH! Bestow Your eternal blessings And peace upon The Noble Prophet Who is The divine light Given to the world!"
                },
                {
                    "id": 24,
                    "transliteration": "LANA RAJAUN WA MINKAL ISTIJAABATU YA RABBI IJIALANNA RAJAHEE GAERA KHUSRAANI",
                    "translation": "O Our God! In You we trust, For You have the answers to our prayers. Don't shatter our hopes."
                },
                {
                    "id": 25,
                    "transliteration": "AZZIM RIDHOKA LANA, AZZIM KARAMATANA KARREEMUNFI MON NIHI FAM'NUN BI HISAANI",
                    "translation": "O The Most Gracious! Give us much pleasure, Give us much honour And give us Your benefaction!"
                },
                {
                    "id": 26,
                    "transliteration": "ZOHARTA YA RABBANA FI KULLI AMKINATIN AZZIR LANA DEENANA FI KULLI BULDAANI",
                    "translation": "O Lord! You are known to all Your creatures Wherever they are. Give our religion victory in all nations. \t"
                },
                {
                    "id": 27,
                    "transliteration": "YARABBANA MINKA NARJU KULLA MAQSODINA AJIB LANA RABBANA MIN GAERI HIRMAANI",
                    "translation": "O Our God! By your will We live in hope. Give us our wants and don't deny us."
                },
                {
                    "id": 28,
                    "transliteration": "MOHAMMADU-R-RABIU YARJU RIDOH RABBIHEE BI AYATIL'HIFSI NASMI MISLA DIEWAANI",
                    "translation": "Mohammad Robiu seeks the pleasure of ALLAH By reciting the verse of protection."
                },
                {
                    "id": 29,
                    "transliteration": "MOHAMMADU KHAERU KHALQI LLAH QUDWATUNA SOLLI WASALLIM ALAI11N ROBBI ZHI SHAANI",
                    "translation": "O Lord of all affairs! Bestow Your Blessings and Peace Upon Mohammad, the best of mankind And the best example to follow!"
                }
            ]
        },
        {
            "id": 9,
            "name": "IN THE NAME OF ALLAH THE BENEFICIENT THE MERCIFUL VIRTUES OF THE NOBLE VERSE OF THE THRONE.\n PRAISES AND THANKS BE TO ALLAH, THE GOD OF THE WORLD, WHO SAYS IN IDS NOBLE SCRIPTURE: \"CALL ON ME AND I SHALL RESPOND TO YOU—\"CALL ON YOUR GOD WITH HUMILITY AND IN SECRET\". O ALLAH BESTOW YOUR BLESSINGS ON OUR LEADER, MUHAMMED, THE FIRST AMONG EQUALS, THE LASTOF APOSTLES, THE ADVOCATE OF THE TRUTH (ISLAM) WITH THE TRUTH (QUR' AN) , AND THE GUIDE TO THE RIGHT PATH. BESTOW YOUR BLESSINGS ON HIM AND ON IDS HOUSEHOLD IN FULL MEASURE AND ENORMOUS QUANTITY AS THEY DESERVE. \n HERE ARE SOME BENEFITS THAT CAN BE GAINED THROUGH THE RECITATION OF AYATUL QURSIY, BASED ON WHAT SOME RELIGIOUS LEADERS SAY REGARDING ITS DIVINE VIRTUES.",
            "content": [{
                    "id": 1,
                    "transliteration": "",
                    "translation": "Sheikh Al-Jalal AI-Dawawiy, may Allah bless him, said: Whoever recites Ayatul Kursiyyi 170 times, seeking from ALLAH a (worthy) position or abundant means of living, shall definitely be endowed with what he prays for. It could also be recited the same number of times for the purpose of easing payment of debt or relieving oneself of grief, it could be read, in the same manner, as a means of protection against all sorts of calamity and as well as source of victory over enemies. \n Therefore, if you have any difficulty, hold fast to the recitation of Ayatul Kursiyyi at the end of every daily obligatory prayer or at midnight. You are required to do ablution and face the 'Qibla' for the prayer. As far as you can obey the aforementioned rules, your prayer shall be answered in time. The reading of the Glorious Verse is also beneficial to your desires."
                },
                {
                    "id": 2,
                    "transliteration": "",
                    "translation": "According to an exegesis of Ayatul Kursiyyi, if you recite the verse the number 2f its words i.e 50 times on small amount of money, the money shall be blessed and you shall be protected against the whisper of the devil."
                },
                {
                    "id": 3,
                    "transliteration": "",
                    "translation": "Amongst its virtues is that whoever recites it the number of the Prophet's attributes, which is 201, asking for his needs, the needs shall be satisfied."
                },
                {
                    "id": 4,
                    "transliteration": "",
                    "translation": "He who prays for fortunes should repeat it 313 times, he shall have the fortunes. The Prophet, blessings and peace ofALLAH be upon him, says: Ayatul Kursiyyi is the best of the Qur'an glorious verses\". He is also reported to have said: Ayatul Kursiyyi is greatest name ofALLAH."
                },
                {
                    "id": 5,
                    "transliteration": "",
                    "translation": "ALLAH shall forgive the sins' of those who recite Ayatul Kursiyyi after each and every obligatory prayer. This is why the prophet, blessing and peace of Allah be on him, enjoins the Muslim to read it after obligatory prayers."
                },
                {
                    "id": 6,
                    "transliteration": "",
                    "translation": "Amongst its undoubted virtues is that whoever recites it 1000 times continuously for forty days, at night or by day, I swear by ALLAH, the Most Exalted, and by The Glorious Qur'an, he shall be saved from spiritual blindness, an Angels shall visit him and he shall be given what he want: If the reciter can devote to its recitation 1000 times daily, ALLAH shall give him what he wants. He shall give hin protection, love and honour amongst his servants on earth and in the hereafter."
                },
                {
                    "id": 7,
                    "transliteration": "",
                    "translation": "He who wants to empower his intellect and understanding should recite Ayatul-Kursiyyi 50 times on (a cup of) rain water, and drink it, Allah shall increase the power of his intellect No doubt He can also recite it 50 times for any (good) purpose."
                },
                {
                    "id": 8,
                    "transliteration": "",
                    "translation": "If a person have ophthalmia -sickness of sore eyes-, he should be conversant with the recitation of Ayatul Kursiyyi 50 times at the end of Subhi and Magrib prayers, Allah shall cure him. This has been tested to be valid."
                },
                {
                    "id": 9,
                    "transliteration": "",
                    "translation": "It can be written (on slates, plates and trays) 170 times, with its letters separated form one another, after which it would be washed with water for drinking. He who drinks it shall be relieved of his difficulty by ALLAH. \n Whoever writes the number of its words, 50 times, shall win the hearts of his adversary and envious ones; he shall gain their love and favour."
                },
                {
                    "id": 10,
                    "transliteration": "ALLAHUM IJAL LI BURHANAN YUURITHUNI AMAANA. WAANIZINI BIKAALAKULLI MAT-LUUBIN. WAHAS-HABNI BI HAONIINAYATIKA Fl KULLI MARGUUBIN. YA-QUADIR, YA-QOHAR, YA-JALEEL YA-AZEEM, YA-NASIR. KATABA-LLAHU LA-AGLIBANNAANA WA¬ROSULLI IN NA-LAHA QOWIYUN AZEEZ. \n After this, he should read the NUNIYATIBN MALIK (a chapter or more).",
                    "translation": "Whoever wants his/her prayer answered in time should recite Ayatul-Kursiyyi in any of the number of times mentioned earlier and follow it with this prayer: "
                },
                {
                    "id": 11,
                    "transliteration": "",
                    "translation": "By consensus, the saints say that who ever recites Ayattul Kursiyyi 17 times in a secluded place, after Asri prayer on a Friday, he would find himself in a peculiar state of ecstacy during which if he prays to ALLAH, his prayer shall be answered instantly."
                },
                {
                    "id": 12,
                    "transliteration": "",
                    "translation": "Sheikh At Bawny, may ALLAH bless him, says: whoever writes Ayatul Kursiyyi 170 times, separating its letters from one another, and drink it or rub his body with it for any good purpose whatsoever, his needs shall be satisfied (by ALLAH)."
                },
                {
                    "id": 13,
                    "transliteration": "",
                    "translation": "It can also be written 50 times, with its letters separated from one another for the purpose of getting what one wants from an adversary or an envious one and for the purpose winning people's hearts and gaining their love."
                },
                {
                    "id": 14,
                    "transliteration": "",
                    "translation": "It can heal kidney disease or other stomach related sickness. For this purpose, it should be written on a clean vessels once, its letters should be written separately from on another after which it would be washed for the patient to drink. He shall be healed by ALLAH."
                },
                {
                    "id": 15,
                    "transliteration": "",
                    "translation": "Whoever dreams of being poisoned should recite Ayatul Kursiyyi 3\t'ally along with Suratu Li-Falaq and  Suratul was (i.e Qul-Haudhu birabbil Falaq and Qui Haudhu Birabil NNas from the beginning to the end) immediately he wakes up. By the power of ALLAH, the effect of the poison shall vanish and the person shall be saved. This is also applicable to all nightmares."
                },
                {
                    "id": 16,
                    "transliteration": "",
                    "translation": "It can be recited to drive away the jinns from one's house place, shops etc. It should be recited 170 times along with the recitation of 'Wala Yahuduhu Hifsu-huma Wahuwa Aliyu-l-azeem' 170 times."
                },
                {
                    "id": 17,
                    "transliteration": "",
                    "translation": "Ayatul Kursiyyi is beneficial to the person who finds it difficult to sleep. He should recite it 50 times, along with the recitation of 'Wa Jaali naa Naomakun Subaata' 50 times. It can also be recited on the head of the sick, He shall be healed by ALLAH"
                },
                {
                    "id": 18,
                    "transliteration": "",
                    "translation": "Ayatul Kursiyyi can cure smallpox and any deadly infectious disease. Write the Ayat 50 times along with 'Fasa Yak Fiyaumu Lahu Wahuwa Samhiun Aleem' 50 times on a slate or a tray wash it with lime juice. Pour the preparation into a bottle or a keg. Give the patient 3 tablespoonfuls 3 times daily. You can also rub the patient's body with the preparation. He shall have cure by ALLAHs will."
                },
                {
                    "id": 19,
                    "transliteration": "",
                    "translation": "Ayatul Kursiyyi can heal lung disease, chest pain and cough. Write the Ayat 170times on a slate or a tray. Wash it with lime juice and mix the juice with pure honey. Give the patient 3 tablespoonfuls 3 times a day. He shall be cured."
                },
                {
                    "id": 20,
                    "transliteration": "",
                    "translation": "Ayatul Kuniyyi is beneficial to the pregnant during the pains of childbirth. Write the Ayat 170 times on a slate, Suratul Inshiqoq (Chapter 84 of the Holy Qur'an) from the beginning to the fourth verse ‘Wa alqot Ma fi haa, Wa takhlat ....’ 7 times, and ‘Thuma Sebila Yansarahu’ (Chapter 80, verse 20, ofthe holy Qur'an) 21 times."
                },
                {
                    "id": 21,
                    "transliteration": "",
                    "translation": ""
                }
            ]
        }
    ]
}