{
    "name": "Spiritual Eficacy of Ahamu Sa Qaku Hala'u Ya Su",
    "subhead": "in Earning Fortune and Repelling Evils",
    "author": "Fadhilat Shaykh Muh. Robiu Adebayo Abdul Malik R.T.A Al-Ilory",
    "content": [{
            "id": 0,
            "name": "Preamble",
            "content": ["In the name of Allah, the most Gracious, the most Compassionate. May the blessings and mercy of Allah be bestowed upon the Prophet Muhammad, his household, and his disciples.\n The following passages showcase some of the hidden merits of the 'eleven alphabets' which include: ALIF, HAW, MEEM, SII1V, QOF, KAF, HAU, LAM, 'AIN, YA, and SOD. Each of the alphabets indicates a name among the names of Allah, the Exalted. An expert in the Arabic language once said that 'Arabs pronounce just a letter' (This likely suggests that Arabs altogether speak one tongue). Also, Mujahid submitted that the cause of happiness in the separate alphabets. According to him, each alphabet represents a name among the names of Allah, the Exalted. These alphabets constitute the first verses of some chapters of the Qur'an. For instance, QOF, which is the first letter of the first verse of Qur'an 50, refers to the name of Allah, the Powerful; the Compeller. Similarly, 'NUN' which is part of the first verse of Qur'an 68, stands for His name, the Light; the Helper. Likewise, 'HA-MEEM' the first verse of Qur'an 40, 41, 42, 43, 44, 45, and 46 respectively; this suggests the name of Allah, the Ever-living; the Sustainer.\n According to Ibn Abbas, ALIF-LAM-MEEM, the first verse of Qur'an 2, 3, 29, 30, 31, and 32 respectively, is a derivative of the awesome names of Almighty Allah. He further pointed out that verses such as ALIF-LAM-MEEM, TOH-SHN-MEEM, and SOD, embody oaths by Allah as well as His names. \n It was reported that Ali bin Abi Talib used to seek forgiveness of Allah by invoking the first verse of Qur'an 19 (KAF-HAW-YA-'AIN-SOD). \n In the light of the above analyses, I prepare this manual containing details about the efficacy of this prayer worded as thus: 'AHAMU SAQOKU HALAU YASU, for the benefit of those who either deliberately or out of lack of understanding oppose the use of the prayer. It should be noted that this prayer is useful for both protection and fortune-seeking. \n SHEIKH MUH. ROBIU ADEBAYO ABDUL MOLIQ "]
        },
        {
            "id": 1,
            "name": "Part One",
            "subhead": "HOW TO PRAY BY AHAMU SAQOKU HALAU YASU",
            "content": [{
                    "id": 1,
                    "transliteration": "The First Step: \n The worshipper should commence the prayer by reciting Suratul Fat'ha as follows: AHUUZU BILLAHI MINO SHAYTOONI ROJEEM BISMILLAHIR- RAHMAANI ROHEEM AL-HAMDU LILLAHI ROBBIL 'AALAMEEN, AR RAHMAANI ROHEEM, MOOLIKI YAWMID-DEEN, IYYAAKA NA'BUDU WA LYYAAKA NASTA'EEN IHDINAS-SIRAATOL-MUSTEQEEEM; SIRAATAL-LAZEENA AN'AMTA 'ALAYHIM GHAYRIL-MAGDOOBI 'ALAYHIM WA LAD- DOOLLEEN. (Once) ",
                    "translation": "In the name of Allah, Most Gracious, Most Merciful. Praise be to Allah, the Cherisher and Sustainer of the worlds; Most Gracious, Most Merciful; Master of the Day of Judgment. Thee alone we worship, and Thee alone we seek for help. Show us the straight path, The path of those on whom Thou hast bestowed Thy Grace, those whose (portion) is not wrath, and who go not astray. "
                },
                {
                    "id": 2,
                    "transliteration": "The worshiper will recite Istigfaar as follows: Astagfirullahal Azeemal - ledhii Laa-Ilaha illa Huwal Hayul Qoyuumm - (100 times)",
                    "translation": ""
                },
                {
                    "id": 3,
                    "transliteration": "Third Step: The worshiper will recite Salatul fatihi ALLAHUMMA SOLLI 'ALAA SEYYIDINAA MUHAMMADIL FAATIHI LIMO 0' UGLIQO, WALIKHAATIMILIMOO SABAQO , NAASIRIL HAQQI BIL HAQQI, WAL HAADI ILAA SIRAATIKAL MUSTAQEEM, WA ALAA AHLIHI HAQQO QODRIHI, WAMIQDAARIHIL AZEEM (100 TIMES)",
                    "translation": "O Allah, bestow Your blessings upon our leader Muhammad, the opener of the closed (door) and the last of the apostles, the advocate of the truth by the truth, and the guide to Your straight path and upon his households in manifolds as much as his magnificent worth"
                },
                {
                    "id": 4,
                    "transliteration": "The Fourth Step: Kalmat as-shahadat as follows:. LAHILAHA ILLA LAHU.(100 times)",
                    "translation": "There is no deity worthy of worshiping except Almighty Allah."
                },
                {
                    "id": 5,
                    "transliteration": "The Fifth Step: The worshiper will recite AHAMU SAQOKU HALAU YASU. (11 times) or (111 times)",
                    "translation": ""
                },
                {
                    "id": 6,
                    "transliteration": "The worshiper will then go on to recite the following prayers which are segregated under each of the eleven Arabic letters that form 'AHAMU SAQOKU HALAU YASU. The letters are: ALIF, HAW, MEEM, SII1V, QOF, KAF, HA, LAM, AIN, YA, SOD. It is significant that the prayer should be recited in its transliterated format. However, to have the prayer meaningful to the worshiper who might find reading the transliteration difficult, the English translation should be use. It is a double dose advantage for the worshiper to read the transliterated and the translated version. ",
                    "translation": ""
                }
            ]
        },
        {
            "id": 2,
            "name": "Alif",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "Alahummo Tnni As'Aluka bisirrika Fii (ALIF), \"Allahu\" \"Al-Awwalu\" Al- Aakhiru\" Al-Ahadu\", Allahu Laa Ilaha Illa Huwal Hayyul Quyyum, Laa Tahkhuzu Sinotun Walaa Naomun,Lahu Moo Fiis Samoowaati Wamoofil Ardi, Mon Dhaa Ladhee Yeshfahu Indahu Illa Bi'idhinihi,Yahlamu Moo Baino Aideehim Wa Maa Khalifahum,Wa Laa Yuheetuuno Bi Shayhin Min Ilmihi Illa Bimoo Shaa Ha, Wasiha Kurisiyyuhus Samoowaati Wal'ardo,Wala Yahuuduhu Ifzuhumoo Wahuwal Aliyyul Azeem. \n Huwa Lahul- Awwalu, Al-Akhiru, Al-Ahadu, alladhee lam yelid walam yuulad, wa lam yakun lahu kufuwan ahad. As'aluka an tuhaqqiqo liyal- motooliba wa tedifaha anniiyal ashraara wal adraara. Aameen! \n Huwal-Lahu yaa mon laa ilaaha siwahu hayy, Huwal-Lahu yaa manihu mukawwinu akwaani",
                "translation": "O Allah! I beseech you in Your Power hidden in 'ALIF' \"ALLAHU\" \"AL- AWWAL\" (The First) \"AL- AAKHIR\" (The Last) \"AL- AHAD\" (The One).\"Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness nor sleep overtake him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. \n His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great\" (Q2:255).He is the First, the Last and the One. He begot nothing, nor was He begotten. None is like Him. It is You I beseech to make achievable my needs and to guide me against evils and harm. \n O ALLAH, beside whom there is no other God; \n O ALLAH, the Creator of the entire creation"
            }]
        },
        {
            "id": 3,
            "name": "Haw",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "Allahummo innii as'aluka bisirrika (HAW) \"Al- Haady\" aladhii adaita bihi seyyidanaa muhammadan solallahu 'alayhi wasallam wa jemeehal- anbiyahi, war rush, wal- asfiyaahi, Wal- aoliyaahi,wa qulta fii haqqihim laa khaofun alayhim wa Allahummo bijaahim laa laa hum yahzanuun.hi indaka ijhalinii minol ladheeno  khaofun alayhim wa laa hum yahzanuuno. Aameen \n Faminka ayaa haadi tolabtu hidaaya\n Fa’ablii roshaadan minka mini gayri hirmaani",
                "translation": "O Allah! I beseech You in Your Power that is hidden in \"HAW\" Meaning: You are \"The Guide\" who guided our master 1VIuhammad (salallahu 'alayhi wasallam), and other Prophets and Messengers, as well as the chosen ones . About whom You have said 'Neither they fear nor grieve'. Oh Allah! By their virtue, I ask You to include me among those who fear not, nor grieve. \n From You I seek guidance, O the Guide! \n Grant me guidance; don't deny me "
            }]
        },
        {
            "id": 4,
            "name": "Meem",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "Allahummo innii as'aluka bisirrika fii (MEEM), \"Al-MaIke \"Al- Mu'minu\" \"Al Muhayminu\" Mu'izzu\" \"Al- Mudhillu\" \"Al Muqsitu\" \"Al- Mujeebu\" \"Al-Moonihu\" \"Al- Muh'tyy\" \"Al- Muqeetu\" \"Al- Mannanu\" \"Al- Muhyii\" \"Al- Mumeetu\" \"Al- Moteenu\" \"Al-M u'eenu\" \"Al Mubdihu\" \"Al- Mu'eedu\" \"Al-Munteqi \" Al- Mutakabbiru\" \"Al-Musowwiru\" \"Al- Mnjeedu\" \"Maajidu\" \"Al Mugny\" \"Al-Muqtadiru\" \"Al-Muqoddimu\" \"Al-Muakhiru\" \"Al-Mutahally\" \" Maalikul mulki\" wa bi meemi Muhammadin sollalahu alayhi wa sallam, ijhalny min ibaadikas sooliheen alledheena lahumuli bushraa flu hayaati duniyaa wa fil akhirat laa tebdeela li kalimaati lahi dhaalika huwali faozul azeem. Aameen \n Mu'izzu jameehil anbiyaahi aizzana \n Bi'izzika nagdu thummo namsi biridiwaani",
                "translation": "0 Allah! I beseech You in Your Power that is hidden in \"MEEM\" You are \"The Sovereign; The Guardian of Faith; The Protector, The Giver of Honour, He Who debases ;The Equitable, The Responsive, The Preventer, The Giver, The Maintainer, The Favourer, The Giver of Life, The Creator of Death, The Firm One, The Helper, The Restorer, The Avenger, The Majestic, The Fashioner, The Glorious, The Noble, The Enricher, The Powerful, The E4pediter, The Delayer, The Most Exalted, and The Owner of Atjesty. And by virtue of \"Meem\" in the name of Muhammad, count me among who have the glad-tidings in this world and the hereafter. No alteration in the words of Allah. That it is but a grave success. Ameen \n Giver of Honour to His prophets, Give us honour! It is by Your Grace that we live from dawn to dusk!"
            }]
        },
        {
            "id": 5,
            "name": "Siin",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "AIlahummo innii as'aluka bisirrika fii (SIIN) \"As-Salaam\" \"As-Sattaaar\" \"As-Sereehu\" \"As Semeehu\" ijhalnii min ahli malaam aladhina qod qulta fiihim: \n Salaamuni alaa Nuuhin fil aalaamiin \n Salaamuni alaa Ibraaheemo \n Salaamuni alaa Musa wa Haaruuna Salaamuni alaa Ilyaasiin \n Salaamuni alaa Ibaadihil- ladheenas tofaa \n Salaamuni alaykum bimoo sobaritum fanihmo hukibad- (Isar Salaamun qaolan min Robbir Roheem Salaamuni hiya attaa motilahil fajr Wa salaamuni alali murseleen Wali hamdulilahi robbil alamiin. \n Wa adkhiinii fii zumuratil ladheena tesmohu nidaahahum wa dua'ahahum, wa tusrihu lahumul ijaabata fii kulli waqtin wa heenin. Allahummo antas-salaam ,wa minkas-salamt,wa ilayka yerijihus-salaam, fahayyinaa Robbanaa bis- salaam, wa adkhilnaal jamiata daaraka daaras-salaam, Tabaarakta Robbanaa wa Tahaalayta Yaa dhal Jalaali wali Ikraam. Ayaa Robbi sallimnaa fa-anta salaamunaa Minas-suuhi wal-ashraari min aali tugyaani ",
                "translation": "O Allah! I beseech You in Your Power that is hidden in 'SIIN' You are \"The Peace; The Protector; The Nimble; The All-caring, count me among the people of peace about whom you revealed: \"Peace be upon Nuh in the universe; peace be upon Ibrahim; peace be upon Moses and Harun; peace be upon Ilyasin; peace be upon His servants whom He has chosen; Peace be unto you for that you persevered in patience! Now how excellent is the final Home; \"Peace,\" a word from a Merciful Lord; \"Peace\" it is until the emergence of dawn; And peace be unto the messengers. And praise to Allah, Lord of the worlds. Oh Allah! Include me in the group of those whose calling and prayers You hear every now and then without delay. Oh Allah! You are The Peace. From You is the peace. To You shall the peace return. Spare our lives in peace. Admit us in paradise; Your abode, where peace is domiciled. Our Lord! Blessed and Exalted You are. Oh You, the Lord of Majesty and Bounty. Aameen! \n O Lord, O Lord of \n Peace, save us From harms and evils of the transgressors "
            }]
        },
        {
            "id": 6,
            "name": "Qof",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "AIlah ummo innii as'aluka bisirrika flu (QOF) \"Al-Qohaar\" \"Al-Qoohir\" \"Al- Qoodir\" \"Al-Qoyuum\" \"Al Qoody\" \"Al-Qoobidu \" \"Al-Qowiyyu\" \"Al-Quddus\" \"Al-Qoreeb \" A I I ah ummo bi adihil asmaahi, iqhar lanai andaaha wal-hussaada, minol insi wal jinni,rijaalan wa nisaahan, kabeeran wa sigaaran, haalimon wa jaahilan, muslimon wa kaafiran, inuqeemon wa musaafiran, qoohimon wa qoohidan, Wa huwal goohiru faoqa ibaadihi wahuwal Hakeemul Khabeer. Quli lahu k haaliqu kulli shayhin wa huwal waahidul qohaar. Allahu laa ilaaha illa huwal hayyul qoyyum, huwal Awwal wal AAkhir waz- Zoohir wal Baatin, Al Ahadu As-Samad alladhi lam yelid wa lam yuulad wa lam yekun lahu kufuwan ahadun. \n Biqahrika ya qohaaru faqhar aduwwanaa Wadammir sarii'an ahala khasmi watugiyani ",
                "translation": "0 Allah! I beseech You in Your Power that is hidden in 'QOF'. You are \"The Subduer; The Overcomer, The Able,The Self-Subsisting, The Judge, The Constrictor, The Trustee, The Holy; The Nearer. 0 Lord, by Your beautiful names , subdue our foes and the envious ones among the mankind and the jinn, males or females, young or old, the learned among them or the ignorant, the believers among them and the disbelievers, the dwellers among them and the sojourners , while standing or sitting. \"And He is the subjugator over His servants. And He is the Wise, the Acquainted [with all]\". \"Say, \"Allah is the Creator of all things, and He is the One, the Prevailing\". \"Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence\". He is the First, the Last, the Manifest, the Hidden, the One, the Eternal Who begot nothing nor was He begotten, and no one is like Him. Aameen.! \n O the Subduer! Subdue our enemies Subdue our foes And destroy my adversary and the transgressor."
            }]
        },
        {
            "id": 7,
            "name": "Kaf",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "Allahumma innii as'aluka bisirrika fii (KAF) \"Al-Kabeeru\" \"Al-Kaafy\" \"Al-Kareem\" ijhalnii minal kubaraahil kuramaahi,wa bisirrika fii kaafi kun fayakun wa qulta fii kitaabika: Badeehus-samoowaati wal ardi,wa idhaa qodoo amran fa innamoo yaquulu lahu Kun Fayakun.   Qoolat Robbi Annay yaquunu Lii waladun, walam yemsasinii basharun ,Qoola kadhaalikil-Lahu yakhluku mon yashaau,Idhaa qodoo Amran fa Innamaa yaquulu lahu Kim Fayakun. Irma masala Isa inda Lahi kamosali Aadamo , khalaqohu min turaabin, thummo qoola lahu Kun Fayakun. \n Wahuwa ladhii khalaqas samoowaati wal ardo bil haqqi, wa yaoma yaquulu Kum Fayakun. \n Innamoo qaolunaa li shayhin idhaa aradinaahu an-naquula lahu Kum Fayakun. \n Moo kaana lil-Lahi an yettekhisa min waladin Subuhaanahu idhaa qodoo amran fa innama ya quulu lahu Kun Fayakun. \n Innamaa amruhu idhaa araada shayhan, an yaquula lahu Kun Fayakun. \n Huwa ladhii yuhyii wa yumeetu, fa idhaa qodoo amran fa innama yaquulu lahu Kim Fayakun. \n Ilaahy as'aluka bikaafi-1 kulli an teqdiya hawaahijy antal munaadal madihuwwu bi'asmoo'ikal husnaa .aameen \n Jaleelun- azeemuns- shahni jalla ilaahunaa kareemun azeemul-monni yaa khayra monnani",
                "translation": "O Allah! I beseech You in Your Power that is hidden in 'KAF'. You are \"The Greatest; The Sufficient; The Generous, include me among the important and generous ones. (Hear my prayers) By Your Might in \"Kai\" of \"Kun fa yakun\" (Be and it is) revealed in Your Book as thus: \n \"Originator of the heavens and the earth. When He decrees a matter, He only says to it, \"Be,\" and it is\" (Q2:117) \"She said, \"My Lord, how will I have a child when no man has touched me?\" [The angel] said, \"Such is Allah ; He creates what He wills. When He decrees a matter, He only says to it, 'Be,' and it is\" (Q3:47). \n \"Indeed, the example of Jesus to Allah is like that of Adam. He created Him from dust; then He said to him, \"Be,\" and he was\" (Q3:59). \"And it is He who created the heavens and earth in truth. And the day He says, \"Be,\" and it is...\" (Q6:73). \"Indeed, Our word to a thing when We intend it is but that We say to it, \"Be,\" and it is\" (Q60:40). \n \"It is not [befitting] for Allah to take a son; exalted is He! When He decrees an affair, He only says to it, \"Be,\" and it is\" (Q19:35). \n \"His command is only when He intends a thing that He says to it, \"Be,\" and it is\" (Q36:82). \n\"He it is who gives life and causes death; and when He decrees a matter, He but says to it, \"Be,\" and it is\" (Q40:68) My Lord! I ask You, by virtue of the \"Kaf” that embodies all things, to care for my needs. You are the One we call upon through Your awesome names. Aameen! \n O the Magnificent, the Exalted in His Dealings The Glorious, the Great Giver, the Ultimate Giver!"
            }]
        },
        {
            "id": 8,
            "name": "Ha",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "Allahummo innii as'aluka bisirrika flu (HAAHI), \"Al Haleem\" \"Al-Hakeem\" \"Al- Hannaan\" \"Al- Haseeb\" \"Al-Hayyu\" \"Al-Hameedu\" \"Al-Hafeezu\" \"Al- Hakamu\" \"Al Haqqu\" wa bisirrika flu hamdi al-ladhi hamidta bihi nafsaka \n Al-hamdulillahi Robbil alameen. Al-hamdulil-lahi ladhi khalaqos - samaawaati wal-ardo wa jahalaz- zulumooti wan-nuura, thumma ledheena kafaru birobbihim yandiluun. \n Al-hamdulil-lahi ladhi anzala alaa abudihil kitaaba wa lam yejihal-lahu iwajan . \n Al-hamdulil-lahi ladhi lahu moo fis-samoowaati wa moo flu ardi wa lahul-hamdu fil aakhirat wa huwal-hakeemul-khabeer. \n Al-hamdulillahi- faatiris-samoowaati wal-ardi jaa hilili malaaikati rusulani uuly ajinihatin mosinaa wasulaatha warubaaha, yeseedu fii khalki mon yaa shau , inna laha ala kulli shayhin qodeer \n Alhamdulil-lahi ladhi az'aba annol hazana inno Robbana lagafuurun shakuurun, al-ladhi a-hallanaa daaral-muqomoti min fodlihi laa yamossunaa fiihaa nosobun wa laa yamassunaa fiiha luguub. Ijhalnii minal haamideen al-ladhiina naa luu fodlali hamdilil-lahi, wa'ahyii- lanai- arwaaha bil- uluumi wal- fuhuumi wal-fliyuudooti sirran wa jahran ,wa- ahkum alal hussaadi wal-shraari, wa-najjinaa min kaidihim wa sharrihim. Aameen! Ayaa hakamal- hukkaami wal-adlu hukmuhu Alaa haasidiinah-kum bi waylin wakhusraani",
                "translation": "Oh Allah! I supplicate to You in Your Power that is hidden in\"HA\". You are \"The Forbearing One, The Kind, The Reckoning One, The Ever-Living, The Praise-worthy, The Protector, The Judge \"and by virtue of the praise of Yourself by Yourself (Praise be to Allah, the Lord of the universe). \"[All] praise is [due] to Allah, who created the heavens and the earth and made the darkness and the light. Then those who disbelieve equate [others] with their Lord\" (Q6:1). \"[All] praise is [due] to Allah, who has sent down upon His Servant the Book and has not made therein any deviance\" (Q18:1). \n \"[All] praise is [due] to Allah, to whom belongs whatever is in the heavens and whatever is in the earth, and to Him belongs [all] praise in the Hereafter. And He is the Wise, the Acquainted\" (34:1). \n \"[All] praise is [due] to Allah, Creator of the heavens and the earth, [who] made the angels messengers having wings, two or three or four. l le increases in creation what He wills. Indeed, Allah is over all things competent\" (Q35:1). \n\"And they will say, \"Praise to Allah, who has removed from us [all] sorrow. Indeed, our Lord is Forgiving and Appreciative\" (Q35:34). \n \"He who has settled us in the home of duration out of His bounty. There touches us not in it any fatigue, and there touches us not in it weariness [of mind]\" (Q35:35). \nOh Lord! By virtue of these verses, count me among those that give Your praise; those that have received the glory of Your praise. Bless our soul with knowledge, understanding and spiritual bliss in secret and in the open. Release Your judgment against the envious and evil ones. Save us from their evil plots and machinations. Aameen! \nO the Best of judges! Your judgment is that of justice Serve with destruction those who have evil envy for us"
            }]
        },
        {
            "id": 9,
            "name": "Lam",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "Allahummo iniriias'a I u ka bi sirrika fit ( LAM) \"Al-Lateer Waqod qulta Iii kitaabika \"Allahu Lateefun bi ibaadihi yerizuku mon yashaau wa huwal- qowiyyul azeez. Laa tudirikuhu I absooru wa huwa yud-rikuhul absoora wa huwal lateeful khabeer. Alaa yahlamu mon khalaqo wa huwal-lateeful khabeer. Irma Robby Lateefun limoo yashaau ,innahu huwal-aleemul-hakeem. Nas'alukal-laha bi lutfikal khafiyyi al-ladhii idha lattofta bihil abda kafaahu,tadaaraknaa bilut-fikal-khafiyyi yaa lateefal altoof. Alahummo ultuf bins lutfan izzan wa mahna. Aameen \nBinal-tuf lateefan bil bariyyati minnatan bilutfika fakshif kulla karbii wa ahazaani ",
                "translation": "0 Allah! I beseech You in Your Power that is hidden in 'LAM' You are \"The Subtle\". You revealed in Your Book that: \"Allah is Subtle with His servants; He gives provisions to whom He wills. And He is the Powerful, the Exalted in Might\" (Q42:19). \"Vision perceives Him not, but He perceives [all] vision; and He is the Subtle, the Acquainted\" (Q6:103).\n \"Does He who created not know, while He is the Subtle, the Acquainted?\" (Q67:14). \"Indeed, my Lord is Subtle in what He wills. Indeed, it is He who is the Knowing, the Wise\" (Q12:100). Oh Allah! We ask by Your Mercy, which suffices a servant, to be lenient with us. Oh You, the Most Merciful, enclose us in Your Mercy in all ramifications. Aameen! \n O The Most Courteous to the creation! Give us Your Blessings and absolve us of grief and sorrows"
            }]
        },
        {
            "id": 10,
            "name": "Ain",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "AIlahumma Innii As'aluka bi sirrika Iii (AIN), \"Al-Aleem\" \"A I- A zeez\" \"Al-Adlu\" \"Al-Azeem\" \"Al-Aliyy u\" \"A I-A fuwwu\" Ijhalnii Minal-Ulamaahil-Ladhiina Yuhizzuna Deenal-Lahil Qoohimeena Bil Qisti Wa Yuhazzimuuna Slut aairal-Lahi, Antal- Azeezul-Hakeem, Wa Antal-Aliyyul-Azccrnu,Wa Anta Robbul-Arshil-Azeem, Wa Antal Afuwwul-Gafuur. Aameen  \n Azeemun ilaahun-nasi jalla jalaaluhu Shakuuruni ayaa hannaanu famnah bi'ihsaani",
                "translation": "Oh Allah! I ask You by the might of \"AIN\" which symbolizes Your names \" The Ever-Knowing, The Mighty, The Just, The Awesome, The Most High, The Supreme Pardoner\", to make me one of the scholars who promote You. P Path (Islam) and who stand for justice and venerate Your Rites. You are The Honorable, The Wise. You are The most High, The Awesome. You are the occupant (;f- the Awesome Throne. You are The Pardoner, The Oft-Forgiving.Ameen \n O ALLAH! The Magnificent! The Lord of mankind! So Great is Your Majesty! You are The Merciful! Give us Your Blessings."
            }]
        },
        {
            "id": 11,
            "name": "Yao",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "Alahumma inni as'aluka bi sirrika flu (SOD) \"As-Sobuur\" \"As-Somod\" Allahus-Somodu lam yelid wa lam yuhlad walam yekun lahu kufuwan ahadun. Allahunima ijhalni somodan musommodan, wa ajib lii zoohiran wa baatinan .Aameen! \n Ayaa Waahidu yaa Ahadu yaa Somodu yaa Farad Quluubal-barayaa sakkhiran lii biwujdaani \n Rosheedun wakulul-khaliqi yatlubu rushdahu Wa anta Sobuurun lil-anoomi bigufraani \n Bi asma'ikal-husnaa bi jaahi nobiyyinaa Muhatnmadi Abdil-lahi sofwati adnaani \n Fa kaatibu aadhaa Robbiun najili moolikin Adebayo zidhu Robbi min kulli irfaani \n Solaatun watesleemun alaa seyyidil-wara Muhammadi khayril-khaliqi ahsana insaani",
                "translation": "O Allah! I ask You by the might inherent in \"SOD\". You are \"The Patient and The Eternal\" as revealed in the Qur'an \"...Allah, the Eternal Refuge. He neither begets nor was He begotten. Nor is there to Him an equal\" (Q112: 2-4), to put me in Your Eternal Sanctuary and answer my prayers in privacy and public. Aameen! \n O the Only One, the Unique the One upon whom all depend Soften for me the hearts of mankind and give me their love \n O the Guide from Whom the entire creations seek guidance You are the Most Patient It is YOU Who forgives mankind of wrong doings We seek Your blessings by Your Beautiful Names And by the virtue of our Prophet, Mohammad the son of Abdullah \n The best of the Adnan The author of this humble work is Robiu Adebayo Bin Malik He seeks You for more of divine knowledge May Allah's Blessings and Peace be bestowed upon the best of mankind Muhammad, the most generous "
            }]
        },
        {
            "id": 12,
            "name": "",
            "subhead": "",
            "content": [{
                "id": 1,
                "transliteration": "Allahumma solli 'alaa Sayyidina Muhammodil faathi limo ugliqa, walikhaatimi lira csabaqa, Naasiriliaqqi biliaqqi, waliaadi ilaa siraatika limustaqeem, wa 'alaa alihi aqqo qodrihi wamiqdaarihi liazeem",
                "translation": "O Allah, bestow Your blessings upon our leader Muhammad, the opener of the closed (door) and the last of the apostles, the advocate of the truth by the truth, and the guide to Your straight path and upon his households in manifolds as much as his magnificent worth.) "
            }]
        },
        {
            "id": 13,
            "name": "SUPPLICATION BY SHEIKH MUH ROBIU ADEBA YO ABDUL MALIQ R.T.A",
            "subhead": "The Sixth Step: The worshiper will lend the concluding part of the prater which is termed as Khutba. It reads as follows",
            "content": [{
                "id": 1,
                "transliteration": "Ahuuzu Bil-lahi Min Umyin Wa Min Somomin Wa M .1 uzaamin Wa Barsin akatha Shalali \n Habulii Baneena Banaatin Anta Zuu Karamin Wazid salaamota Fii Jismii Bila Molali \n Moggit Idaanaa Bi Juuhin Anta Mu'ntaqimun Wa Iiis-sudaahi Wa Daokhin Thummo Bi Ddumoli \n Sellim Abiidaka Min Juuhin Wa Min Saqomin Wa Min Junuunin Wa Daosin akatha Fashali \n Qohhir Husaadan Lanaa Waqhid Hum Bil Warami Khawwifhum Yaa Robbanaa Noqqishum Bil Ilali \n Kun Lii Waliyyan Naseeran Anta Haafizuna Wahsin Khawaatimana Mannan Wa Bil Fadili \n Hayyun Qoyyumu Fahayi Kulla Harakatinaa Kazaaka Arwaahinaa Bil Ilmi Wal- Amoli \n Laysa Shebiihun Li Robbil Khalqi Zuu Abadin Wa Anta Moljahunoo Qosidan Wa Fil Amoli Allahumma solli 'alaa Sayyidina Muhammodil faathi limo ugliqa, walikhaatimi lira csabaqa, Naasiriliaqqi biliaqqi, waliaadi ilaa siraatika limustaqeem, wa 'alaa alihi aqqo qodrihi wamiqdaarihi liazeem \n Alayka Tuklaanu Fii Sirri Wa Fil Alani Wa Fi Sarraahi Wa Dorraahi Wa Fii Wajalin \n Yaal-Lahu Yaal-Lahu Yaa Allahu Yaa Khaaliqii Dommin Ridooka Lanaa Monnaa Bila Khalalin \n Solli Wa Sellim Alaa Khayril Bariyyati Yaa Mon Huwa Rahamotul Uzmaa Bithal Adili. ",
                "translation": "AL – KHUTBA\n I seek refuge in Allah Against blindness and deafness And against fracture, leprosy and paralysis. \n Bless me with (bright) children You are the Most Generous. \n Give me more of sound health devoid of weariness. With hunger punish our enemies Inflict them with headache, dizziness, and boil For You are the Avenger. \n Relieve Your slaves of hunger and malady And of insanity, invalidity, and failure Subdue the envious ones. \n With tumor incapacitate them; O Lord! Shroud them in fright; Wipe them off with ailnients. 0 Lord! Be my guardian and helper Grace our end with mercy and honour. \n O the The Everliving, the Sustainer, Inject life into our struggle, Equip our soul with knowledge and practice. \n None resembles the Lord of Creation, The Ever-living God, You are our source of hope and succor.\n Upon You we rely while in secret and open. As well as in comfort, hardship and fear \n O Allah! 0 Allah! 0 Allah! Oh my Creator! Grant us Your Pleasure and Mercy in full measure. Send Your Blessings and Mercy Upon the best of mankind 0 Lord of Heavenly Mercy and Justice! "
            }]
        },
        {
            "id": 14,
            "name": "PART TWO",
            "subhead": "How to Defeat the Tyrants This part contains a special prayer for defeating tyrants and oppressors in our life. Both the transliterated and translated versions of the prayers are rendered here for those who believe in the power of prayers. The prayer is called \"TEDMEERUL JABAABIRA\" The worshiper is encouraged to learn how to recite the prayer in Arabic as transliterated. The translation version can also be recited. Whichever version the worshiper uses, the prayer's efficacy still holds.",
            "content": [{
                "id": 1,
                "transliteration": "Ahuuzu Bil-lahi Min Umyin Wa Min Somomin Wa M .1 uzaamin Wa Barsin akatha Shalali \n Habulii Baneena Banaatin Anta Zuu Karamin Wazid salaamota Fii Jismii Bila Molali \n Moggit Idaanaa Bi Juuhin Anta Mu'ntaqimun Wa Iiis-sudaahi Wa Daokhin Thummo Bi Ddumoli \n Sellim Abiidaka Min Juuhin Wa Min Saqomin Wa Min Junuunin Wa Daosin akatha Fashali \n Qohhir Husaadan Lanaa Waqhid Hum Bil Warami Khawwifhum Yaa Robbanaa Noqqishum Bil Ilali \n Kun Lii Waliyyan Naseeran Anta Haafizuna Wahsin Khawaatimana Mannan Wa Bil Fadili \n Hayyun Qoyyumu Fahayi Kulla Harakatinaa Kazaaka Arwaahinaa Bil Ilmi Wal- Amoli \n Laysa Shebiihun Li Robbil Khalqi Zuu Abadin Wa Anta Moljahunoo Qosidan Wa Fil Amoli Allahumma solli 'alaa Sayyidina Muhammodil faathi limo ugliqa, walikhaatimi lira csabaqa, Naasiriliaqqi biliaqqi, waliaadi ilaa siraatika limustaqeem, wa 'alaa alihi aqqo qodrihi wamiqdaarihi liazeem \n Alayka Tuklaanu Fii Sirri Wa Fil Alani Wa Fi Sarraahi Wa Dorraahi Wa Fii Wajalin \n Yaal-Lahu Yaal-Lahu Yaa Allahu Yaa Khaaliqii Dommin Ridooka Lanaa Monnaa Bila Khalalin \n Solli Wa Sellim Alaa Khayril Bariyyati Yaa Mon Huwa Rahamotul Uzmaa Bithal Adili. ",
                "translation": "Lord! Whom no hurricane can blows off existence. You are Ilie Lord who never gets exhausted by the seekers' voice from heavens and earth. You are the Lord who can never be caused to forget His servants' prayers regardless of time length. 0 Lord! who entails everything and from Him everything originates. Everything lies with Him and everything returns to Him. With Him everything exists and to Him everything belongs. ( ) Lord! by Whose Command the earth and the hereafter operate. 0 Lord Who breathes life into every creature. 0 Lord in Whom resides the power to do all things; He is alone the Able One. O Lord Who own determinations; He alone determines everything. 0 Lord Who owns the source of hearing; He alone is the All-hearing. 0 lord who owns the source of sighting; He alone is the All-seeing. 0 lord who owns the source of speech; \n He alone is the All-able to speak. 0 Lord who owns the source of knowledge; He alone is the All-knowing. 0 Lord, the Ever-Living One; No Ever-Living but He. 0 Lord who begets not nor was He begotten and there none like unto Him. O our Lord! By Your awesome names and Your great attributes , by the mysteries endowed to the ultimate Imam, Sayyidna Muhammad (Sallallahu 'alayhi wasallam), by the honour You accorded the seal of your loved servants, Sayyidina Ahmad bin Muhammad At-Tijani, by Your favour upon Sheik Ibrahim Abdullahi Niyas Al-kaolakhy, the flag-bearer of of Shari'a and Sufism; and by the virtue of all Prophets and Your chosen ones, I pray that You provide my needs, and subdue my foes as you have promised in the Qur'an wherein you said that : 'And, verily, Our Word has gone forth of old for Our slaves, the Messengers. That they verily would be made triumphant. And that Our hosts, they verily would be the victors' (Q. 37: 171-173). \n At the end of the prayer, the worshiper should proceed to reading following: 1. the verse: \" Wa inna Jundana laumuligalibun\" (111 times) 2. Surah Al-fat'ha (once) 3. Solatul-fat'hi. (3 times) "
            }]
        },
        {
            "id": 15,
            "name": "SHEIKH MUH. ROBIU ADEBAYO ABD MALIK (R.T.A.).",
            "subhead": "How to Defeat the Tyrants This part contains a special prayer for defeating tyrants and oppressors in our life. Both the transliterated and translated versions of the prayers are rendered here for those who believe in the power of prayers. The prayer is called \"TEDMEERUL JABAABIRA\" The worshiper is encouraged to learn how to recite the prayer in Arabic as transliterated. The translation version can also be recited. Whichever version the worshiper uses, the prayer's efficacy still holds.",
            "content": [{
                    "id": 1,
                    "transliteration": "Duaaiyas'mah Yaa sameehu bi sur'atin kadhaaka du'aahat-tabiheena bikhulsooni",
                    "translation": "Listen To my prayer O the All-Hearing! And hear the prayer of my committed followers "
                },
                {
                    "id": 2,
                    "transliteration": "Wayaa saami'al-asiwaati fil-ardi was-samoo Waya muhsinan lilmuhsineena kadhal-jaani",
                    "translation": "O the All-Hearing of voices on earth and in the heaven ! 0 the Beneficent to the good doers!"
                },
                {
                    "id": 3,
                    "transliteration": "Baseerun bikulli shayhin lashakka shaa'idan Bi moriau kullul-khaliqi turran bi itqooni",
                    "translation": "O the All-Seeing! There is no doubt that . You perfectly see everything"
                },
                {
                    "id": 4,
                    "transliteration": "Taraanii wahaalii yaa baseerun fafarrijan Kuruubiya washib kulla sharrii wa adjaaanii",
                    "translation": "O the All-Seeing! You see me in my pitiful condition: Free me from grief Give me happiness Save me from evils and darkness May Almighty Allah send His Blessings and Mercy on the Holy Prophet as much as he deserves to be blessed"
                }
            ]
        }
    ]
}